local t = require 'type/estr'
if type(t) ~= 'table' then t = {} end
t.estr_sex = {'男', '女','其他'};
t.estr_事件触发方式 = {'对话/调查', '使用物品','行走经过'};
t.estr_可设置属性 = {'生命', '生命上限', '内力', '内力上限', 
                    '力道', '护体', '身法', 
                    '拳掌', '御剑', '暗器', 
                    '医疗', '用毒', '解毒', 
                    '福缘', '声望', '悟性', '侠义', 
                    '等级', '经验', '经验上限', '学点', '银两', '集气', '杀孽' };
t.estr_对手属性 = {'生命', '内力', '身法', 
                    '攻击伤害下限', '攻击伤害上限', '绝招伤害下限', 
                    '绝招伤害上限', '绝招耗内'};
t.estr_属性设置方式 = {'增减', '乘以', '设为'};
t.estr_效果类型 = {'通常', '通常(大随机)', '通常(小随机)', '通常(内功)', '吐纳术','寒冰真气', '北冥神功', '太玄神功', '绝招',
                    '吃药', '飞镖', '生死符'
                    };
t.estr_物品类型 = {'武器', '防具', '暗器', '丹药', '秘籍', '事件'}
t.estr_绝招类型 = {'通常', '左右互搏', '吐纳术', '寒冰真气', '北冥神功'}
t.estr_能否通过 = {'不改变', '可', '不可'};
t.estr_战斗动作 = {'待机动作', '攻击动作', '绝招动作', '失败动作'};
t.estr_战斗角色 = {'我方', '对手'};
t.estr_战斗属性 = {'生命', '内力', '身法', '集气'};
t.estr_通知飘字位置 = {'右下', '右上', '左上', '左下'};
return t
