--[[0

]]
local G = require "gf"
local t = G.api
local L = {}
--type=战斗剧本
--private=false
t['战斗_序_战斗教学'] = function()
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020005,G.QueryName(0x1003000c),nil)
	G.call("战斗系统_设置对手属性",'生命', 10)
	G.call("战斗系统_设置对手属性",'内力', 10)
	G.call("战斗系统_显示")
	G.call("战斗系统_显示圆圈",- 101,192,144,56,255.0)
	G.call("战斗系统_显示战斗对话","敌人的血量和内力。")
	G.call("战斗系统_显示圆圈",101,192,144,56,255.0)
	G.call("战斗系统_显示战斗对话","主角的血量和内力。血量变空时,战斗失败。")
	G.call("战斗系统_显示圆圈",- 101,155,144,24,255.0)
	G.call("战斗系统_显示战斗对话","敌人的时间槽。槽满时，敌人即开始发动攻击。")
	G.call("战斗系统_显示圆圈",- 214,- 122,48,48,255.0)
	G.call("战斗系统_显示战斗对话","显示主角属性的按钮。")
	G.call("战斗系统_显示圆圈",- 268,- 187,48,48,255.0)
	G.call("战斗系统_显示战斗对话","在大地图遇敌战斗时，可用来逃跑。但是有可能失败。")
	G.call("战斗系统_显示圆圈",- 31,- 159,48,48,255.0)
	G.call("战斗系统_显示战斗对话","道具/招式 切换按钮。")
	G.call("战斗系统_显示圆圈",34,- 207,48,48,255.0)
	G.call("战斗系统_显示战斗对话","普通攻击按钮，普通攻击亦可威力升级。")
	G.call("战斗系统_显示圆圈",- 117,- 164,144,48,255.0)
	G.call("战斗系统_显示战斗对话","招式类别选择按钮。")
	G.call("战斗系统_显示圆圈",- 230,- 204,48,48,255.0)
	G.call("战斗系统_显示战斗对话","招式按钮。未学到招式时，图标显示为“封”。")
	G.call("战斗系统_显示圆圈",- 122,- 232,144,24,255.0)
	G.call("战斗系统_显示战斗对话","主角的气槽。发招时的必要条件是要先攒满一定长度的气槽。")
	G.call("战斗系统_隐藏圆圈")
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_序_老虎'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020004,G.QueryName(0x10030006),nil)
	G.call("战斗系统_设置对手属性","生命",80)
	G.call("战斗系统_设置对手属性","内力",5)
	G.call("战斗系统_设置对手属性","身法",15)
	G.call("战斗系统_设置对手属性","攻击伤害下限",30)
	G.call("战斗系统_设置对手属性","攻击伤害上限",35)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,10)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","这场战斗赢得太容易了。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_序_庸医'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020002,G.QueryName(0x10030004))
	G.call("战斗系统_设置对手属性",'生命', 1000)
	G.call("战斗系统_设置对手属性",'内力', 5)
	G.call("战斗系统_设置对手属性",'身法', 15)
	G.call("战斗系统_设置对手属性",'攻击伤害下限', 45)
	G.call("战斗系统_设置对手属性",'攻击伤害上限', 50)
	G.call("战斗系统_设置对手属性",'绝招伤害下限', 0)
	G.call("战斗系统_设置对手属性",'绝招伤害上限', 0)
	G.call("战斗系统_设置对手属性",'绝招耗内', 10)
	G.call("战斗系统_设置胜利奖励",0,0,10)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","这场战斗赢得太容易了。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_主地图_莽牯朱蛤'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020018,G.QueryName(0x10030010),false)
	G.call("战斗系统_设置对手属性","生命",2500)
	G.call("战斗系统_设置对手属性","内力",1220)
	G.call("战斗系统_设置对手属性","身法",55)
	G.call("战斗系统_设置对手属性","攻击伤害下限",0)
	G.call("战斗系统_设置对手属性","攻击伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招伤害下限",355)
	G.call("战斗系统_设置对手属性","绝招伤害上限",375)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,200)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","这种奇异的怪蛙，说不定会有独特的用途，得好好保存起来。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_主地图_封不平'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602001d,G.QueryName(0x10030009),false)
	G.call("战斗系统_设置对手属性","生命",3200)
	G.call("战斗系统_设置对手属性","内力",2000)
	G.call("战斗系统_设置对手属性","身法",65)
	G.call("战斗系统_设置对手属性","攻击伤害下限",180)
	G.call("战斗系统_设置对手属性","攻击伤害上限",220)
	G.call("战斗系统_设置对手属性","绝招伤害下限",300)
	G.call("战斗系统_设置对手属性","绝招伤害上限",380)
	G.call("战斗系统_设置对手属性","绝招耗内",250)
	G.call("战斗系统_设置胜利奖励",30,0,320)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","现在知道我的厉害了吧。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_主地图_老虎'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 10) + 1
	local int_强度2 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020004,G.QueryName(0x10030006),true)
	G.call("战斗系统_设置对手属性","生命",150 * int_强度)
	G.call("战斗系统_设置对手属性","内力",5)
	G.call("战斗系统_设置对手属性","身法",15)
	G.call("战斗系统_设置对手属性","攻击伤害下限",35 * int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",40 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,25 * int_强度2)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","这场战斗赢得太容易了。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_主地图_毛贼'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 10) + 1
	local int_强度2 = G.call("运算_向下取整",int_等级 / 8) + 1
	local int_强度3 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602005f,G.QueryName(0x10030014),true)
	G.call("战斗系统_设置对手属性","生命",500 * int_强度)
	G.call("战斗系统_设置对手属性","内力",50)
	G.call("战斗系统_设置对手属性","身法",35)
	G.call("战斗系统_设置对手属性","攻击伤害下限",40 * int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",45 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,10 * int_强度2,45 * int_强度3)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","小小毛贼简直不值一晒。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_主地图_恶贼'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 10) + 1
	local int_强度2 = G.call("运算_向下取整",int_等级 / 8) + 1
	local int_强度3 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020060,G.QueryName(0x10030015),true)
	G.call("战斗系统_设置对手属性","生命",800 * int_强度)
	G.call("战斗系统_设置对手属性","内力",200 * int_强度)
	G.call("战斗系统_设置对手属性","身法",65)
	G.call("战斗系统_设置对手属性","攻击伤害下限",55 * int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",75 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,30 * int_强度2,75 * int_强度3)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","你们这群恶人遇到我算是你们倒霉。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_主地图_恶霸'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 10) + 1
	local int_强度2 = G.call("运算_向下取整",int_等级 / 10) + 1
	local int_强度3 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020061,G.QueryName(0x10030016),true)
	G.call("战斗系统_设置对手属性","生命",1900 * int_强度)
	G.call("战斗系统_设置对手属性","内力",40 * int_强度)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",180 * int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",200 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,55 * int_强度2,155 * int_强度3)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","再去修炼几辈子再来报仇吧！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_主地图_神仙'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020051,G.QueryName(0x10030019),false)
	G.call("战斗系统_设置对手属性","生命",2000*int_强度)
	G.call("战斗系统_设置对手属性","内力",1600*int_强度)
	G.call("战斗系统_设置对手属性","身法",100)
	G.call("战斗系统_设置对手属性","攻击伤害下限",200*int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",300*int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",400*int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害上限",600*int_强度)
	G.call("战斗系统_设置对手属性","绝招耗内",150*int_强度)
	G.call("战斗系统_设置胜利奖励",0,0,2000*int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","原来神仙前辈的武功如此博大精深，令晚辈十分佩服。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_衡阳武馆_馆主'] = function(percent_功力)
	local enum_战斗结果_战斗结果 = nil
	if percent_功力 == nil then 
		percent_功力 = 1
	else 
	end
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020009,G.QueryName(0x1003001f),false)
	G.call("战斗系统_设置对手属性","生命",1000 * percent_功力)
	G.call("战斗系统_设置对手属性","内力",250 * percent_功力)
	G.call("战斗系统_设置对手属性","身法",80 * percent_功力)
	G.call("战斗系统_设置对手属性","攻击伤害下限",200 * percent_功力)
	G.call("战斗系统_设置对手属性","攻击伤害上限",200 * percent_功力)
	G.call("战斗系统_设置对手属性","绝招伤害下限",350 * percent_功力)
	G.call("战斗系统_设置对手属性","绝招伤害上限",350 * percent_功力)
	G.call("战斗系统_设置对手属性","绝招耗内",50 * percent_功力)
	G.call("战斗系统_设置胜利奖励",0,0,150 * percent_功力)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢馆主承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_衡阳_费斌'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020062,G.QueryName(0x10030009),false)
	G.call("战斗系统_设置对手属性","生命",3000)
	G.call("战斗系统_设置对手属性","内力",2000)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",220)
	G.call("战斗系统_设置对手属性","攻击伤害上限",250)
	G.call("战斗系统_设置对手属性","绝招伤害下限",480)
	G.call("战斗系统_设置对手属性","绝招伤害上限",510)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",50,50,300)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","嵩山派武功原来也不过如此而已。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_衡阳_打手'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020053,G.QueryName(0x10030004),false)
	G.call("战斗系统_设置对手属性","生命",2100)
	G.call("战斗系统_设置对手属性","内力",1000)
	G.call("战斗系统_设置对手属性","身法",G.call("运算_随机数",1,100))
	G.call("战斗系统_设置对手属性","攻击伤害下限",200)
	G.call("战斗系统_设置对手属性","攻击伤害上限",260)
	G.call("战斗系统_设置对手属性","绝招伤害下限",480)
	G.call("战斗系统_设置对手属性","绝招伤害上限",540)
	G.call("战斗系统_设置对手属性","绝招耗内",30)
	G.call("战斗系统_设置胜利奖励",0,0,200)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","一群有眼无珠的家伙，早就该修理你们！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_襄阳_官兵'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x5602005e,G.QueryName(0x10030020),false)
	G.call("战斗系统_设置对手属性","生命",2800)
	G.call("战斗系统_设置对手属性","内力",250)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",350)
	G.call("战斗系统_设置对手属性","攻击伤害上限",400)
	G.call("战斗系统_设置对手属性","绝招伤害下限",600)
	G.call("战斗系统_设置对手属性","绝招伤害上限",600)
	G.call("战斗系统_设置对手属性","绝招耗内",50)
	G.call("战斗系统_设置胜利奖励",0,0,380)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","你们太废物了。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_襄阳_丁典'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602005c,G.QueryName(0x1003001f),false)
	G.call("战斗系统_设置对手属性","生命",3800)
	G.call("战斗系统_设置对手属性","内力",2500)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",380)
	G.call("战斗系统_设置对手属性","攻击伤害上限",430)
	G.call("战斗系统_设置对手属性","绝招伤害下限",690)
	G.call("战斗系统_设置对手属性","绝招伤害上限",790)
	G.call("战斗系统_设置对手属性","绝招耗内",80)
	G.call("战斗系统_设置胜利奖励",0,0,540)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","看来你的武功的确比我略低一些。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_少林_无名僧'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020035,G.QueryName(0x1003001e),false)
	G.call("战斗系统_设置对手属性","生命",28000)
	G.call("战斗系统_设置对手属性","内力",35000)
	G.call("战斗系统_设置对手属性","身法",100)
	G.call("战斗系统_设置对手属性","攻击伤害下限",18000)
	G.call("战斗系统_设置对手属性","攻击伤害上限",18500)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",4000)
	G.call("战斗系统_设置对手属性","绝招耗内",100)
	G.call("战斗系统_设置胜利奖励",0,0,28000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","侥幸胜出，惭愧惭愧。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_少林_僧人'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602001e,G.QueryName(0x1003000b),false)
	G.call("战斗系统_设置对手属性","生命",550*int_强度)
	G.call("战斗系统_设置对手属性","内力",250)
	G.call("战斗系统_设置对手属性","身法",45)
	G.call("战斗系统_设置对手属性","攻击伤害下限",45*int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",50*int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",70*int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害上限",80*int_强度)
	G.call("战斗系统_设置对手属性","绝招耗内",50)
	G.call("战斗系统_设置胜利奖励",0,0,70*int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师兄承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_少林_僧人2'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 10) + 1
	local int_强度2 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602001e,G.QueryName(0x1003000b),false)
	G.call("战斗系统_设置对手属性","生命",1000*int_强度)
	G.call("战斗系统_设置对手属性","内力",200*int_强度)
	G.call("战斗系统_设置对手属性","身法",69)
	G.call("战斗系统_设置对手属性","攻击伤害下限",65*int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",80*int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,75*int_强度2)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","今天可算出了口恶气！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_武当_宋青书'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602002f,G.QueryName(0x10030011),false)
	G.call("战斗系统_设置对手属性","生命",550 * int_强度)
	G.call("战斗系统_设置对手属性","内力",250)
	G.call("战斗系统_设置对手属性","身法",45)
	G.call("战斗系统_设置对手属性","攻击伤害下限",45 * int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",50 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",70 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害上限",80 * int_强度)
	G.call("战斗系统_设置对手属性","绝招耗内",50)
	G.call("战斗系统_设置胜利奖励",0,0,70 * int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师兄承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_武当_阿三'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x56020033,G.QueryName(0x1003001f),false)
	G.call("战斗系统_设置对手属性","生命",6500)
	G.call("战斗系统_设置对手属性","内力",3000)
	G.call("战斗系统_设置对手属性","身法",80)
	G.call("战斗系统_设置对手属性","攻击伤害下限",860)
	G.call("战斗系统_设置对手属性","攻击伤害上限",920)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1700)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1830)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",0,0,780)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","微末本事也来送死！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_武当_阿大'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x56020031,G.QueryName(0x10030011),false)
	G.call("战斗系统_设置对手属性","生命",8500)
	G.call("战斗系统_设置对手属性","内力",6000)
	G.call("战斗系统_设置对手属性","身法",70)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1560)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1620)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2100)
	G.call("战斗系统_设置对手属性","绝招伤害上限",2290)
	G.call("战斗系统_设置对手属性","绝招耗内",200)
	G.call("战斗系统_设置胜利奖励",10,0,990)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢前辈剑下留情！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_华山_梁发'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 7) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602000d,G.QueryName(0x10030011),false)
	G.call("战斗系统_设置对手属性","生命",600 * int_强度)
	G.call("战斗系统_设置对手属性","内力",250)
	G.call("战斗系统_设置对手属性","身法",45)
	G.call("战斗系统_设置对手属性","攻击伤害下限",50 * int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",55 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",70 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害上限",80 * int_强度)
	G.call("战斗系统_设置对手属性","绝招耗内",50)
	G.call("战斗系统_设置胜利奖励",0,0,55 * int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师兄承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_华山_岳灵珊'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602000e,G.QueryName(0x10030025),false)
	G.call("战斗系统_设置对手属性","生命",1050)
	G.call("战斗系统_设置对手属性","内力",250)
	G.call("战斗系统_设置对手属性","身法",55)
	G.call("战斗系统_设置对手属性","攻击伤害下限",75)
	G.call("战斗系统_设置对手属性","攻击伤害上限",80)
	G.call("战斗系统_设置对手属性","绝招伤害下限",145)
	G.call("战斗系统_设置对手属性","绝招伤害上限",165)
	G.call("战斗系统_设置对手属性","绝招耗内",40)
	G.call("战斗系统_设置胜利奖励",0,0,75)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师姐承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_华山_田伯光'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x56020007,G.QueryName(0x1003001d),false)
	G.call("战斗系统_设置对手属性","生命",3000)
	G.call("战斗系统_设置对手属性","内力",2500)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",120)
	G.call("战斗系统_设置对手属性","攻击伤害上限",130)
	G.call("战斗系统_设置对手属性","绝招伤害下限",240)
	G.call("战斗系统_设置对手属性","绝招伤害上限",260)
	G.call("战斗系统_设置对手属性","绝招耗内",30)
	G.call("战斗系统_设置胜利奖励",40,50,300)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢田兄手下留情。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_华山_岳不群'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602000a,G.QueryName(0x10030022),false)
	G.call("战斗系统_设置对手属性","生命",7800)
	G.call("战斗系统_设置对手属性","内力",6000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",400)
	G.call("战斗系统_设置对手属性","攻击伤害上限",410)
	G.call("战斗系统_设置对手属性","绝招伤害下限",590)
	G.call("战斗系统_设置对手属性","绝招伤害上限",620)
	G.call("战斗系统_设置对手属性","绝招耗内",190)
	G.call("战斗系统_设置胜利奖励",0,0,800)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢恩师指点。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_嵩山_弟子'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 6) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020026,G.QueryName(0x10030011),false)
	G.call("战斗系统_设置对手属性","生命",600 * int_强度)
	G.call("战斗系统_设置对手属性","内力",450)
	G.call("战斗系统_设置对手属性","身法",45)
	G.call("战斗系统_设置对手属性","攻击伤害下限",50 * int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",55 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",70 * int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害上限",80 * int_强度)
	G.call("战斗系统_设置对手属性","绝招耗内",50)
	G.call("战斗系统_设置胜利奖励",0,0,25 * int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师兄承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_嵩山_岳灵珊'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602000e,G.QueryName(0x10030025),false)
	G.call("战斗系统_设置对手属性","生命",3050)
	G.call("战斗系统_设置对手属性","内力",250)
	G.call("战斗系统_设置对手属性","身法",65)
	G.call("战斗系统_设置对手属性","攻击伤害下限",235)
	G.call("战斗系统_设置对手属性","攻击伤害上限",240)
	G.call("战斗系统_设置对手属性","绝招伤害下限",385)
	G.call("战斗系统_设置对手属性","绝招伤害上限",405)
	G.call("战斗系统_设置对手属性","绝招耗内",40)
	G.call("战斗系统_设置胜利奖励",0,0,750)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师姐承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_嵩山_玉机子'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602002a,G.QueryName(0x1003001f),false)
	G.call("战斗系统_设置对手属性","生命",4000)
	G.call("战斗系统_设置对手属性","内力",3250)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",330)
	G.call("战斗系统_设置对手属性","攻击伤害上限",330)
	G.call("战斗系统_设置对手属性","绝招伤害下限",480)
	G.call("战斗系统_设置对手属性","绝招伤害上限",480)
	G.call("战斗系统_设置对手属性","绝招耗内",120)
	G.call("战斗系统_设置胜利奖励",0,0,400)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢前辈承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_嵩山_左冷禅'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x56020025,G.QueryName(0x10030022),false)
	G.call("战斗系统_设置对手属性","生命",9000)
	G.call("战斗系统_设置对手属性","内力",8550)
	G.call("战斗系统_设置对手属性","身法",92)
	G.call("战斗系统_设置对手属性","攻击伤害下限",435)
	G.call("战斗系统_设置对手属性","攻击伤害上限",440)
	G.call("战斗系统_设置对手属性","绝招伤害下限",635)
	G.call("战斗系统_设置对手属性","绝招伤害上限",685)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",0,0,850)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","嵩山派武功名不虚传，果然很差劲。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_黑木崖_杨莲亭'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x56020045,G.QueryName(0x1003001d),false)
	G.call("战斗系统_设置对手属性","生命",4500)
	G.call("战斗系统_设置对手属性","内力",3500)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",320)
	G.call("战斗系统_设置对手属性","攻击伤害上限",400)
	G.call("战斗系统_设置对手属性","绝招伤害下限",540)
	G.call("战斗系统_设置对手属性","绝招伤害上限",700)
	G.call("战斗系统_设置对手属性","绝招耗内",380)
	G.call("战斗系统_设置胜利奖励",0,0,950)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","杨总管的功夫果然又烂又菜。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_黑木崖_东方不败'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020047,G.QueryName(0x10030007),false)
	G.call("战斗系统_设置对手属性","生命",25000)
	G.call("战斗系统_设置对手属性","内力",19000)
	G.call("战斗系统_设置对手属性","身法",99)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1620)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1710)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",2650)
	G.call("战斗系统_设置对手属性","绝招耗内",0)
	G.call("战斗系统_设置胜利奖励",400,0,8000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","你应该叫做“西方失败”！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_黑木崖_向问天'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x56020043,G.QueryName(0x1003001f),false)
	G.call("战斗系统_设置对手属性","生命",10000)
	G.call("战斗系统_设置对手属性","内力",8000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",820)
	G.call("战斗系统_设置对手属性","攻击伤害上限",900)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1340)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1500)
	G.call("战斗系统_设置对手属性","绝招耗内",900)
	G.call("战斗系统_设置胜利奖励",0,0,3550)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","今天谁也不可能阻挡我的计划！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_黑木崖_任我行1'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020044,G.QueryName(0x10030018),false)
	G.call("战斗系统_设置对手属性","生命",10000)
	G.call("战斗系统_设置对手属性","内力",9000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1020)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1110)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1590)
	G.call("战斗系统_设置对手属性","绝招耗内",800)
	G.call("战斗系统_设置胜利奖励",0,0,2400)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢教主指点！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_黑木崖_任我行2'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020044,G.QueryName(0x10030018),false)
	G.call("战斗系统_设置对手属性","生命",13500)
	G.call("战斗系统_设置对手属性","内力",9000)
	G.call("战斗系统_设置对手属性","身法",95)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1300)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1390)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1600)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1690)
	G.call("战斗系统_设置对手属性","绝招耗内",890)
	G.call("战斗系统_设置胜利奖励",0,0,3800)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢教主指点！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_黑木崖_任我行3'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020044,G.QueryName(0x10030018),false)
	G.call("战斗系统_设置对手属性","生命",19000)
	G.call("战斗系统_设置对手属性","内力",20000)
	G.call("战斗系统_设置对手属性","身法",90)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1499)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1699)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",1000)
	G.call("战斗系统_设置胜利奖励",250,0,5000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","任我行，你要是早些让贤，哪会有今天的下场。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_教众'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020034,G.QueryName(0x10030015),false)
	G.call("战斗系统_设置对手属性","生命",5600)
	G.call("战斗系统_设置对手属性","内力",5000)
	G.call("战斗系统_设置对手属性","身法",79)
	G.call("战斗系统_设置对手属性","攻击伤害下限",500)
	G.call("战斗系统_设置对手属性","攻击伤害上限",600)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,650)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","明教的武功终究是比我差了一截。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_成昆'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020048,G.QueryName(0x1003000c),false)
	G.call("战斗系统_设置对手属性","生命",8800)
	G.call("战斗系统_设置对手属性","内力",12000)
	G.call("战斗系统_设置对手属性","身法",90)
	G.call("战斗系统_设置对手属性","攻击伤害下限",830)
	G.call("战斗系统_设置对手属性","攻击伤害上限",890)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1720)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1920)
	G.call("战斗系统_设置对手属性","绝招耗内",450)
	G.call("战斗系统_设置胜利奖励",0,0,3200)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","武功这么差，还想杀人灭口吗？")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_唐文亮'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020049,G.QueryName(0x1003001b),false)
	G.call("战斗系统_设置对手属性","生命",5000)
	G.call("战斗系统_设置对手属性","内力",4000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",220)
	G.call("战斗系统_设置对手属性","攻击伤害上限",250)
	G.call("战斗系统_设置对手属性","绝招伤害下限",480)
	G.call("战斗系统_设置对手属性","绝招伤害上限",510)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",0,0,400)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","依我看你的七伤拳并未练到家。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_岳不群'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x5602000a,G.QueryName(0x10030022),false)
	G.call("战斗系统_设置对手属性","生命",6500)
	G.call("战斗系统_设置对手属性","内力",5000)
	G.call("战斗系统_设置对手属性","身法",96)
	G.call("战斗系统_设置对手属性","攻击伤害下限",660)
	G.call("战斗系统_设置对手属性","攻击伤害上限",710)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1600)
	G.call("战斗系统_设置对手属性","绝招耗内",480)
	G.call("战斗系统_设置胜利奖励",0,0,3000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","华山剑术高明，晚辈佩服万分。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_宋远桥'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x5602002c,G.QueryName(0x1003001a),false)
	G.call("战斗系统_设置对手属性","生命",11000)
	G.call("战斗系统_设置对手属性","内力",9000)
	G.call("战斗系统_设置对手属性","身法",90)
	G.call("战斗系统_设置对手属性","攻击伤害下限",860)
	G.call("战斗系统_设置对手属性","攻击伤害上限",920)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1800)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1930)
	G.call("战斗系统_设置对手属性","绝招耗内",180)
	G.call("战斗系统_设置胜利奖励",30,0,3200)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","宋大侠武功果然卓越不凡！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_玄慈'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020005,G.QueryName(0x1003000c),false)
	G.call("战斗系统_设置对手属性","生命",13000)
	G.call("战斗系统_设置对手属性","内力",9000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",800)
	G.call("战斗系统_设置对手属性","攻击伤害上限",900)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1600)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1730)
	G.call("战斗系统_设置对手属性","绝招耗内",450)
	G.call("战斗系统_设置胜利奖励",40,0,3600)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","大师武功果然神奇，晚辈佩服。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_灭绝1'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x5602003d,G.QueryName(0x10030012),false)
	G.call("战斗系统_设置对手属性","生命",7500)
	G.call("战斗系统_设置对手属性","内力",3000)
	G.call("战斗系统_设置对手属性","身法",70)
	G.call("战斗系统_设置对手属性","攻击伤害下限",460)
	G.call("战斗系统_设置对手属性","攻击伤害上限",520)
	G.call("战斗系统_设置对手属性","绝招伤害下限",700)
	G.call("战斗系统_设置对手属性","绝招伤害上限",830)
	G.call("战斗系统_设置对手属性","绝招耗内",200)
	G.call("战斗系统_设置胜利奖励",30,0,850)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师太剑下留情！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_灭绝2'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x5602003d,G.QueryName(0x10030012),false)
	G.call("战斗系统_设置对手属性","生命",15000)
	G.call("战斗系统_设置对手属性","内力",8000)
	G.call("战斗系统_设置对手属性","身法",80)
	G.call("战斗系统_设置对手属性","攻击伤害下限",780)
	G.call("战斗系统_设置对手属性","攻击伤害上限",830)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1800)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1900)
	G.call("战斗系统_设置对手属性","绝招耗内",400)
	G.call("战斗系统_设置胜利奖励",40,0,4450)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师太剑下留情！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_明教_张无忌'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x5602004e,G.QueryName(0x10030023),false)
	G.call("战斗系统_设置对手属性","生命",18000)
	G.call("战斗系统_设置对手属性","内力",11000)
	G.call("战斗系统_设置对手属性","身法",90)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1100)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1190)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2800)
	G.call("战斗系统_设置对手属性","绝招伤害上限",2950)
	G.call("战斗系统_设置对手属性","绝招耗内",600)
	G.call("战斗系统_设置胜利奖励",0,0,4450)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","无名小卒自不量力！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_万劫谷_南海鳄神'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602001b,G.QueryName(0x10030013),false)
	G.call("战斗系统_设置对手属性","生命",6800)
	G.call("战斗系统_设置对手属性","内力",5000)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",460)
	G.call("战斗系统_设置对手属性","攻击伤害上限",490)
	G.call("战斗系统_设置对手属性","绝招伤害下限",820)
	G.call("战斗系统_设置对手属性","绝招伤害上限",850)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",50,0,600)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","看来我这个师父是当定了。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_万劫谷_段延庆'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x5602001c,G.QueryName(0x10030008),false)
	G.call("战斗系统_设置对手属性","生命",8800)
	G.call("战斗系统_设置对手属性","内力",7000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",620)
	G.call("战斗系统_设置对手属性","攻击伤害上限",650)
	G.call("战斗系统_设置对手属性","绝招伤害下限",830)
	G.call("战斗系统_设置对手属性","绝招伤害上限",860)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",150,0,1200)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","四大恶人之首也不过如此而已。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_天龙寺_鸠摩智'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020019,G.QueryName(0x1003000c),false)
	G.call("战斗系统_设置对手属性","生命",13800)
	G.call("战斗系统_设置对手属性","内力",9000)
	G.call("战斗系统_设置对手属性","身法",95)
	G.call("战斗系统_设置对手属性","攻击伤害下限",960)
	G.call("战斗系统_设置对手属性","攻击伤害上限",990)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1920)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1950)
	G.call("战斗系统_设置对手属性","绝招耗内",250)
	G.call("战斗系统_设置胜利奖励",120,0,2500)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","吐蕃国师原来也不过如此而已。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_剑冢_怪蟒'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020012,G.QueryName(0x1003000a),false)
	G.call("战斗系统_设置对手属性","生命",3200)
	G.call("战斗系统_设置对手属性","内力",1220)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",0)
	G.call("战斗系统_设置对手属性","攻击伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招伤害下限",425)
	G.call("战斗系统_设置对手属性","绝招伤害上限",445)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,300)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","看得挺大个的家伙，原来如此弱不禁风！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_剑冢_巨雕1'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020011,G.QueryName(0x1003000d),false)
	G.call("战斗系统_设置对手属性","生命",2800)
	G.call("战斗系统_设置对手属性","内力",500)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",180)
	G.call("战斗系统_设置对手属性","攻击伤害上限",215)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,650)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","雕兄让小弟赢得太容易了。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_剑冢_巨雕2'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 10) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020011,G.QueryName(0x1003000d),false)
	G.call("战斗系统_设置对手属性","生命",4280)
	G.call("战斗系统_设置对手属性","内力",5)
	G.call("战斗系统_设置对手属性","身法",95)
	G.call("战斗系统_设置对手属性","攻击伤害下限",520)
	G.call("战斗系统_设置对手属性","攻击伤害上限",620)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,300 * int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","雕兄让小弟赢得太容易了。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_百花谷_周伯通'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 10) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602001f,G.QueryName(0x10030024),false)
	G.call("战斗系统_设置对手属性","生命",13500)
	G.call("战斗系统_设置对手属性","内力",9000)
	G.call("战斗系统_设置对手属性","身法",95)
	G.call("战斗系统_设置对手属性","攻击伤害下限",620)
	G.call("战斗系统_设置对手属性","攻击伤害上限",710)
	G.call("战斗系统_设置对手属性","绝招伤害下限",900)
	G.call("战斗系统_设置对手属性","绝招伤害上限",990)
	G.call("战斗系统_设置对手属性","绝招耗内",0)
	G.call("战斗系统_设置胜利奖励",0,0,400 * int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","这场架打得真痛快！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_渡口_杨过'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020022,G.QueryName(0x10030021),false)
	G.call("战斗系统_设置对手属性","生命",12000)
	G.call("战斗系统_设置对手属性","内力",9900)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1200)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1300)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2600)
	G.call("战斗系统_设置对手属性","绝招伤害上限",3000)
	G.call("战斗系统_设置对手属性","绝招耗内",800)
	G.call("战斗系统_设置胜利奖励",0,0,2600)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢杨兄承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_侠客岛_岛主1'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602003e,G.QueryName(0x10030005),false)
	G.call("战斗系统_设置对手属性","生命",18000)
	G.call("战斗系统_设置对手属性","内力",15000)
	G.call("战斗系统_设置对手属性","身法",80)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1000)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1120)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1920)
	G.call("战斗系统_设置对手属性","绝招伤害上限",2120)
	G.call("战斗系统_设置对手属性","绝招耗内",450)
	G.call("战斗系统_设置胜利奖励",200,0,6200)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","怎么不打下去了？")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_侠客岛_岛主2'] = function(percent_功力)
	local enum_战斗结果_战斗结果 = nil
	if percent_功力 == nil then 
		percent_功力 = 1
	else 
	end
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602003e,G.QueryName(0x10030005),false)
	G.call("战斗系统_设置对手属性","生命",18000 * percent_功力)
	G.call("战斗系统_设置对手属性","内力",17500 * percent_功力)
	G.call("战斗系统_设置对手属性","身法",70)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1100 * percent_功力)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1100 * percent_功力)
	G.call("战斗系统_设置对手属性","绝招伤害下限",3200 * percent_功力)
	G.call("战斗系统_设置对手属性","绝招伤害上限",3200 * percent_功力)
	G.call("战斗系统_设置对手属性","绝招耗内",3000 * percent_功力)
	G.call("战斗系统_设置胜利奖励",0,0,5000 * percent_功力)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢岛主承让。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_铸剑谷_定逸'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020023,G.QueryName(0x10030012),false)
	G.call("战斗系统_设置对手属性","生命",8000)
	G.call("战斗系统_设置对手属性","内力",5500)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",720)
	G.call("战斗系统_设置对手属性","攻击伤害上限",820)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1340)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1520)
	G.call("战斗系统_设置对手属性","绝招耗内",430)
	G.call("战斗系统_设置胜利奖励",40,0,1100)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","恒山武功不过如此。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_铸剑谷_杀手'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020024,G.QueryName(0x1003001d),false)
	G.call("战斗系统_设置对手属性","生命",6000)
	G.call("战斗系统_设置对手属性","内力",4500)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",620)
	G.call("战斗系统_设置对手属性","攻击伤害上限",700)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1240)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1400)
	G.call("战斗系统_设置对手属性","绝招耗内",380)
	G.call("战斗系统_设置胜利奖励",0,0,850)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","回去再修炼几年吧。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_破庙_木高峰'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020013,G.QueryName(0x10030014),false)
	G.call("战斗系统_设置对手属性","生命",3500)
	G.call("战斗系统_设置对手属性","内力",50)
	G.call("战斗系统_设置对手属性","身法",35)
	G.call("战斗系统_设置对手属性","攻击伤害下限",240)
	G.call("战斗系统_设置对手属性","攻击伤害上限",270)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",30,50,300)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","你这种败类栽在大爷手上算你倒霉！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_破庙_李莫愁1'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020015,G.QueryName(0x1003000e),false)
	G.call("战斗系统_设置对手属性","生命",4800)
	G.call("战斗系统_设置对手属性","内力",2000)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",330)
	G.call("战斗系统_设置对手属性","攻击伤害上限",390)
	G.call("战斗系统_设置对手属性","绝招伤害下限",620)
	G.call("战斗系统_设置对手属性","绝招伤害上限",820)
	G.call("战斗系统_设置对手属性","绝招耗内",380)
	G.call("战斗系统_设置胜利奖励",50,0,480)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","武功这么差，再去修炼几年吧！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_破庙_李莫愁2'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020015,G.QueryName(0x1003000e),false)
	G.call("战斗系统_设置对手属性","生命",4800)
	G.call("战斗系统_设置对手属性","内力",2000)
	G.call("战斗系统_设置对手属性","身法",80)
	G.call("战斗系统_设置对手属性","攻击伤害下限",330)
	G.call("战斗系统_设置对手属性","攻击伤害上限",390)
	G.call("战斗系统_设置对手属性","绝招伤害下限",620)
	G.call("战斗系统_设置对手属性","绝招伤害上限",820)
	G.call("战斗系统_设置对手属性","绝招耗内",350)
	G.call("战斗系统_设置胜利奖励",50,0,480)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","武功这么差，再去修炼几年吧！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_破庙_毒蛇'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020012,G.QueryName(0x1003000a),false)
	G.call("战斗系统_设置对手属性","生命",500)
	G.call("战斗系统_设置对手属性","内力",20)
	G.call("战斗系统_设置对手属性","身法",65)
	G.call("战斗系统_设置对手属性","攻击伤害下限",0)
	G.call("战斗系统_设置对手属性","攻击伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招伤害下限",45)
	G.call("战斗系统_设置对手属性","绝招伤害上限",65)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,50)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","看得挺大个的家伙，原来如此弱不禁风！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_破庙_阿紫'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020029,G.QueryName(0x10030002),false)
	G.call("战斗系统_设置对手属性","生命",800)
	G.call("战斗系统_设置对手属性","内力",500)
	G.call("战斗系统_设置对手属性","身法",70)
	G.call("战斗系统_设置对手属性","攻击伤害下限",120 - o_role_主角.解毒)
	G.call("战斗系统_设置对手属性","攻击伤害上限",130 - o_role_主角.解毒)
	G.call("战斗系统_设置对手属性","绝招伤害下限",280 - o_role_主角.解毒)
	G.call("战斗系统_设置对手属性","绝招伤害上限",330 - o_role_主角.解毒)
	G.call("战斗系统_设置对手属性","绝招耗内",18)
	G.call("战斗系统_设置胜利奖励",0,0,300)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","我要是想走，谁又能拦得住我！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_聚贤庄_乔峰'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602003a,G.QueryName(0x10030017),false)
	G.call("战斗系统_设置对手属性","生命",20000)
	G.call("战斗系统_设置对手属性","内力",25000)
	G.call("战斗系统_设置对手属性","身法",91)
	G.call("战斗系统_设置对手属性","攻击伤害下限",2000)
	G.call("战斗系统_设置对手属性","攻击伤害上限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",4000)
	G.call("战斗系统_设置对手属性","绝招耗内",250)
	G.call("战斗系统_设置胜利奖励",200,0,15000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","如果你不是契丹人，真的不愿与你为敌。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_聚贤庄_杀手'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x56020024,G.QueryName(0x1003001d),false)
	G.call("战斗系统_设置对手属性","生命",2000)
	G.call("战斗系统_设置对手属性","内力",1500)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",480)
	G.call("战斗系统_设置对手属性","攻击伤害上限",560)
	G.call("战斗系统_设置对手属性","绝招伤害下限",890)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1050)
	G.call("战斗系统_设置对手属性","绝招耗内",180)
	G.call("战斗系统_设置胜利奖励",0,0,450)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","回去再修炼几年吧。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_聚贤庄_何太冲'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x5602003c,G.QueryName(0x10030009),false)
	G.call("战斗系统_设置对手属性","生命",5600)
	G.call("战斗系统_设置对手属性","内力",3000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",460)
	G.call("战斗系统_设置对手属性","攻击伤害上限",490)
	G.call("战斗系统_设置对手属性","绝招伤害下限",920)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1020)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",0,0,500)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","昆仑剑术原来也不过如此而已。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_聚贤庄_岳不群'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x5602000a,G.QueryName(0x10030022),false)
	G.call("战斗系统_设置对手属性","生命",6500)
	G.call("战斗系统_设置对手属性","内力",5000)
	G.call("战斗系统_设置对手属性","身法",96)
	G.call("战斗系统_设置对手属性","攻击伤害下限",660)
	G.call("战斗系统_设置对手属性","攻击伤害上限",710)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1600)
	G.call("战斗系统_设置对手属性","绝招耗内",480)
	G.call("战斗系统_设置胜利奖励",0,0,3000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","华山剑术高明，晚辈佩服万分。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_聚贤庄_灭绝'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061003,0x5602003d,G.QueryName(0x10030012),false)
	G.call("战斗系统_设置对手属性","生命",15000)
	G.call("战斗系统_设置对手属性","内力",8000)
	G.call("战斗系统_设置对手属性","身法",80)
	G.call("战斗系统_设置对手属性","攻击伤害下限",780)
	G.call("战斗系统_设置对手属性","攻击伤害上限",830)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1800)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1900)
	G.call("战斗系统_设置对手属性","绝招耗内",400)
	G.call("战斗系统_设置胜利奖励",40,0,4450)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","多谢师太剑下留情！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_长白山_李秋水'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061006,0x56020039,G.QueryName(0x1003000f),false)
	G.call("战斗系统_设置对手属性","生命",13000)
	G.call("战斗系统_设置对手属性","内力",8000)
	G.call("战斗系统_设置对手属性","身法",90)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1180)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1230)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2300)
	G.call("战斗系统_设置对手属性","绝招伤害上限",2380)
	G.call("战斗系统_设置对手属性","绝招耗内",500)
	G.call("战斗系统_设置胜利奖励",0,0,4450)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","原来美人的功夫也不是很高。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_长白山_童姥'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061006,0x56020038,G.QueryName(0x1003001c),false)
	G.call("战斗系统_设置对手属性","生命",18000)
	G.call("战斗系统_设置对手属性","内力",11000)
	G.call("战斗系统_设置对手属性","身法",89)
	G.call("战斗系统_设置对手属性","攻击伤害下限",860)
	G.call("战斗系统_设置对手属性","攻击伤害上限",920)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",2630)
	G.call("战斗系统_设置对手属性","绝招耗内",900)
	G.call("战斗系统_设置胜利奖励",50,0,4250)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","看来灵鹫宫的武功也是非常的一般！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_昆仑_何太冲'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602003c,G.QueryName(0x10030009),false)
	G.call("战斗系统_设置对手属性","生命",4800)
	G.call("战斗系统_设置对手属性","内力",3000)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",360)
	G.call("战斗系统_设置对手属性","攻击伤害上限",390)
	G.call("战斗系统_设置对手属性","绝招伤害下限",520)
	G.call("战斗系统_设置对手属性","绝招伤害上限",550)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",0,0,500)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","昆仑剑术原来也不过如此而已。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_昆仑_白猿'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020050,G.QueryName(0x10030003),false)
	G.call("战斗系统_设置对手属性","生命",3200)
	G.call("战斗系统_设置对手属性","内力",1500)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",185)
	G.call("战斗系统_设置对手属性","攻击伤害上限",220)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,650)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","老白猿你不要紧吧。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_青城_弟子'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020026,G.QueryName(0x10030014),false)
	G.call("战斗系统_设置对手属性","生命",2800)
	G.call("战斗系统_设置对手属性","内力",50)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",299)
	G.call("战斗系统_设置对手属性","攻击伤害上限",349)
	G.call("战斗系统_设置对手属性","绝招伤害下限",0)
	G.call("战斗系统_设置对手属性","绝招伤害上限",0)
	G.call("战斗系统_设置对手属性","绝招耗内",10)
	G.call("战斗系统_设置胜利奖励",0,0,180)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","青城派武功也不足一晒。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_青城_余沧海'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020028,G.QueryName(0x10030009),false)
	G.call("战斗系统_设置对手属性","生命",4800)
	G.call("战斗系统_设置对手属性","内力",4000)
	G.call("战斗系统_设置对手属性","身法",75)
	G.call("战斗系统_设置对手属性","攻击伤害下限",360)
	G.call("战斗系统_设置对手属性","攻击伤害上限",390)
	G.call("战斗系统_设置对手属性","绝招伤害下限",520)
	G.call("战斗系统_设置对手属性","绝招伤害上限",550)
	G.call("战斗系统_设置对手属性","绝招耗内",150)
	G.call("战斗系统_设置胜利奖励",0,0,500)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","青城派余矮子原来也不过如此而已。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_论剑_匪兵'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061004,0x5602003b,G.QueryName(0x1003001d),false)
	G.call("战斗系统_设置对手属性","生命",6000)
	G.call("战斗系统_设置对手属性","内力",4500)
	G.call("战斗系统_设置对手属性","身法",85)
	G.call("战斗系统_设置对手属性","攻击伤害下限",620)
	G.call("战斗系统_设置对手属性","攻击伤害上限",700)
	G.call("战斗系统_设置对手属性","绝招伤害下限",1240)
	G.call("战斗系统_设置对手属性","绝招伤害上限",1400)
	G.call("战斗系统_设置对手属性","绝招耗内",380)
	G.call("战斗系统_设置胜利奖励",0,0,850)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","你该不会隐藏实力了吧。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_论剑_乔峰'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x5602003a,G.QueryName(0x10030017),false)
	G.call("战斗系统_设置对手属性","生命",20000)
	G.call("战斗系统_设置对手属性","内力",25000)
	G.call("战斗系统_设置对手属性","身法",91)
	G.call("战斗系统_设置对手属性","攻击伤害下限",2000)
	G.call("战斗系统_设置对手属性","攻击伤害上限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",4000)
	G.call("战斗系统_设置对手属性","绝招耗内",250)
	G.call("战斗系统_设置胜利奖励",200,0,15000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","如果你不是契丹人，真的不愿与你为敌。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_论剑_东方不败'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061001,0x56020047,G.QueryName(0x10030007),false)
	G.call("战斗系统_设置对手属性","生命",25000)
	G.call("战斗系统_设置对手属性","内力",19000)
	G.call("战斗系统_设置对手属性","身法",99)
	G.call("战斗系统_设置对手属性","攻击伤害下限",1620)
	G.call("战斗系统_设置对手属性","攻击伤害上限",1710)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",2650)
	G.call("战斗系统_设置对手属性","绝招耗内",0)
	G.call("战斗系统_设置胜利奖励",400,0,8000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","你应该叫做“西方失败”！")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_论剑_无名僧'] = function()
	local enum_战斗结果_战斗结果 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020035,G.QueryName(0x1003001e),false)
	G.call("战斗系统_设置对手属性","生命",28000)
	G.call("战斗系统_设置对手属性","内力",35000)
	G.call("战斗系统_设置对手属性","身法",100)
	G.call("战斗系统_设置对手属性","攻击伤害下限",18000)
	G.call("战斗系统_设置对手属性","攻击伤害上限",18500)
	G.call("战斗系统_设置对手属性","绝招伤害下限",2500)
	G.call("战斗系统_设置对手属性","绝招伤害上限",4000)
	G.call("战斗系统_设置对手属性","绝招耗内",100)
	G.call("战斗系统_设置胜利奖励",0,0,28000)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","侥幸胜出，惭愧惭愧。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
--type=战斗剧本
--private=false
--ret=enum_战斗结果
t['战斗_论剑_神仙'] = function()
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_等级 = o_role_主角.等级
	local int_强度 = G.call("运算_向下取整",int_等级 / 5) + 1
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("战斗系统_初始化",0x56061005,0x56020051,G.QueryName(0x10030019),false)
	G.call("战斗系统_设置对手属性","生命",50000)
	G.call("战斗系统_设置对手属性","内力",50000)
	G.call("战斗系统_设置对手属性","身法",100)
	G.call("战斗系统_设置对手属性","攻击伤害下限",200*int_强度)
	G.call("战斗系统_设置对手属性","攻击伤害上限",300*int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害下限",400*int_强度)
	G.call("战斗系统_设置对手属性","绝招伤害上限",650*int_强度)
	G.call("战斗系统_设置对手属性","绝招耗内",150*int_强度)
	G.call("战斗系统_设置胜利奖励",0,0,2000*int_强度)
	G.call("战斗系统_开始战斗")
	G.call("战斗系统_显示")
	enum_战斗结果_战斗结果 = G.call("战斗系统_等待战斗结束")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("对话系统_显示主角对话","原来神仙前辈的武功如此博大精深，令晚辈十分佩服。")
	else 
	end
	G.call("战斗系统_隐藏")
	G.call("通用_停止所有声音")
	return enum_战斗结果_战斗结果
end
