--[[0

]]
local G = require "gf"
local t = G.api
local L = {}
--type=剧本
--private=false
--ret=o_drama
t['剧情_序'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060003)
	G.call("场景系统_添加静态人物",0x56020002,0,78,"医生",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","大夫，我母亲的病现在越来越重，您能不能过去瞧瞧？如果您不方便，先帮我抓几服药吧？")
	G.call("对话系统_显示NPC对话","大夫",0x56020002,"小子，你知道老夫出一次诊的诊金是多少吗？是20两纹银！你有吗？如果没有，就少在这里扯淡！")
	G.call("对话系统_显示主角对话","大夫，实在对不住，我现在半两纹银也凑不起。人称您是“在世华佗”，请您积积公德。日后我一定会把银子如数交上的。")
	G.call("对话系统_显示NPC对话","大夫",0x56020002,"老夫又不是开慈善堂！平日里积的阴德也够多了，也不差你一个。滚吧，滚吧，老夫还要睡觉。")
	G.call("场景系统_移除人物","医生")
	G.call("场景系统_隐藏")
	G.call("场景系统_设置背景图片",nil)
	G.call("对话系统_显示主角对话","大夫！大夫！你开开门！怎么可以见死不救呢？！你还有没有医德？！我娘要是有个三长两短，我不会放过你的。")
	G.call("场景系统_设置背景图片",0x56060004)
	G.call("场景系统_添加静态人物",0x56020003,0,78,"母亲",nil)
	G.call("场景系统_显示")
	G.call("通用_播放音效",0x49000011)
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"儿子怎样了？大夫还是不肯来吗？")
	G.call("对话系统_显示主角对话","娘，孩儿实在不孝！长这么大了也不能为家里分忧解愁。")
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"算了，娘都一把老骨头了，一点小病也不用这么大费周章。大夫可能又是因为银子不够才不肯来。")
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"世风日下人心叵测，连大夫都堕落了。或许这就是娘的命，孩儿你不必自责。")
	G.call("对话系统_显示主角对话","娘，我再想想办法。一定会把您的病治好的。您先休息去吧。")
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"唉……")
	G.call("场景系统_移除人物","母亲")
	G.call("通用_延时",1667)
	G.call("对话系统_显示主角对话","娘，你不要紧吧？")
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"没事，没事。老毛病了。")
	G.call("对话系统_显示主角对话","娘的病不能再拖了，我一定得赶紧想个办法才行。")
	G.call("场景系统_隐藏")
	G.call("场景系统_设置背景图片",0x56060005)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","这里地方这么大，到哪去找哪种草药呢？")
	G.call("场景系统_添加静态人物",0x56020004,0,78,"老虎",nil)
	G.call("通用_播放音效",0x49000008)
	G.call("通用_延时",1000)
	G.call("通用_播放音效",0x4900000c)
	G.call("对话系统_显示主角对话","啊！！！这里怎么会有老虎！")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"孽畜，休伤人命！")
	G.call("通用_播放音效",0x49000015)
	G.call("场景系统_播放序列帧动画",1,0,78)
	G.call("场景系统_移除人物","老虎")
	G.call("对话系统_显示主角对话","多谢大师救命之恩！")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"救人一命，胜造七级浮屠。施主不必谢我。施主为何独自一人跑到这荒山野林？据说这里虎狼出没，还是要留神当心啊。")
	G.call("对话系统_显示主角对话","我娘病重。听乡亲们说，这山里有种草药，包治百病。我想采了去，给娘治病。")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"好一个孝子。你既然执意如此。老衲就传你一套安身保命的法门。可以帮你免遭猛兽的伤害。你看好了。")
	while int_选择 ~= 1 do 
		G.call("场景系统_隐藏")
		G.call("战斗_序_战斗教学")
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","老僧",0x56020005,"你记住了吗？")
		int_选择 = G.call("对话系统_显示主角选项",nil,{"晚辈已经记下了。", "晚辈愚钝, 请大师再教一遍。"})
	end
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"很好很好。再给你一本[04]《吐纳心法》[02]。里面记载了一些睡觉，呼吸的法门。你如果长期坚持练习，一定会身强体健，诸病不生。")
	G.call("通知系统_显示系统提示","获得[04]《吐纳心法》",nil)
	G.call("通用_变更物品数量",G.QueryName(0x10060031),1)
	G.call("对话系统_显示主角对话","多谢大师救命，授艺之恩！请教大师法号。晚辈愿投入大师门下，早晚侍奉大师。")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"老衲不过教你一些求生保命的技巧，赠你一本修身养性的书，何来授艺之恩。你若真想报答，就答应老衲，日后一定造福百姓，不可作恶！")
	G.call("对话系统_显示主角对话","晚辈谨记大师教诲。")
	G.call("通用_播放音效",0x49000008)
	G.call("通用_延时",1000)
	G.call("对话系统_显示主角对话","大师小心！！！")
	G.call("场景系统_隐藏")
	enum_战斗结果_战斗结果 = G.call("战斗_序_老虎")
	G.call("场景系统_显示")
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("通用_变更人物属性","学点","增减",1)
		G.call("通用_变更人物属性","杀孽","增减",1)
		G.call("对话系统_显示主角对话","终于打死这个畜牲了！噫？大师呢？我还不知道大师叫什么呢。大师！大师！！大师！！！")
	else 
		G.call("对话系统_显示主角对话","啊！！！大师快救我！！！")
	end
	G.call("场景系统_隐藏")
	G.call("场景系统_设置背景图片",0x56060004)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","啊？原来是场梦。我又梦见昨天白天发生的事了。对啊！大师教我了功夫，我应该不再怕那些恶人了。我现在就去找那恶医算帐去！")
	G.call("场景系统_隐藏")
	G.call("场景系统_设置背景图片",0x56060003)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","见死不救的狗屁的庸医！给我滚出来！")
	G.call("对话系统_显示NPC对话","大夫",0x56020002,"又是那个穷小子。来人！把他给我赶走。别让他在这败坏我的名声！")
	G.call("场景系统_隐藏")
	enum_战斗结果_战斗结果 = G.call("战斗_序_庸医")
	G.call("场景系统_设置背景图片",0x56060004)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"感觉怎么样了？")
	G.call("对话系统_显示主角对话","大师！你怎么来了？我怎么躺在自己家屋里？")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"世人善恶自有因果报应。你年纪轻轻，怎么如此不惜命？虽然你急切为母治病，但是却以暴制暴，你可曾想过后果？")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"多亏老衲与你有缘。刚才见你被人打晕在地，特出手相救。事情前因后果我已知晓，你母亲的病我已用丹药治好，你可不必牵挂。")
	G.call("对话系统_显示主角对话","大师两次救我，无异于我的再造爹娘，再次恳请大师收纳为徒！")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"自古英雄出少年，老衲见你骨骼精奇，天庭饱满，他日必是可造之才。")
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"大师说得不错。娘吃了大师的灵丹妙药，身体已无大碍。你也是时候外出磨练了，男儿志在四方，你若将来一事无成，怎对得起我的养育之恩。")
	G.call("对话系统_显示主角对话","大师，我长这么大，从没离开过着村子。我也曾听说过别人闯荡江湖如何如何的风光，但是也听说过江湖是何等的凶险，我该怎么办呢？")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"现在各名门正派正在招收弟子之际，你可去试试。万万不可加入邪派，否则将万劫不复，切记切记！")
	G.call("对话系统_显示NPC对话","老僧",0x56020005,"离此不远有一衡阳城，你可先去那里多打听些消息，可能会对你有所帮助。")
	G.call("对话系统_显示主角对话","娘，我就如大师所说，明天就动身去衡阳城。")
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"好，你去吧。顺道时记得回家看看。这是一些散碎银子，说不定你会用得到。")
	G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"出门在外一定要吃饱穿暖，咱们虽然穷，但是要有志气，千万不为非作歹。")
	G.call("通用_变更人物属性","银两","设为",G.call("运算_随机数",20,39))
	G.call("对话系统_显示主角对话","知道了娘。")
	G.call("场景系统_隐藏")
	G.call("场景系统_切换剧本",{n = 0, "剧情_初出江湖"})
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_初出江湖'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060006)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","早就听说衡阳城风景秀美，人杰地灵。这里果然繁华似锦！我闯荡江湖的第一步就从这里迈出吧。")
	G.call("通用_延时",500)
	G.call("对话系统_显示主角对话","（看到前面有一个尼姑被持刀男子追赶！）")
	G.call("场景系统_添加静态人物",0x56020006,0,95,"仪琳",nil)
	G.call("对话系统_显示NPC对话","仪琳",0x56020006,"救命啊！谁能救救我啊！！")
	int_选择 = G.call("对话系统_显示主角选项","（我该怎么办呢？）",{"挺身而出，英雄救尼姑。", "保命要紧，闲事莫惹！"})
	if int_选择 == 2 then 
		G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
		return 
	else 
	end
	G.call("通用_设置全局标记",G.QueryName(0x1007000b),1)
	G.call("对话系统_显示主角对话","小师父不用担心，这里有我挡着，你赶快离开！")
	G.call("对话系统_显示NPC对话","仪琳",0x56020006,"多谢少侠！恒山派仪琳他日必报少侠大恩！")
	G.call("场景系统_播放通用动画","仪琳",G.QueryName(0x10020009),false)
	G.call("场景系统_移除人物","仪琳")
	G.call("通用_延时",500)
	G.call("场景系统_添加静态人物",0x56020007,0,95,"田伯光",G.QueryName(0x10020005))
	G.call("对话系统_显示NPC对话","田伯光",0x56020007,"不想死的滚到一边去，别影响大爷万里独行田伯光的雅兴！")
	G.call("对话系统_显示主角对话","你欺辱恒山派的小师父，就是与我们武林正道为敌，人人欲除你而后快，你竟然光天化日下还敢在这里大言不惭，我实在很佩服你的胆量！")
	G.call("对话系统_显示NPC对话","田伯光",0x56020007,"敢跟你田大爷这样说话，我也十分佩服你的胆量！你应该也算江湖上的一号人物，你到底是谁？")
	G.call("对话系统_显示主角对话","我是无门无派一个江湖小卒。论武功论名望当然不及你田爷的万一，但是今天我也让你知道江湖上也有我这一号人物存在！我就是[姓名]！！")
	G.call("对话系统_显示NPC对话","田伯光",0x56020007,"原来是无名小卒。难得今天兴致不错，就让我教教你做人的道理，让你也知道知道江湖的残酷！")
-->	G.log("初生牛犊不怕虎")
	G.call("场景系统_隐藏")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56061001)
	G.call("场景系统_添加战斗模型",- 24,8,"田伯光",2802,true)
	G.call("场景系统_添加战斗模型",24,- 8,"主角",1,true)
	G.call("场景系统_显示")
	G.call("通用_延时",1500)
	G.call("对话系统_显示NPC对话","田伯光",0x56020007,"田某生平最佩服有胆气的人，你既非五岳剑派的人，可没必要惹这身麻烦，我大可放你一条生路，你不妨考虑考虑。")
	int_选择 = G.call("对话系统_显示主角选项","我考虑的结果是",{"大淫贼！废话少说！拿命来！！！", "耽搁了田大侠的美事，小弟多有得罪，告辞了！"})
	if int_选择 == 1 then 
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"既然你如此不识抬举，就别怨田某手辣心狠了。今天也让你开开眼界，瞧好了，看我的成名绝技—“狂风刀法”！")
		G.call("通用_延时",500)
		G.call("通用_播放音效",0x49000007)
		G.call("场景系统_播放序列帧动画",2,24,- 8)
		G.call("场景系统_播放战斗动作","田伯光",2800,true)
		G.call("场景系统_播放战斗动作","主角",2,false)
		G.call("对话系统_显示主角对话","刚出江湖就让人给整趴下了，亲娘诶，影响仕途啊！")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"这就是你强做出头鸟的下场，今天大爷心情好留你一条小命，给你少少的放了点血，就算作给你的纪念吧。我还要去追小尼姑，你自己在这反省吧。")
		G.call("通用_设置全局标记",G.QueryName(0x1007000b),2)
		G.call("通用_播放音效",0x49000023)
		G.call("场景系统_播放通用动画","田伯光",G.QueryName(0x10020009),false)
		G.call("场景系统_移除人物","田伯光")
		G.call("对话系统_显示主角对话","呃~浑身酸痛~~~欺负一个不会武功的人，下手还这么狠！田伯光！他日我学有所成定会一雪今日之耻！！！")
		G.call("通用_变更人物属性","生命","设为",1)
		G.call("通用_变更人物属性","声望","增减",5)
		G.call("通用_变更人物属性","侠义","增减",1)
		G.call("通用_设置全局标记",G.QueryName(0x10070004),1)
	else 
		G.call("场景系统_播放战斗动作","田伯光",2800,true)
		G.call("通用_播放音效",0x49000023)
		G.call("场景系统_播放通用动画","主角",G.QueryName(0x10020009),false)
		G.call("场景系统_移除人物","主角")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"还以为真是一个胆气冲天的热血青年，原来也是熊包一个！")
		G.call("通用_变更人物属性","声望","增减",2)
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_主地图'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	-- G.call("场景系统_设置背景图片",0x56060002)
	G.call("场景系统_显示主地图地点",true)
	G.call("场景系统_显示")
	if G.call("通用_获取全局标记",G.QueryName(0x10070006)) == 1 then 
		G.call("通用_播放音效",0x49000020)
		G.call("通用_延时",1000)
		G.call("通用_播放音效",0x49000020)
		G.call("通用_延时",1000)
		G.call("对话系统_显示主角对话","这是什么声音，如此古怪？")
		G.call("对话系统_显示NPC对话","莽牯朱蛤",0x56020018,"咕…咕…咕…")
		G.call("通用_设置全局标记",G.QueryName(0x10070006),2)
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_主地图_莽牯朱蛤")
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("通用_变更物品数量",G.QueryName(0x1006001a),1)
		G.call("通用_变更人物属性","杀孽","增减",1)
	else 
	end
	if G.call("通用_检查人物属性","声望",150,nil) then 
		if G.call("通用_检查物品",G.QueryName(0x10060021)) then 
		else 
			if G.call("通用_获取全局标记",G.QueryName(0x10070003)) == 0 then 
				G.call("对话系统_显示NPC对话","衡山弟子",0x56020026,"家师在衡阳城举办“金盆洗手”大会，邀请各路武林英豪前来参加。这是参加的凭证[04]《金盆洗手帖》[02]，请少侠赏脸光临。")
				G.call("通用_变更物品数量",G.QueryName(0x10060021),1)
			else 
			end
		end
	else 
	end
	if G.call("通用_检查人物属性","等级",15,nil) then 
		if G.call("通用_检查人物属性","侠义",0,49) then 
			if G.call("通用_获取全局标记",G.QueryName(0x10070019)) == 0 then 
				G.call("对话系统_显示NPC对话","阿紫",0x56020029,"喂！你能不能帮我一下？")
				G.call("对话系统_显示主角对话","姑娘什么事？")
				G.call("对话系统_显示NPC对话","阿紫",0x56020029,"我现在练功到了紧要关头，需要一个陪练的帮我渡过难关，你可愿意？")
				int_选择 = G.call("对话系统_显示主角选项","",{"求之不得！", "恕不奉陪！"})
				G.call("通用_设置全局标记",G.QueryName(0x10070019),1)
				if int_选择 == 1 then 
					G.call("对话系统_显示NPC对话","阿紫",0x56020029,"好极了！你既然答应了我，就要一切听我吩咐。一定会有你好处的。")
					G.call("场景系统_隐藏")
					G.call("通用_停止所有声音")
					G.call("场景系统_清空")
					G.call("场景系统_设置背景图片",0x5606000d)
					G.call("场景系统_添加交互人物",0x56020029,0,120,"阿紫")
					G.call("场景系统_显示")
					G.call("对话系统_显示主角对话","这里阴暗湿冷，想必蛇虫鼠蚁之类一定不少。姑娘莫非打算在这里练功？")
					G.call("对话系统_显示NPC对话","阿紫",0x56020029,"嘻嘻，不妨实话告诉你，我正是要靠这些毒物来帮我练功。你每日的任务便是捉些毒虫回来，供我练功。我高兴的话，便传你一些毒术作为奖励。")
					G.call("对话系统_显示主角对话","知道了。")
					G.call("场景系统_切换剧本",{n = 0, "剧情_破庙_炼毒"})
					return 
				else 
					G.call("对话系统_显示NPC对话","阿紫",0x56020029,"真可惜，只好找别人了。")
				end
			else 
			end
		else 
		end
	else 
	end
	if G.call("通用_检查人物属性","声望",600,nil) then 
		if G.call("通用_获取全局标记",G.QueryName(0x10070012)) == 0 then 
			G.call("对话系统_显示NPC对话","张三",0x56020020,"少侠请留步！我是侠客岛赏善罚恶使。奉岛主之命，来邀请少侠光临侠客岛赴腊八粥宴。")
			G.call("对话系统_显示主角对话","听说侠客岛每十年举办一次腊八粥宴，广邀武林同道。但是去的人都是有来无回。谁知道你们到底有什么用意，为什么现在又来邀请我？")
			G.call("对话系统_显示NPC对话","张三",0x56020020,"岛主说近来中原大地上突然出现一名少年才俊，内外兼修，功力日益精进，想来也够资格来喝一碗腊八粥了。特命我来邀请少侠。")
			G.call("通用_变更物品数量",G.QueryName(0x10060023),1)
			G.call("通用_设置全局标记",G.QueryName(0x10070012),1)
			G.call("通知系统_显示系统提示","获得 [04]赏善罚恶令",nil)
			G.call("对话系统_显示NPC对话","张三",0x56020020,"请少侠来渡口找我，届时会接引少侠去侠客岛。")
		else 
		end
	else 
	end
	if G.call("通用_检查人物属性","声望",500,nil) then 
		if G.call("通用_检查物品",G.QueryName(0x1006002c)) then 
		else 
			if G.call("通用_获取全局标记",G.QueryName(0x1007001a)) == 0 then 
				G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"聚贤庄正在搞秘密集会，听说是商量如何对付契丹人乔峰的事情。免费给你一张[04]《聚贤庄请帖》[02]，一般人我不告诉他。")
				G.call("通用_变更物品数量",G.QueryName(0x1006002c),1)
			else 
			end
		end
	else 
	end
	if G.call("通用_检查人物属性","声望",901,nil) then 
		if G.call("通用_检查物品",G.QueryName(0x1006002e)) then 
		else 
			G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"四年一度的“华山论剑”正式召开了。对自己有信心的话不妨去参加一下，得个“天下第一”什么的，也好光宗耀祖。再次免费给你张[04]《华山论剑请帖》[02]，一般人我不告诉他。")
			G.call("通用_变更物品数量",G.QueryName(0x1006002e),1)
		end
	else 
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "衡阳城" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
			return 
		elseif string_标识名称 == "襄阳城" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳"})
			return 
		elseif string_标识名称 == "少林寺" then
			if G.call("通用_获取全局标记",G.QueryName(0x10070018)) > 0 then
				G.call("对话系统_显示主角对话","我是少林弃徒，实在无颜再进少林寺。")
			elseif o_role_主角.门派 == "少林派" then 
				if G.call("通用_检查人物属性","杀孽",20,nil) then 
					G.call("场景系统_切换剧本",{n = 0, "剧情_少林寺_思过"})
				else 
					G.call("场景系统_切换剧本",{n = 0, "剧情_少林寺_日常"})
				end
				return 
			else 
				G.call("场景系统_切换剧本",{n = 0, "剧情_少林寺"})
				return 
			end
		elseif string_标识名称 == "武当派" then 
			if o_role_主角.门派 == "武当派" then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_武当派"})
				return 
			else 
				G.call("对话系统_显示NPC对话","武当弟子",0x56020026,"请问少侠来到武当派有何贵干？")
				int_选择 = G.call("对话系统_显示主角选项","",{"慕名而来，想要投入武当门下。", "人言武当山风景秀美，特来游览一番。", "离开。"})
				if int_选择 == 1 then 
					if o_role_主角.门派 == "无门派" then 
						G.call("对话系统_显示NPC对话","武当弟子",0x56020026,"本派祖师张真人，对门下弟子要求极严。只有品德良好，根骨上佳者才有缘投入武当门下。你能否入得武当，须有祖师爷来决断。望少侠好自为之。")
						G.call("场景系统_切换剧本",{n = 0, "剧情_武当派"})
						return 
					else 
						G.call("对话系统_显示NPC对话","武当弟子",0x56020026,"少侠已投入其他门派，实在不适宜再入武当派。请少侠见谅。")
					end
				elseif int_选择 == 2 then 
					G.call("对话系统_显示NPC对话","武当弟子",0x56020026,"武当山乃武当派修身养性之所。外来宾客请勿上山打扰我派清修。")
				elseif int_选择 == 3 then 
				else 
				end
			end
		elseif string_标识名称 == "华山派" then 
			if o_role_主角.门派 == "华山派" then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_华山派"})
				return 
			elseif G.call("通用_检查物品",G.QueryName(0x10060024)) and G.call("通用_获取全局标记",G.QueryName(0x10070013)) == 5 then 
				G.call("对话系统_显示NPC对话","封不平",0x5602001d,"小子，你身上怎么会有左盟主的五岳令？")
				G.call("对话系统_显示主角对话","左盟主命我办些事情，这是他给的信物。前辈在华山附近出现，莫非是华山剑宗传人？")
				G.call("对话系统_显示NPC对话","封不平",0x5602001d,"这么容易就让你猜到了我的身份，你是蒙的吧。不错，我正是华山剑宗封不平。现在华山掌门岳不群是我师兄。但是我身为剑宗，绝不承认他是本派掌门。")
				G.call("对话系统_显示主角对话","我奉左盟主之命来寻找剑宗传人，看来功夫不负苦心人。请前辈到嵩山一聚。左盟主有事商议。")
				G.call("对话系统_显示NPC对话","封不平",0x5602001d,"左盟主派你这个毛头小子来传我过去，似乎也太不把我剑宗传人放在眼里了。你如果能胜过我手中剑我便跟你去，否则让左盟主另派他人来请我！")
				G.call("对话系统_显示主角对话","剑宗传人的本事倒有多厉害，今天晚辈倒要领教！")
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_主地图_封不平")
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","封不平",0x5602001d,"小子果然厉害。想不到左盟主网罗到了你这样的少年高手。看来左盟主的志向真不小阿。也罢，我便去嵩山拜见左盟主。")
				G.call("通用_设置全局标记",G.QueryName(0x10070013),6)
			else 
				G.call("对话系统_显示NPC对话","梁发",0x5602000d,"请问少侠来到华山有何贵干？")
				int_选择 = G.call("对话系统_显示主角选项","",{"慕名而来，想要投入华山门下。", "人言华山风景秀美，特来游览一番。", "离开。"})
				if int_选择 == 1 then 
					if o_role_主角.门派 == "无门派" then 
						G.call("对话系统_显示NPC对话","梁发",0x5602000d,"尊师人称“君子剑”，对门下弟子要求极严。尤其是弟子的品行，品行不端者，轻者逐出华山派，重者废除武功。望少侠好自为之。")
						G.call("场景系统_切换剧本",{n = 0, "剧情_华山派"})
						return 
					else 
						G.call("对话系统_显示NPC对话","梁发",0x5602000d,"少侠已投入其他门派，实在不适宜再入华山派。请少侠见谅。")
					end
				elseif int_选择 == 2 then 
					G.call("对话系统_显示NPC对话","梁发",0x5602000d,"华山属华山派管辖范围，身份不明者禁止入内！")
				elseif int_选择 == 3 then 
				else 
				end
			end
		elseif string_标识名称 == "黑木崖" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_黑木崖"})
			return 
		elseif string_标识名称 == "明教总坛" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070015))
			if int_标记 == 1 then 
				if G.call("通用_检查物品",G.QueryName(0x10060004)) then 
					G.call("场景系统_切换剧本",{n = 0, "剧情_明教"})
					return 
				else 
					G.call("对话系统_显示主角对话","光明一役后，明教已成废墟一片。没有必要再去了。")
				end
			else 
				if G.call("通用_检查人物属性","等级",30,100) then 
					G.call("场景系统_切换剧本",{n = 0, "剧情_明教_山道"})
					return 
				else 
					G.call("对话系统_显示NPC对话","明教弟子",0x56020027,"这里是明教地界。无名小辈休得在此喧哗，否则格杀勿论！")
				end
			end
		elseif string_标识名称 == "福威镖局" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_福威镖局"})
			return 
		elseif string_标识名称 == "无量山洞" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_无量山洞"})
			return 
		elseif string_标识名称 == "万劫谷" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070008))
			if int_标记 == 0 and G.call("通用_检查人物属性","等级",20,100) then 
				G.call("对话系统_显示NPC对话","华赫艮",0x5602001d,"在下大理司徒华赫艮。现在大理世子被四大恶人关在这万劫谷里。我们既要引开谷口敌人的注意溜进谷中，又要集中实力对付四大恶人，可是人手不足。少侠能否施以援手？")
				int_选择 = G.call("对话系统_显示主角选项","",{"我来引开谷口敌人的注意", "我去帮你们对付四大恶人", "这种凶险的事不要扯上我！"})
				G.call("通用_设置全局标记",G.QueryName(0x10070008),1)
				if int_选择 == 1 then 
					G.call("通用_变更人物属性","侠义","增减",5)
					G.call("场景系统_切换剧本",{n = 0, "剧情_万劫谷_谷口"})
					return 
				elseif int_选择 == 2 then 
					G.call("通用_变更人物属性","侠义","增减",10)
					G.call("场景系统_切换剧本",{n = 0, "剧情_万劫谷_牢房"})
					return 
				else 
					G.call("通用_变更人物属性","侠义","增减",- 10)
				end
			else 
				G.call("对话系统_显示NPC对话","钟万仇",0x56020027,"你这小白脸一看就不是好人！一定是惦记上我美貌如花的夫人和青春靓丽的女儿了。再不滚开，老子叫你做太监！")
			end
		elseif string_标识名称 == "天龙寺" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070009))
			if int_标记 == 0 and G.call("通用_检查人物属性","等级",26,100) then 
				G.call("对话系统_显示NPC对话","僧人",0x5602001e,"吐蕃国师在天龙寺内行凶伤人，请少侠援手一助。")
				int_选择 = G.call("对话系统_显示主角选项","",{"好，我去帮你教训一下他！", "这种凶险的事不要扯上我！"})
				G.call("通用_设置全局标记",G.QueryName(0x10070009),1)
				if int_选择 == 1 then 
					G.call("通用_变更人物属性","侠义","增减",5)
					G.call("场景系统_切换剧本",{n = 0, "剧情_天龙寺"})
					return 
				else 
					G.call("通用_变更人物属性","侠义","增减",- 5)
				end
			else 
				G.call("对话系统_显示NPC对话","僧人",0x5602001e,"近几日天龙寺为大理国做法事，谢绝各位施主来寺上香。请施主见谅。")
			end
		elseif string_标识名称 == "剑冢" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070007))
			if int_标记 == 0 and G.call("通用_检查人物属性","等级",20,100) then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_剑冢_救雕"})
				return 
			else 
				G.call("场景系统_切换剧本",{n = 0, "剧情_剑冢"})
				return 
			end
		elseif string_标识名称 == "百花谷" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_百花谷"})
			return 
		elseif string_标识名称 == "主角家" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_家"})
			return 
		elseif string_标识名称 == "渡口" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_渡口"})
			return 
		elseif string_标识名称 == "铸剑谷" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_铸剑谷"})
			return 
		elseif string_标识名称 == "破庙" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_破庙"})
			return 
		elseif string_标识名称 == "昆仑派" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070005))
			if int_标记 == 0 and G.call("通用_检查人物属性","医疗",80,100) then 
				G.call("对话系统_显示NPC对话","昆仑弟子",0x56020026,"敝派掌门新纳夫人久病不治，掌门正为此事烦恼，无暇理会尔等，还是不要自讨没趣了。")
				G.call("对话系统_显示主角对话","在下自幼跟随名医，也曾学得一手好医术。艺成后还没遇过棘手的疑难杂症，夫人这病或许我可以根治！")
				G.call("对话系统_显示NPC对话","昆仑弟子",0x56020026,"既然你这么自信，我就带你去见掌门。如果治得好，自然少不了你的赏赐;如果治不好，嘿嘿……")
				G.call("场景系统_切换剧本",{n = 0, "剧情_昆仑派"})
				return 
			else 
				G.call("对话系统_显示NPC对话","昆仑弟子",0x56020026,"奉昆仑派掌门号令：严禁闲杂人等进入昆仑山！")
			end
		elseif string_标识名称 == "青城派" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000c))
			if int_标记 <= 3 then 
				G.call("对话系统_显示NPC对话","青城弟子",0x56020026,"这里属青城派范围，游客止步！")
			else 
			end
			if int_标记 == 3 then 
				G.call("对话系统_显示主角对话","什么破规矩！我是来给福威镖局报仇来的，挡我者死！")
			else 
			end
			if 3 <= int_标记 then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_青城派"})
				return 
			else 
			end
		elseif string_标识名称 == "嵩山派" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070010))
			if 0 < int_标记 then 
				G.call("对话系统_显示NPC对话","嵩山弟子",0x56020034,"恩师左冷禅抱恙在床，不方便接见掌门，请掌门见谅。")
			elseif o_role_主角.门派 == "华山派" then 
				G.call("对话系统_显示NPC对话","嵩山弟子",0x56020034,"身为五岳门下弟子，没有左盟主召见，岂可随意造访！")
			else 
				int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070013))
				if int_标记 == 0 then 
					G.call("对话系统_显示NPC对话","嵩山弟子",0x56020034,"左盟主最欣赏你这样的青年才俊，如果你有机缘的话跟他老人家学得一招半式你就受用无穷了。")
				else 
				end
				G.call("场景系统_切换剧本",{n = 0, "剧情_嵩山派"})
				return 
			end
		elseif string_标识名称 == "聚贤庄" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_聚贤庄"})
			return 
		elseif string_标识名称 == "长白山" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_长白山"})
			return 
		elseif string_标识名称 == "华山之巅" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_华山论剑"})
			return 
		elseif string_标识名称 == "战斗1" then 
			int_选择 = G.call("运算_随机数",1,9)
			if int_选择 < 5 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_主地图_老虎")
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("通用_变更人物属性","杀孽","增减",1)
				G.call("场景系统_显示")
			elseif int_选择 < 8 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_主地图_毛贼")
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("通用_变更人物属性","杀孽","增减",1)
				G.call("场景系统_显示")
			elseif int_选择 < 9 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_主地图_恶贼")
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("通用_变更人物属性","杀孽","增减",1)
				G.call("场景系统_显示")
			else 
				G.call("场景系统_切换剧本",{n = 0, "剧情_神仙劫道"})
				return 
			end
		elseif string_标识名称 == "战斗2" then 
			int_选择 = G.call("运算_随机数",1,9)
			if int_选择 < 9 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_主地图_恶霸")
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("通用_变更人物属性","杀孽","增减",1)
				G.call("场景系统_显示")
			else 
				G.call("场景系统_切换剧本",{n = 0, "剧情_神仙劫道"})
				return 
			end
		else 
			G.call("对话系统_显示主角对话","[03]" .. string_标识名称 .. "[02], 暂时还没有相关剧情完成")
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_衡阳'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local o_item_物品 = nil
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060006)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加跳转按钮","刘府",0x56010061)
	G.call("场景系统_添加跳转按钮","武馆",0x56010063)
	G.call("场景系统_添加跳转按钮","医馆",0x56010065)
	G.call("场景系统_添加跳转按钮","客栈",0x56010064)
	G.call("场景系统_添加跳转按钮","离开",nil)
	G.call("场景系统_添加交互人物",0x56020008,245,120,"小宝货郎")
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "小宝货郎" then 
			G.call("对话系统_显示NPC对话","小宝货郎",0x56020008,"小宝货郎，童叟无欺，价钱公道。如有假货，概不退换！天上地下，只此一家，别无分号。")
			int_选择 = G.call("运算_随机数",1,10)
			if int_选择 <= 1 then 
				int_选择 = G.call("通用_显示商店",{"关外白酒|一种极辛辣的烈酒|25", "犀角杯|犀牛角制成的酒杯|53", "葡萄酒|用葡萄酿制的酒|85", "夜光杯|能够发光的名贵酒杯|255"})
				if int_选择 == 1 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]关外白酒[02]吗？") then 
						if G.call("通用_检查人物属性","银两",25,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x10060027)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 25)
								G.call("通用_变更物品数量",G.QueryName(0x10060027),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 2 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]犀角杯[02]吗？") then 
						if G.call("通用_检查人物属性","银两",53,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x10060028)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 53)
								G.call("通用_变更物品数量",G.QueryName(0x10060028),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 3 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]葡萄酒[02]吗？") then 
						if G.call("通用_检查人物属性","银两",85,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x10060029)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 85)
								G.call("通用_变更物品数量",G.QueryName(0x10060029),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 4 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]夜光杯[02]吗？") then 
						if G.call("通用_检查人物属性","银两",255,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x1006002a)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 255)
								G.call("通用_变更物品数量",G.QueryName(0x1006002a),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				else 
				end
			elseif int_选择 <= 4 then 
				int_选择 = G.call("通用_显示商店",{"铁剑|极普通的一柄剑|28", "布衣|普通百姓所穿的服饰|25", "铁甲|有良好防御性的甲衣|85", "飞镖|极普通的暗器|15"})
				if int_选择 == 1 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]铁剑[02]吗？") then 
						if G.call("通用_检查人物属性","银两",28,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x10060001)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 28)
								G.call("通用_变更物品数量",G.QueryName(0x10060001),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 2 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]布衣[02]吗？") then 
						if G.call("通用_检查人物属性","银两",25,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x10060009)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 25)
								G.call("通用_变更物品数量",G.QueryName(0x10060009),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 3 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]铁甲[02]吗？") then 
						if G.call("通用_检查人物属性","银两",85,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x1006000a)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 85)
								G.call("通用_变更物品数量",G.QueryName(0x1006000a),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 4 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]飞镖[02]吗？") then 
						if G.call("通用_检查人物属性","银两",15,nil) then 
							G.call("通用_变更人物属性","银两","增减",- 25)
							G.call("通用_变更物品数量",G.QueryName(0x10060006),1)
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				else 
				end
			elseif int_选择 <= 8 then 
				int_选择 = G.call("通用_显示商店",{"玉真散|疗伤灵药|200", "九转熊蛇丸|恒山妙药|400", "九花玉露丸|桃花岛秘传神药|800"})
				if int_选择 == 1 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]玉真散[02]吗？") then 
						if G.call("通用_检查人物属性","银两",200,nil) then 
							G.call("通用_变更人物属性","银两","增减",- 200)
							G.call("通用_变更物品数量",G.QueryName(0x10060013),1)
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 2 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]九转熊蛇丸[02]吗？") then 
						if G.call("通用_检查人物属性","银两",400,nil) then 
							G.call("通用_变更人物属性","银两","增减",- 400)
							G.call("通用_变更物品数量",G.QueryName(0x10060015),1)
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 3 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]九花玉露丸[02]吗？") then 
						if G.call("通用_检查人物属性","银两",800,nil) then 
							G.call("通用_变更人物属性","银两","增减",- 800)
							G.call("通用_变更物品数量",G.QueryName(0x10060016),1)
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				else 
				end
			else 
				int_选择 = G.call("通用_显示商店",{"药王神篇|医疗秘籍|200", "含沙射影|暗器秘籍|300", "金蛇套餐|金蛇郎君的遗产|1000"})
				if int_选择 == 1 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]药王神篇[02]吗？") then 
						if G.call("通用_检查人物属性","银两",200,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x10060037)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 200)
								G.call("通用_变更物品数量",G.QueryName(0x10060037),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 2 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]含沙射影[02]吗？") then 
						if G.call("通用_检查人物属性","银两",300,nil) then 
							if G.call("通用_检查物品",G.QueryName(0x10060035)) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 300)
								G.call("通用_变更物品数量",G.QueryName(0x10060035),1)
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				elseif int_选择 == 3 then 
					if G.call("通知系统_显示系统提示并等待选择","你决定购买[04]金蛇套餐[02]吗？") then 
						if G.call("通用_检查人物属性","银两",1000,nil) then 
							if G.call("通用_检查武功",G.QueryName(0x10040016),1) then 
								G.call("通知系统_显示系统提示并等待确定","此物品不能重复购买。")
							else 
								G.call("通用_变更人物属性","银两","增减",- 1000)
								G.call("通用_变更物品数量",G.QueryName(0x10060002),1)
								G.call("通用_学会武功",G.QueryName(0x10040016))
							end
						else 
							G.call("通知系统_显示系统提示并等待确定","银子不够，买点便宜货吧。")
						end
					else 
					end
				else 
				end
			end
		elseif string_标识名称 == "刘府" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳刘府"})
			return 
		elseif string_标识名称 == "武馆" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳武馆"})
			return 
		elseif string_标识名称 == "医馆" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳医馆"})
			return 
		elseif string_标识名称 == "客栈" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳客栈"})
			return 
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_衡阳刘府'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070003))
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060021)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_显示指令按钮",{"离开"})
	if int_标记 == 0 then
		G.call("场景系统_添加交互人物",0x56020026,0,120,"衡山弟子")
		G.call("场景系统_显示")
	else
		G.call("场景系统_显示")
		if G.call("场景系统_检查能否触发事件") then
			G.call("对话系统_显示主角对话","据说自刘正风一死，衡山刘系一派自此没落，昔日门庭若市的刘府也荒废多时。没有必要待在此处，还是离开吧")
		else
		end
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "衡山弟子" then 
			G.call("对话系统_显示NPC对话","衡山弟子",0x56020026,"家师正在举办“金盆洗手”大会，请来宾出示金盆洗手帖方可入内。")
			if G.call("通用_检查物品",G.QueryName(0x10060021)) then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_金盆洗手"})
				return 
			elseif G.call("通用_检查物品",G.QueryName(0x10060024)) then 
				G.call("对话系统_显示主角对话","我是五岳盟主委派的特使，有五岳令旗为证！")
				G.call("对话系统_显示NPC对话","衡山弟子",0x56020026,"原来是师兄驾到，有失远迎还请赎罪。师兄请进~")
				G.call("场景系统_切换剧本",{n = 0, "剧情_金盆洗手"})
				return 
			else
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_金盆洗手'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060007)
	G.call("场景系统_添加静态人物",0x56020058,0,95,"刘正风",nil)
	G.call("场景系统_添加静态人物",0x56020023,- 208,180,"定逸师太",nil)
	G.call("场景系统_添加静态人物",0x5602000a,- 240,65,"岳不群",nil)
	G.call("场景系统_添加静态人物",0x56020013,- 208,- 50,"木高峰",nil)
	G.call("场景系统_添加静态人物",0x56020055,- 110,- 100,"祖千秋",nil)
	G.call("场景系统_添加静态人物",0x56020056,208,180,"天门道长",nil)
	G.call("场景系统_添加静态人物",0x56020028,240,65,"余沧海",nil)
	G.call("场景系统_添加静态人物",0x56020057,208,- 50,"彭长老",nil)
	G.call("场景系统_添加静态人物",0x5602003b,110,- 100,"武林豪客",nil)
	G.call("场景系统_显示")
	if G.call("通用_检查物品",G.QueryName(0x10060024)) then 
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"衡山刘正风蒙恩师收录门下，授以武艺，未能张大衡山派门楣，十分惭愧。好在本门有莫师哥主持，刘正风庸庸碌碌，多刘某一人不多，少刘某一人不少。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"从今而后，刘某人金盆洗手，专心仕宦，却也决计不用师传武艺，以求升官进爵，至于江湖上的恩怨是非，门派争执，刘正风更加决不过问。")
		G.call("对话系统_显示主角对话","且住！刘师叔，奉五岳剑派左盟主旗令：刘正风金盆洗手大事，请暂行押后。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"但不知盟主此令，是何用意？")
		G.call("对话系统_显示主角对话","弟子奉命行事，实不知盟主的意旨，请刘师叔恕罪。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"在下今日金盆洗手，是刘某的私事，既没违背武林的道义规矩，更与五岳剑派并不相干，那便不受盟主旗令约束。请贤侄转告尊师，刘某不奉旗令，请左师兄恕罪。")
		G.call("对话系统_显示主角对话","刘师叔若要再执迷不悟，休怪侄儿无礼了。奉盟主号令，看住刘家的眷属，不许走脱了一人！")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"左盟主这是何用意？哼！天下英雄在此，你胆敢动我家眷一根寒毛，你数十名嵩山弟子尽皆身为肉泥！我刘某决心已定，无人能够阻止！")
		G.call("对话系统_显示主角对话","左盟主有令！刘正风勾结魔教人士曲洋，意图对我正派武林不利，此事若是查明，凡五岳剑派上下，务必尽诛刘正风全家，维护武林正道！")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"曲大哥和我一见如故，倾盖相交。他和我十余次联床夜话，偶然涉及门户宗派的异见，他总是深自叹息，认为双方如此争斗，殊属无谓。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"我和曲大哥相交，只是研讨音律。他是七弦琴的高手，而我喜欢吹箫，二人相见，大多时候总是琴箫相和，武功一道，从来不谈……")
		G.call("对话系统_显示主角对话","好，好极了！刘正风以自认与魔教勾结，凡我武林正道，需将刘正风一门就地正法！")
	else 
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"衡山刘正风蒙恩师收录门下，授以武艺，未能张大衡山派门楣，十分惭愧。好在本门有莫师哥主持，刘正风庸庸碌碌，多刘某一人不多，少刘某一人不少。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"从今而后，刘某人金盆洗手，专心仕宦，却也决计不用师传武艺，以求升官进爵，至于江湖上的恩怨是非，门派争执，刘正风更加决不过问。")
		G.call("对话系统_显示NPC对话","费斌",0x56020062,"且住！刘师兄，奉五岳剑派左盟主旗令：刘师兄金盆洗手大事，请暂行押后。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"但不知盟主此令，是何用意？")
		G.call("对话系统_显示NPC对话","费斌",0x56020062,"我只是奉命行事，实不知盟主的意旨，请刘师兄恕罪。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"在下今日金盆洗手，是刘某的私事，既没违背武林的道义规矩，更与五岳剑派并不相干，那便不受盟主旗令约束。请你转告左盟主，刘某不奉旗令，请左师兄恕罪。")
		G.call("对话系统_显示NPC对话","费斌",0x56020062,"刘师兄若要再执迷不悟，休怪在下无礼了。奉盟主号令，看住刘家的眷属，不许走脱了一人！")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"左盟主这是何用意？哼！天下英雄在此，你胆敢动我家眷一根寒毛，你数十名嵩山弟子尽皆身为肉泥！我刘某决心已定，无人能够阻止！")
		G.call("对话系统_显示NPC对话","费斌",0x56020062,"左盟主有令！刘正风勾结魔教人士曲洋，意图对我正派武林不利，此事若是查明，凡五岳剑派上下，务必尽诛刘正风全家，维护武林正道！")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"曲大哥和我一见如故，倾盖相交。他和我十余次联床夜话，偶然涉及门户宗派的异见，他总是深自叹息，认为双方如此争斗，殊属无谓。")
		G.call("对话系统_显示NPC对话","刘正风",0x56020058,"我和曲大哥相交，只是研讨音律。他是七弦琴的高手，而我喜欢吹箫，二人相见，大多时候总是琴箫相和，武功一道，从来不谈……")
		G.call("对话系统_显示NPC对话","费斌",0x56020062,"好，好极了！刘正风以自认与魔教勾结，凡我武林正道，需将刘正风一门就地正法！")
	end
	G.call("对话系统_显示NPC对话","刘正风",0x56020058,"看来左盟主是早有安排了。既然给刘某按上了十恶不赦的罪名，刘某就只好自求了断，你们也不须多伤人命了。")
	G.call("对话系统_显示NPC对话","曲洋",0x56020059,"君子报仇，十年未晚，去！")
	G.call("场景系统_添加静态人物",0x56020059,72,72,"曲洋",G.QueryName(0x10020005))
	G.call("通用_延时",800)
	G.call("通用_播放音效",0x49000013)
	G.call("场景系统_播放通用动画","曲洋",G.QueryName(0x10020009),true)
	G.call("场景系统_播放通用动画","刘正风",G.QueryName(0x10020009),false)
	if G.call("通用_检查物品",G.QueryName(0x10060024)) then 
		G.call("对话系统_显示主角对话","是黑血神针！！！赶紧追出去看看！")
	else 
	end
	G.call("通用_设置全局标记",G.QueryName(0x10070003),1)
	G.call("场景系统_隐藏")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060006)
	G.call("场景系统_显示")
	if G.call("通用_检查物品",G.QueryName(0x10060024)) then 
		G.call("对话系统_显示主角对话","看来刘正风是被魔教的人救走了。反正已经阻止了他金盆洗手，这件事就先告一段落吧，回嵩山向左盟主禀告。")
		G.call("通用_设置全局标记",G.QueryName(0x10070013),3)
	else 
		G.call("对话系统_显示主角对话","（他们似乎向密林方向去了，我是否该追去看个究竟？）")
		int_选择 = G.call("对话系统_显示主角选项","（我是否该追去看个究竟？）",{"刘正风不知正邪，应该去看个究竟！", "还是不摊浑水的好。"})
		if int_选择 == 1 then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_曲终人散"})
			return 
		else 
		end
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_曲终人散'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local int_时间 = G.call("通用_获取游戏时间")
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("通用_播放音效",0x49000024)
	G.call("通用_延时触发事件",100000,"场景_场景交互","曲终",nil,nil)
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606002d)
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_添加静态人物",0x56020058,- 108,95,"刘正风",nil)
	G.call("场景系统_添加静态人物",0x56020059,108,95,"曲洋",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","原来刘正风和那个魔教的曲洋跑到这里来弹琴吹箫。看样子，似乎他们已身受重伤，怎么如此有闲情逸致在这里消遣。我且在这里看看情况再说。")
	G.call("通知系统_显示系统提示","曲洋，刘正风合奏《笑傲江湖》")
	if 100000 <= G.call("通用_获取游戏时间") - int_时间 then 
		string_标识名称 = "曲终"
	else 
	end
	while true do 
		if string_标识名称 == "曲终" then 
			G.call("对话系统_显示NPC对话","曲洋",0x56020059,"刘贤弟，听你箫中之意，却犹有遗恨，莫不是为了正派人士不容于你我相交之故？")
			G.call("对话系统_显示NPC对话","刘正风",0x56020058,"此辈俗人，怎懂得你我以音律相交的高情雅致？他们以常情猜度，自是料定你我结交，将大不利于五岳剑派与侠义道。唉，他们不懂，须也怪他们不得。")
			G.call("对话系统_显示NPC对话","刘正风",0x56020058,"曲大哥，你是大椎穴受伤，震动了心脉？")
			G.call("对话系统_显示NPC对话","曲洋",0x56020059,"正是，嵩山派内功果然厉害，没料到我背上挺受了这一击，内力所及，居然将你的心脉也震断了。早知贤弟也是不免，那一丛黑血神针倒也不必再发了，多伤无辜。")
			G.call("对话系统_显示NPC对话","刘正风",0x56020058,"但你我却也因此而得再合奏一曲，从今而后，世上再也无此琴箫之音了。")
			G.call("对话系统_显示NPC对话","曲洋",0x56020059,"昔日嵇康临刑，抚琴一曲。叹息《广陵散》从此绝响。《广陵散》纵情精妙，又怎及得上咱们这一曲《笑傲江湖》？只是当年嵇康的心情，却也和你我一般。")
			G.call("对话系统_显示NPC对话","刘正风",0x56020058,"你我今晚合奏，将这一曲《笑傲江湖》发挥得淋漓尽致。世上已有过了这一曲，你我已奏过了这一曲，人生于世，夫复何恨？")
			G.call("场景系统_添加静态人物",0x56020062,0,0,"费斌",G.QueryName(0x10020005))
			G.call("对话系统_显示NPC对话","费斌",0x56020062,"衡山派的叛徒原来躲在这里！你们俩在一起最好不过，杀了你们俩我就立了大功！只能怨你福薄命浅，得罪了左盟主，刘正风闭眼吧！")
			G.call("对话系统_显示主角对话","那个家伙好像是嵩山派的，似乎他要下毒手杀害两位前辈。")
			int_选择 = G.call("对话系统_显示主角选项","（我该怎么办？）",{"出声制止！", "闲事少惹，速速离开为妙！"})
			if int_选择 == 1 then 
				G.call("对话系统_显示NPC对话","费斌",0x56020062,"你是什么人？躲在这里鬼鬼祟祟的做什么？莫非你也是魔教的人？")
				G.call("对话系统_显示主角对话","前辈千万别误会！我只是看到这两位前辈似乎身受极重的内伤，听说名门正派从不乘人之危，我不想让前辈您坏了你们名门正派的金字招牌罢了。")
				G.call("对话系统_显示NPC对话","费斌",0x56020062,"老子成名数十年，用得着你来说教？你敢替魔教的人辩解，就一定是魔教的人，不用多说了，我乘成全你的行侠仗义，你也一起死吧！")
				G.call("对话系统_显示主角对话","摆明了你要杀人灭口，我倒要看看你有没有这个能耐！")
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_衡阳_费斌")
				G.call("场景系统_显示")
				if enum_战斗结果_战斗结果 == 1 then 
					G.call("通用_变更人物属性","杀孽","增减",1)
					G.call("对话系统_显示NPC对话","费斌",0x56020062,"好小子，得罪我嵩山派就等于得罪了五岳剑派，到时候你一定会死无葬身之地！呃！！！好深厚的内功！左盟主会为我报仇的~~~")
					G.call("通用_设置全局标记",G.QueryName(0x10070003),3)
					G.call("场景系统_播放通用动画","费斌",G.QueryName(0x10020002),true)
					G.call("场景系统_播放通用动画","费斌",G.QueryName(0x1002000c),false)
					G.call("对话系统_显示NPC对话","刘正风",0x56020058,"多谢少侠施以援手。少侠杀了大嵩阳手费彬，恐怕以后会祸事不断，全是因为刘某之故。这[04]玉真散[02]，全当报答少侠救命之恩。另外，刘某于垂死之际，尚有一事须请少侠帮忙。")
					G.call("通用_变更物品数量",G.QueryName(0x10060013),4)
					G.call("通知系统_显示系统提示","得到 [04]玉真散")
				else 
					G.call("场景系统_添加静态人物",0x5602004f,216,0,"莫大",G.QueryName(0x1002000b))
					G.call("对话系统_显示NPC对话","莫大",0x5602004f,"费师兄，左盟主好。")
					G.call("对话系统_显示NPC对话","费斌",0x56020062,"多谢莫大先生，俺师哥好。贵派的刘正风和魔教妖人结交，意欲不利我五岳剑派。莫大先生，你说该当如何处置？")
					G.call("对话系统_显示NPC对话","莫大",0x5602004f,"该杀！")
					G.call("通用_播放音效",0x49000013)
					G.call("场景系统_播放通用动画","莫大",G.QueryName(0x10020007),false)
					G.call("对话系统_显示NPC对话","费斌",0x56020062,"莫~大~，你好狠~~~~")
					G.call("场景系统_播放通用动画","费斌",G.QueryName(0x10020002),true)
					G.call("场景系统_播放通用动画","费斌",G.QueryName(0x1002000c),false)
					G.call("对话系统_显示NPC对话","曲洋",0x56020059,"你昔日曾说你与你师哥不和，想不到今天你师哥能在危急时刻挺身解危。")
					G.call("对话系统_显示NPC对话","刘正风",0x56020058,"我与师哥倒不是因为贫富之见，只是兴趣不投，他所奏曲尽皆市井的悲伤凄凉味道。我一听到他弹奏，就恨不得赶紧离开。往日我对师哥有失礼敬，现在想起来好生惭愧。")
					G.call("对话系统_显示NPC对话","曲洋",0x56020059,"小兄弟你出来吧，刘某有事求你。")
					G.call("对话系统_显示NPC对话","刘正风",0x56020058,"原来他们早就听到我在附近，如果他们怀有恶意，恐怕我也很难逃走了。")
				end
				G.call("对话系统_显示主角对话","只要晚辈力所能及，前辈尽管吩咐，晚辈无有不从。")
				G.call("对话系统_显示NPC对话","刘正风",0x56020058,"我和曲大哥醉心音律，以数年之功，创制了一曲《笑傲江湖》，自信此曲之奇，千古所未有。今后纵然世上再有曲洋，不见得又有刘正风，有刘正风，不见得又有曲洋。")
				G.call("对话系统_显示NPC对话","刘正风",0x56020058,"就算又有曲洋，刘正风一般的人物，二人又未必生于同时，相遇结交，要两个既精音律，又精内功之人，志趣相投，修为相若，一同创制此曲，实是千难万难了。")
				G.call("对话系统_显示NPC对话","刘正风",0x56020058,"此曲绝响，我和刘贤弟在九泉之下，不免时发浩叹。这是《笑傲江湖曲》的琴谱箫谱，请小兄弟念着我二人一番心血，将这琴谱箫谱携至世上，觅得传人。")
-->				G.log("no_pf1++ //九转熊蛇丸配方")
				G.call("对话系统_显示NPC对话","曲洋",0x56020059,"这《笑傲江湖曲》倘能流传于世，我和刘贤弟死也瞑目了。")
				G.call("通用_变更物品数量",G.QueryName(0x10060022),1)
				G.call("通知系统_显示系统提示","得到[04]《笑傲江湖谱》")
				G.call("对话系统_显示主角对话","二位放心，晚辈自当尽力。")
				G.call("对话系统_显示NPC对话","刘正风",0x56020058,"小兄弟，多谢你成全我们。曲大哥，你我心愿已了，也该上路了~~~")
-->				G.log("no_hydxg+3 //黑玉断续膏")
				G.call("场景系统_播放通用动画","刘正风",G.QueryName(0x1002000c),true)
				G.call("场景系统_播放通用动画","曲洋",G.QueryName(0x1002000c),false)
				G.call("对话系统_显示主角对话","前辈！！！")
				G.call("对话系统_显示主角对话","两位前辈一正一邪，生前结为生死金兰，死后亦能同穴，实在令晚辈钦佩。但愿前辈泉下有知，保佑晚辈此生能觅得传人，了却前辈的心愿。")
			else 
				G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
				return 
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
			return 
		else 
		end
		string_标识名称 = G.call("场景系统_等待场景交互")
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_衡阳武馆'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060007)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020009,245,120,"武馆馆主")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "武馆馆主" then 
			if G.call("通用_检查武功",G.QueryName(0x10040003),nil) then 
				int_选择 = G.call("对话系统_显示NPC选项","武馆馆主",0x56020009,nil,{"挑战馆主二成功力。（二两一次）", "挑战馆主五成功力。（十两一次）", "挑战馆主十成功力。（二十两一次）", "", "离开"})
			else 
				int_选择 = G.call("对话系统_显示NPC选项","武馆馆主",0x56020009,nil,{"挑战馆主二成功力。（二两一次）", "挑战馆主五成功力。（十两一次）", "挑战馆主十成功力。（二十两一次）", "学习形意拳。（五两）", "离开"})
			end
			if int_选择 == 1 then 
				if G.call("通用_检查人物属性","银两",2,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 2)
					if true then 
						G.call("场景系统_隐藏")
						enum_战斗结果_战斗结果 = G.call("战斗_衡阳武馆_馆主",0.2)
						G.call("场景系统_显示")
						if enum_战斗结果_战斗结果 == 1 then 
							G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"少侠资质颇佳，看来是老夫走眼了，他日有缘一定好好切磋一番。")
						else 
							G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"勤能补拙，少侠若能持之以恒，他日必成大器！")
						end
					else 
					end
				else 
					G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"你带着银两不够，请改日再来。")
				end
			elseif int_选择 == 2 then 
				if G.call("通用_检查人物属性","银两",10,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 10)
					if true then 
						G.call("场景系统_隐藏")
						enum_战斗结果_战斗结果 = G.call("战斗_衡阳武馆_馆主",0.5)
						G.call("场景系统_显示")
						if enum_战斗结果_战斗结果 == 1 then 
							G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"少侠资质颇佳，看来是老夫走眼了，他日有缘一定好好切磋一番。")
						else 
							G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"勤能补拙，少侠若能持之以恒，他日必成大器！")
						end
					else 
					end
				else 
					G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"你带着银两不够，请改日再来。")
				end
			elseif int_选择 == 3 then 
				if G.call("通用_检查人物属性","银两",20,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 20)
					if true then 
						G.call("场景系统_隐藏")
						enum_战斗结果_战斗结果 = G.call("战斗_衡阳武馆_馆主",1)
						G.call("场景系统_显示")
						if enum_战斗结果_战斗结果 == 1 then 
							G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"少侠资质颇佳，看来是老夫走眼了，他日有缘一定好好切磋一番。")
						else 
							G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"勤能补拙，少侠若能持之以恒，他日必成大器！")
						end
					else 
					end
				else 
					G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"你带着银两不够，请改日再来。")
				end
			elseif int_选择 == 4 then 
				if G.call("通用_检查人物属性","银两",5,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 5)
					G.call("通用_学会武功",G.QueryName(0x10040003))
					G.call("通用_变更人物属性","力道","增减",5)
					G.call("通用_变更人物属性","身法","增减",8)
					G.call("通用_变更人物属性","护体","增减",5)
					G.call("通用_变更人物属性","拳掌","增减",5)
					G.call("通用_变更人物属性","御剑","增减",5)
					G.call("通用_变更人物属性","生命上限","增减",30)
					G.call("通用_变更人物属性","内力上限","增减",15)
					G.call("通用_变更人物属性","生命","增减",9999)
					G.call("通用_变更人物属性","内力","增减",9999)
				else 
					G.call("对话系统_显示NPC对话","武馆馆主",0x56020009,"你带着银两不够，请改日再来。")
				end
			else 
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_衡阳医馆'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060003)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020002,245,120,"大夫")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "大夫" then 
			int_选择 = G.call("对话系统_显示NPC选项","大夫",0x56020002,nil,{"学习医术，一次100两。", "购买金疮药（补生命）,5两一瓶。", "购买小还丹（补内力）,15两一瓶。", "离开"})
			if int_选择 == 1 then 
				if G.call("通用_检查人物属性","银两",100,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 100)
					G.call("场景系统_播放序列帧动画",3,0,0)
					G.call("通知系统_显示飘字","医术上升",0x4900001a,39423.0,"左下",0)
					G.call("场景系统_播放序列帧动画",3,0,0)
					G.call("通用_变更人物属性","医疗","增减",G.call("运算_随机数",1,6))
				else 
					G.call("对话系统_显示NPC对话","大夫",0x56020002,"你带着银两不够，请改日再来。")
				end
			elseif int_选择 == 2 then 
				if G.call("通用_检查人物属性","银两",5,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 5)
					G.call("通用_变更物品数量",G.QueryName(0x10060011),1)
				else 
					G.call("对话系统_显示NPC对话","大夫",0x56020002,"你带着银两不够，请改日再来。")
				end
			elseif int_选择 == 3 then 
				if G.call("通用_检查人物属性","银两",15,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 15)
					G.call("通用_变更物品数量",G.QueryName(0x10060012),1)
				else 
					G.call("对话系统_显示NPC对话","大夫",0x56020002,"你带着银两不够，请改日再来。")
				end
			else 
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_衡阳客栈'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606002b)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020053,245,120,"店小二")
	G.call("场景系统_添加交互人物",0x56020052,245,0,"酒客")
	G.call("场景系统_显示指令按钮",{"上楼", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "店小二" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070003))
			if int_标记 == 0 then
				G.call("对话系统_显示NPC对话","店小二",0x56020053,"哈你家，刘三爷“金盆洗手”期间，本店食宿一律免费。看您风尘仆仆，一定旅途劳顿，开个房间歇息一下怎么样？")
				int_选择 = G.call("对话系统_显示主角选项","",{"有劳店家，给开间上房。", "多谢店家美意，现在无此打算。"})
				if int_选择 == 1 then
					G.call("场景系统_休息")
				else
				end
			elseif G.call("通用_检查人物属性", "声望", 800, nil) then
				G.call("对话系统_显示NPC对话","店小二",0x56020053,"原来是[姓]大侠！您贵足踏贱地，使我蓬荜生辉，三生有幸。您老人家若有意在此歇息，小店及至荣幸，一律免费。")
				int_选择 = G.call("对话系统_显示主角选项","",{"有劳店家，给开间上房。", "多谢店家美意，现在无此打算。"})
				if int_选择 == 1 then
					G.call("场景系统_休息")
				else
				end
			else
				G.call("对话系统_显示NPC对话","店小二",0x56020053,"哈你家，本店住宿30两。这位大侠要不要歇息一下？")
				int_选择 = G.call("对话系统_显示主角选项","",{"有劳店家，给开间上房。", "多谢店家美意，现在无此打算。"})
				if int_选择 == 1 then
					if G.call("通用_检查人物属性","银两",30,nil) then 
						G.call("通用_变更人物属性","银两","增减",-30)
						G.call("场景系统_休息")
					else
						G.call("对话系统_显示NPC对话","店小二",0x56020053,"哼！钱不够还来摆谱？滚外面睡马圈去！！！")
						int_选择 = G.call("对话系统_显示主角选项","",{"……（忍气吞声离开客栈）", "敢用这种口气跟我说话！今天我要教训教训你！"})
						if int_选择 == 2 then
							G.call("通用_变更人物属性","侠义","增减",-5)
							G.call("对话系统_显示NPC对话","店小二",0x56020053,"吓我？！也不打听打听，有谁敢在这里吃霸王餐！ “看场子”的，给我打！！！")
							G.call("场景系统_隐藏")
							enum_战斗结果_战斗结果 = G.call("战斗_衡阳_打手")
							if enum_战斗结果_战斗结果 == 0 then
								G.call("通用_显示结束菜单")
								return
							else
							end
							G.call("场景系统_显示")
							G.call("对话系统_显示NPC对话","店小二",0x56020053,"大侠真是身手不凡，小人真是开了眼了。这是纹银100两，请您笑纳。马上给你安排最上等的客房供您老休息。")
							G.call("通用_变更人物属性","银两","增减",100)
							G.call("场景系统_休息")
						else
						end
					end
				else
				end
			end
		elseif string_标识名称 == "酒客" then 
			G.call("对话系统_显示NPC随机对话","普通酒客",0x56020052,{"这世道真奇怪，大爷们搂着小尼姑喝花酒，有趣有趣~~~", "想在江湖立足，最好是投入到一个大门派里作为靠山。", "一个人的善恶，世人自有公论。多做善事必有善报！！！", "我年轻时见过一个绝对，“飞雪连天射白鹿”，至今仍无人能对出下联。","“华山轮剑”这种天下一等一的大事，亲眼所见才是不枉此生。","这次刘三爷“金盆洗手”场面当真不小，离正日不到两三天，这城里就已挤满了贺客。","据说练武之人，悟性越高，练功也就事半功倍。但听说有的武功似乎只有笨人才能学会。","每个人机遇不同，勤奋程度不同，也造就了不同的传奇经历。"})
		elseif string_标识名称 == "上楼" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳客栈二楼"})
			return 
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_衡阳客栈二楼'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000b))
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606002c)
	if int_标记 == 1 then 
		G.call("场景系统_添加静态人物",0x56020007,- 108,95,"田伯光",nil)
		G.call("场景系统_添加静态人物",0x56020006,108,95,"仪琳",nil)
		G.call("场景系统_显示")
		G.call("对话系统_显示主角对话","（咦？这不是那个恒山小尼姑吗。到底还是被田伯光捉住了）")
		int_选择 = G.call("对话系统_显示主角选项","",{"（上前搭讪）", "少惹麻烦为妙，离开客栈。"})
		if int_选择 == 1 then 
			G.call("对话系统_显示主角对话","好酒，好酒。")
			G.call("对话系统_显示NPC对话","田伯光",0x56020007,"是你？！")
			G.call("对话系统_显示NPC对话","仪琳",0x56020006,"是你？！少侠救我！！")
			G.call("对话系统_显示主角对话","是我！")
			G.call("对话系统_显示NPC对话","田伯光",0x56020007,"好汉子！")
			G.call("对话系统_显示主角对话","好刀法！")
			G.call("对话系统_显示NPC对话","田伯光",0x56020007,"不打不相识，咱们便交个朋友如何？[姓]兄既看中了这个美貌小尼姑，在下让给你便是。重色轻友，岂是我辈所为？")
			G.call("对话系统_显示主角对话","（田伯光在江湖上臭名昭著，但是刀法十分了得，究竟是否该和他结拜呢？）")
			int_选择 = G.call("对话系统_显示主角选项","",{"我虽非正人君子，但还知道廉耻！", "田兄在上，受小弟[姓名]一拜！"})
			if int_选择 == 1 then 
				G.call("通用_设置全局标记",G.QueryName(0x1007000b),2)
			else 
				G.call("通用_设置全局标记",G.QueryName(0x1007000b),5)
				G.call("场景系统_添加静态人物",0x56020054,0,0,"泰山派道长",G.QueryName(0x10020006))
				G.call("通用_延时",1000)
				G.call("对话系统_显示NPC对话","泰山派道长",0x56020054,"好小子，原来你叫[姓名]！还有这个不守清规的小尼姑！你们竟然和田伯光这个淫贼厮混在一起，还称兄道弟！今天我要替天行道！！！")
				G.call("对话系统_显示NPC对话","田伯光",0x56020007,"我们的谈话被你偷听到了，须容你不得！怨只能怨你听了不该听的话！")
				int_选择 = G.call("对话系统_显示主角选项","",{"阻止田伯光杀这个老道。", "这老道死了，正可保住我的名声。"})
				if int_选择 == 1 then 
					G.call("对话系统_显示NPC对话","田伯光",0x56020007,"既然[姓]兄开口，田某就放他一条生路。只是放了他，他四处去胡说八道，怕是于你的名声可不太好啊。")
					G.call("对话系统_显示NPC对话","泰山派道长",0x56020054,"哼，休想我会承你们的情！你们今天三个人的丑事我会公诸于天下，你们将会是全武林的公敌！总有一天会有恶报的！")
					G.call("场景系统_播放通用动画","泰山派道长",G.QueryName(0x1002000a),false)
					G.call("通用_变更人物属性","侠义","增减",- 20)
					G.call("通用_变更人物属性","声望","增减",50)
					G.call("通用_延时",1000)
					G.call("对话系统_显示主角对话","本来我的名声也好不到哪去，人生在世哪管得了那么许多，只是连累了这位出家的小师父。")
				else 
					G.call("通用_播放音效",0x49000007)
					G.call("场景系统_播放序列帧动画",2,0,-24)
					G.call("对话系统_显示NPC对话","田伯光",0x56020007,"坐下，坐下，喝酒，喝酒！")
					G.call("对话系统_显示NPC对话","泰山派道长",0x56020054,"好~快~的~刀~~~~~~")
					G.call("场景系统_播放通用动画","泰山派道长",G.QueryName(0x10020002),true)
					G.call("场景系统_播放通用动画","泰山派道长",G.QueryName(0x1002000c),false)
					G.call("对话系统_显示NPC对话","仪琳",0x56020006,"啊！泰山派的师叔！阿弥陀佛~~~")
				end
			end
			G.call("对话系统_显示NPC对话","田伯光",0x56020007,"真是麻烦！看来这酒是喝不成了，扫兴的紧！[姓]兄，小尼姑你好好享受吧，田某看来没这个艳福了。告辞了！")
			G.call("通用_播放音效",0x49000023)
			G.call("场景系统_播放通用动画","田伯光",G.QueryName(0x10020009),false)
			G.call("通用_延时",1000)
			G.call("对话系统_显示NPC对话","仪琳",0x56020006,"多谢少侠再施援手，仪琳无以为报，只有早晚一柱清香，保佑少侠福寿安康，长命百岁。")
			G.call("对话系统_显示NPC对话","仪琳",0x56020006,"这是我恒山派密制灵药[04]九转熊蛇丸[02]，在危急时刻，希望能派上用场。")
			G.call("通用_变更物品数量",G.QueryName(0x10060015),3)
			G.call("通知系统_显示系统提示","获得 [04]九转熊蛇丸")
			G.call("通用_设置全局标记",G.QueryName(0x1007000a),2)
			G.call("对话系统_显示NPC对话","仪琳",0x56020006,"仪琳尚有要事，先行一步，少侠后会有期！")
			G.call("通用_变更人物属性","侠义","增减",5)
			G.call("场景系统_播放通用动画","仪琳",G.QueryName(0x10020009),false)
			G.call("场景系统_隐藏")
			G.call("场景系统_清空")
			G.call("场景系统_设置背景图片",0x5606002c)
			G.call("场景系统_显示主界面",true)
			G.call("场景系统_显示指令按钮",{"下楼"})
			G.call("场景系统_显示")
		else 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳客栈"})
			return 
		end
	else 
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示指令按钮",{"下楼"})
		G.call("场景系统_显示")
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "下楼" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_衡阳客栈"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_襄阳'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060017)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加跳转按钮","绿竹巷",0x56010061)
	G.call("场景系统_添加跳转按钮","衙门",0x56010062)
	G.call("场景系统_添加跳转按钮","妓院",0x56010064)
	G.call("场景系统_添加跳转按钮","离开",nil)
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "绿竹巷" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳绿竹巷"})
			return 
		elseif string_标识名称 == "衙门" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳衙门"})
			return 
		elseif string_标识名称 == "妓院" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳妓院"})
			return 
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_襄阳绿竹巷'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060030)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602005b,0,120,"绿竹翁")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "绿竹翁" then 
			G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"主人喜欢清静，请俗人勿扰。")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_襄阳衙门'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070017))
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606002f)
	if int_标记 == 0 then 
		if G.call("通用_检查物品",G.QueryName(0x10060022)) then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_蒙冤"})
			return 
		else 
			G.call("场景系统_添加交互人物",0x5602005e,0,120,"士兵")
			G.call("场景系统_显示主界面",true)
			G.call("场景系统_显示指令按钮",{"离开"})
			G.call("场景系统_显示")
		end
	elseif int_标记 == 1 then 
		G.call("场景系统_添加交互人物",0x5602005d,0,120,"吕文德")
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
	else 
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
		if G.call("场景系统_检查能否触发事件") then
			G.call("对话系统_显示主角对话","衙门已经被我挑了，不知道朝廷什么时候能派个得力的地方官过来")
		end
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "士兵" then 
			G.call("对话系统_显示NPC对话","士兵",0x5602005e,"最近有人报案，家里失窃了一本祖传剑谱和二万两银子。官府正四处通缉要犯，希望罪犯能投案自首争取政府宽大处理。")
			G.call("对话系统_显示NPC对话","士兵",0x5602005e,"闲杂人等不许在此逗留，否则当成疑犯一并捉了去！")
		elseif string_标识名称 == "吕文德" then 
			G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"前些天把你放走了，现在又来做什么？")
			int_选择 = G.call("对话系统_显示主角选项","",{"对不起我走错了，马上离开。", "我受够了你们的虐待，今天来为民除害！"})
			if int_选择 == 2 then 
				for int_i = 1, 3, 1 do 
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_襄阳_官兵")
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("通用_显示结束菜单")
						return 
					else 
					end
					G.call("通用_变更人物属性","杀孽","增减",1)
					G.call("场景系统_显示")
				end
				G.call("场景系统_变色",255.0)
				G.call("场景系统_移除人物","吕文德")
				G.call("场景系统_显示")
				G.call("对话系统_显示主角对话","你们这群脓包官兵留着也是废物！今天正好替天行道。")
				G.call("通用_变更人物属性","银两","增减",2000)
				G.call("通知系统_显示系统提示","获得 [04]银子2000两",nil)
				G.call("对话系统_显示主角对话","这狗官搜刮了这么多民脂民膏，的确罪该万死！")
				G.call("通用_设置全局标记",G.QueryName(0x10070017),2)
				G.call("通用_变更人物属性","杀孽","增减",1)
				G.call("通用_变更人物属性","侠义","增减",10)
				G.call("通用_变更人物属性","声望","增减",80)
			else 
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_蒙冤'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606002f)
	G.call("场景系统_添加静态人物",0x5602005d,0,95,"吕文德",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"好小子！等到今日你才自投罗网，你真是让官爷们等的好苦！")
	G.call("对话系统_显示主角对话","喂，等等。我怎么听不懂你在说什么。")
	G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"小子还想狡辩？你身上那本书册就是近日城内丢失的珍贵剑谱，人赃并获，你还能抵赖不成？")
	G.call("对话系统_显示主角对话","你该不会是在说这本乐谱吧。这是一首《笑傲江湖》曲子的曲谱，你难道不认识字吗？")
	G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"你奶奶的，不但企图晃点我，还敢讥讽我不识字。来人啊，把他给我拿下！")
	G.call("对话系统_显示主角对话","你们这些狗官真是蛮不讲理，打就打，谁怕谁啊！")
	G.call("场景系统_隐藏")
	G.call("对话系统_显示主角对话","啊！！！！ 你们这些王八蛋竟然用生石灰暗算我！")
	G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"对付你这种下三滥的人渣，自然要用下三滥的手段！ 把罪犯押进牢房，等日后审理！")
	G.call("对话系统_显示主角对话","总有一天我会把你们这群狗屎官兵全部斩尽杀绝！")
	G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"嘿嘿，等你能活得离开这里再说吧。")
	G.call("通用_变更物品数量",G.QueryName(0x10060022),- 1)
	G.call("通用_变更人物属性","银两","设为",0)
	G.call("通用_设置全局标记",G.QueryName(0x10070017),1)
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606002e)
	G.call("场景系统_添加静态人物",0x5602005c,- 108,95,"丁典",nil)
	G.call("场景系统_添加静态人物",0x5602005a,108,95,"狄云",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","狗官竟然把我关到牢房里了！我怎么这么倒霉，刚出江湖就被这帮孙子给陷害了。现在《笑傲江湖》的乐谱也被夺了去，真是有负老前辈所托。")
	G.call("对话系统_显示NPC对话","丁典",0x5602005c,"嘿嘿，官府那帮狗贼为了探听我的秘密，又送进一个当卧底。奶奶的，当我是傻子吗？")
	G.call("对话系统_显示NPC对话","狄云",0x5602005a,"丁大哥，你可要冷静。说不定这位小兄弟是跟我一样，也是遭人陷害被冤枉的。")
	G.call("对话系统_显示NPC对话","丁典",0x5602005c,"狄兄弟，你心肠太好，以后行走江湖千万不要被小人的诡计给蒙骗了。坏人从不会说自己是坏人，也不会告诉你有诡计打算陷害你。你可千万要记得了。")
	G.call("对话系统_显示主角对话","你这个疯子！懒得理你。")
	G.call("对话系统_显示NPC对话","丁典",0x5602005c,"小子还敢骂我，我来教训教训你。")
	G.call("场景系统_隐藏")
	enum_战斗结果_战斗结果 = G.call("战斗_襄阳_丁典")
	if enum_战斗结果_战斗结果 == 0 then 
		G.call("通用_显示结束菜单")
		return 
	else 
	end
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","丁典",0x5602005c,"小子好功夫。咱们也算是不打不相识，我相信你不是官府派来的卧底。告诉你，我已经不能在这里长待了，我被熟人认了出来，所以今晚就要越狱，你跟不跟我们走？")
	int_选择 = G.call("对话系统_显示主角选项","",{"不跟你走，我要等候公正的判决。", "好，我跟你一起越狱。"})
	if int_选择 == 1 then 
		G.call("对话系统_显示NPC对话","丁典",0x5602005c,"想不到还有这么迂腐的人。既然如此，咱们后会有期。")
		G.call("对话系统_显示NPC对话","狄云",0x5602005a,"小兄弟，你既然不肯跟我们走，这件乌蚕衣送给你做防身之用，希望你多多保重吧。")
		G.call("通用_变更物品数量",G.QueryName(0x1006000c),1)
		G.call("通知系统_显示系统提示","获得 [04]乌蚕衣")
		G.call("场景系统_隐藏")
		G.call("场景系统_移除人物","丁典")
		G.call("场景系统_移除人物","狄云")
		G.call("场景系统_显示")
		G.call("对话系统_显示主角对话","哇，眼前一黑两人就没了。原来越狱这么简单阿。")
		G.call("场景系统_添加静态人物",0x5602005e,0,95,"士兵",G.QueryName(0x10020005))
		G.call("对话系统_显示NPC对话","士兵",0x5602005e,"小子！大人现在要审你的案子，你最好老老实实坦白，免受皮肉之苦。")
		G.call("场景系统_隐藏")
		G.call("通用_停止所有声音")
		G.call("场景系统_清空")
		G.call("场景系统_设置背景图片",0x5606002f)
		G.call("场景系统_添加静态人物",0x5602005d,0,95,"吕文德",nil)
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"你承不承认偷了别人的祖传剑谱和二万两银子？")
		int_选择 = G.call("对话系统_显示主角选项","",{"我承认。", "我不承认。"})
		if int_选择 == 1 then 
			G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"好！犯人已经认罪服法，立刻开刀问斩！")
			G.call("对话系统_显示主角对话","啊！！！！！！！！！！！ 我冤枉！！！！！！！！！！！！！！！！！")
			G.call("场景系统_变色",255.0)
			G.call("通用_显示结束菜单")
			return 
		else 
			G.call("对话系统_显示主角对话","我跟你说过多少次了，这只是一本乐谱。你自己没见识不见得别人也跟你一样。你去找一个懂音乐的，让他来鉴别一下，看看这究竟是乐谱还是剑谱。")
			G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"好，我让你死也瞑目。城东绿竹巷有个老头擅长吹箫，便让他当面揭穿你的谎话！")
			G.call("场景系统_隐藏")
			G.call("通用_停止所有声音")
			G.call("场景系统_清空")
			G.call("场景系统_设置背景图片",0x56060030)
			G.call("场景系统_添加静态人物",0x5602005b,0,95,"绿竹翁",nil)
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"巡抚使吕文德亲自来到这里，怎么此间主人不出来迎接？")
			G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"我家主人一贯不喜和官府的人打交道，请各位不要扰了此处的清静。")
			G.call("对话系统_显示主角对话","老前辈，晚辈身受不白之冤，所带曲谱被人认作偷窃而来的剑谱，因此想请前辈鉴别一下，以还晚辈清白。")
			G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"我先看看那乐谱再说。")
			G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"嗯……嗯……咦？这可奇了。我再来看一下。")
			G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"哼，如何？连这个老头都觉得奇怪，你必定不是乐谱，你还想狡辩吗？")
			G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"你，住口！这位小兄弟，你且少等片刻，我去请教我家主人。")
			G.call("场景系统_隐藏")
			G.call("通用_播放音效",0x49000024)
			G.call("场景系统_显示")
			G.call("通用_延时",100000)
			G.call("对话系统_显示主角对话","对！就是这首曲子。和我当初听到的一模一样，只可惜作曲的两位前辈已经逝去了。")
			G.call("场景系统_隐藏")
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"各位都听到了。这确是琴谱箫谱，我家主人适才奏过了，小兄弟你拿回去罢！这曲谱中所记乐曲之妙，世上罕有，此乃神物，不可落入俗人手中。")
			G.call("对话系统_显示NPC对话","吕文德",0x5602005d,"哼，今日便放过你小子。你要是再有案子落在我手里，咱们新帐后帐一起算！")
			G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"小兄弟你也赶紧离去吧，我家主人不喜欢陌生人打扰。")
			int_选择 = G.call("对话系统_显示主角选项","",{"将乐谱献给前辈。", "多谢前辈相救，晚辈告辞了。"})
			if int_选择 == 1 then 
				G.call("对话系统_显示NPC对话","绿竹翁",0x5602005b,"多谢小兄弟，我家主人也确实喜欢这首乐谱，谢谢你成全。这黑木令是主人命我赠给你的，就当作纪念吧。")
				G.call("通用_变更物品数量",G.QueryName(0x1006002b),1)
				G.call("通知系统_显示系统提示","获得 [04]黑木令")
			else 
				G.call("通用_变更物品数量",G.QueryName(0x10060022),1)
			end
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳绿竹巷"})
			return 
		end
	else 
		G.call("场景系统_隐藏")
		G.call("场景系统_设置背景图片",0x56060017)
		G.call("场景系统_显示")
		G.call("对话系统_显示主角对话","没想到越狱这么简单。")
		G.call("对话系统_显示NPC对话","丁典",0x5602005c,"是这里做官的太过脓包，整日就知道欺压良民，总有一日会遭报应的。不过，小兄弟你今日随我们逃狱，现在已经成了官府上通缉的江洋大盗。日后可要处处小心了。今日就此别过，它日有缘再见。")
		G.call("通用_变更人物属性","声望","增减",50)
		G.call("通用_变更人物属性","侠义","设为",0)
		o_role_主角.称号 = "江洋大盗"
		G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳"})
		return 
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_襄阳妓院'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060018)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602002b,245,150,"老鸨")
	G.call("场景系统_添加交互人物",0x56020008,245,40,"小宝货郎")
	G.call("场景系统_添加交互人物",0x5602002a,245,- 70,"玉机子")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "老鸨" then 
			G.call("对话系统_显示NPC对话","老鸨",0x5602002b,"想不到小哥哥一身正气，也来这里寻欢作乐。不管怎么说，来这里的都是我们的衣食父母。请问小哥哥你喜欢本地的姑娘还是外地的？")
			int_选择 = G.call("对话系统_显示主角选项","",{"我喜欢本地的！", "我喜欢外地的！", "不好意思，我对女人没兴趣。"})
			if int_选择 == 3 then 

			else 
				G.call("场景系统_休息")
				G.call("通用_变更人物属性","侠义","增减",- 1)
				G.call("对话系统_显示主角对话","啊！！！ 怎么是你这个老女人？？！！")
				G.call("对话系统_显示NPC对话","老鸨",0x5602002b,"小哥真识货。我是这城里唯一一个拥有双户口的粉头。本地和外地都由奴家我一人独揽。奴家跟你很是有缘，以后你只要来这找我，全部给你免单。")
				G.call("对话系统_显示主角对话","实在是提不起兴致了，后会无期吧。")
			end
		elseif string_标识名称 == "小宝货郎" then 
			if G.call("运算_随机数",1,5) == 1 then 
				G.call("对话系统_显示NPC对话","小宝货郎",0x56020008,"我这辈子吉星高照，好运滚滚来。不知道有没有人想买我的好运气。")
				G.call("对话系统_显示主角对话","兄台，听说你要出售“运气”？")
				G.call("对话系统_显示NPC对话","小宝货郎",0x56020008,"是啊，每出售一次是200两银子。至于能给你带来多大好处，就看你自己的造化了。")
				int_选择 = G.call("对话系统_显示主角选项","",{"好，我买了！", "太贵了，我不买。"})
				if int_选择 == 1 then
					if G.call("通用_检查人物属性","银两",200,nil) then 
						G.call("通用_变更人物属性","银两","增减",- 200)
						G.call("通用_变更人物属性","福缘","增减",G.call("运算_随机数",1,10))
						G.call("通知系统_显示系统提示","[04]福缘提高")
					else
						G.call("对话系统_显示NPC对话","小宝货郎",0x56020008,"当我不识数阿？把钱揍够了再来找我吧。")
					end
				end
			else 
				G.call("对话系统_显示NPC随机对话","小宝货郎",0x56020008,{"听我唱过十八摸，伸手摸姐面边丝，乌云飞了半天边，伸手摸姐脑前边……", "我的最大志愿就是开全国最大的妓院。", "以前百万金银过手，现在却要靠卖杂货谋生，离人生目标越来越远了。", "不知道小玄子现在怎样了，好怀念从前的小玄子。"})
			end
		elseif string_标识名称 == "玉机子" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070013))
			if int_标记 == 8 then
				G.call("对话系统_显示主角对话","你就是泰山玉玑子吧。没想到正经门派的老道长还有这种癖好？难道你们泰山派有种采阴补阳的内功心法，需要男女双修？")
				G.call("对话系统_显示NPC对话","玉机子",0x5602002a,"奶奶的！管道爷的事！ 咦？原来是左盟主派来的。不知道左盟主有什么指示？")
				G.call("对话系统_显示主角对话","左盟主让你嵩山一趟，有事相商。")
				G.call("对话系统_显示NPC对话","玉机子",0x5602002a,"左盟主有令，不敢不从。但是我在这里欠下了1000两的嫖资，现在走不开阿。")
				if G.call("通用_检查人物属性","银两",1000,nil) then 
					G.call("通用_变更人物属性","银两","增减",- 1000)
					G.call("对话系统_显示主角对话","你这1000两我先给你垫上，赶紧给我滚上嵩山，别耽误老子做任务。")
					G.call("对话系统_显示NPC对话","玉机子",0x5602002a,"好的好的，等我再嫖几个就走。")
					G.call("通用_设置全局标记",G.QueryName(0x10070013),9)
				else
				end
			else
				G.call("对话系统_显示NPC对话","玉机子",0x5602002a,"滚开！没见过道爷嫖妓啊？！")
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_襄阳"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_少林寺'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606001a)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602001e,0,120,"僧人")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "僧人" then 
			G.call("对话系统_显示NPC对话","僧人",0x5602001e,"这里是嵩山少林寺，请问施主有何贵干？")
			int_选择 = G.call("对话系统_显示主角选项","",{"少林寺是天下武功正宗，特来拜师。", "顺道路过别无他意。", "（利用轻功偷偷溜进少林寺）"})
			if int_选择 == 1 then 
				if o_role_主角.门派 == "无门派" then 
					G.call("对话系统_显示NPC对话","僧人",0x5602001e,"武学一道可为善为恶，希望无边佛法能引导施主从良从善。")
					G.call("场景系统_切换剧本",{n = 0, "剧情_少林寺_拜师"})
					return 
				else 
					G.call("对话系统_显示NPC对话","僧人",0x5602001e,"施主已入其他们派，入我少林会多有不便。请施主打消这个念头吧。")
				end
			elseif int_选择 == 2 then 
			elseif int_选择 == 3 then 
				if G.call("运算_随机数",1,50) < G.call("运算_随机数",1,o_role_主角.身法) then 
					G.call("场景系统_隐藏")
					G.call("场景系统_移除人物","僧人")
					G.call("场景系统_显示")
					G.call("对话系统_显示主角对话","可算是避过了门口那个和尚。少林藏经阁收罗少林诸多武学宝典，到那里说不定偷盗些绝世神功的秘籍。")
					if G.call("运算_随机数",1,80) < G.call("运算_随机数",1,o_role_主角.身法) then 
						G.call("场景系统_隐藏")
						G.call("场景系统_设置背景图片",0x5606001b)
						G.call("场景系统_显示")
						G.call("对话系统_显示主角对话","总算顺利溜进来了。赶紧找找，看看今天能有什么发现。")
						G.call("场景系统_隐藏")
						G.call("场景系统_显示")
						int_选择 = G.call("运算_随机数",1,8)
						if int_选择 == 1 then 
							G.call("通知系统_显示系统提示","获得[04]《法华经》",nil)
							G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
						elseif int_选择 == 2 then 
							G.call("通知系统_显示系统提示","获得[04]《阿含经》",nil)
							G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
						elseif int_选择 == 3 then 
							G.call("通知系统_显示系统提示","获得[04]《楞严经》",nil)
							G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
						elseif int_选择 == 4 then 
							G.call("通知系统_显示系统提示","获得[04]《法句经》",nil)
							G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
						elseif int_选择 == 5 then 
							G.call("通知系统_显示系统提示","获得[04]《入道四行经》",nil)
							G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
						elseif int_选择 == 6 then 
							if G.call("通用_检查武功",G.QueryName(0x10040012),1) then 
								G.call("通知系统_显示系统提示","获得[04]《入道四行经》",nil)
								G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
							else 
								G.call("通知系统_显示系统提示","发现[04]《七十二绝技•拈花指》",nil)
								G.call("对话系统_显示主角对话","原来是少林七十二绝技中的一门指法。真是不虚此行。下次再来看看能找到什么更好的。")
								G.call("通用_学会武功",G.QueryName(0x10040012))
							end
						elseif int_选择 == 7 then 
							if G.call("通用_检查物品",G.QueryName(0x10060040)) then 
								G.call("通知系统_显示系统提示","获得[04]《法句经》",nil)
								G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
							else 
								G.call("通知系统_显示系统提示","发现[04]《易筋经》",nil)
								G.call("对话系统_显示主角对话","原来是少林之宝易筋经！！没想到这么轻易就弄到手了。赶紧离开这里，免得节外生枝。")
								G.call("通用_变更物品数量",G.QueryName(0x10060040),1)
							end
						elseif int_选择 == 8 then 
							if G.call("通用_检查武功",G.QueryName(0x10040012),1) and G.call("通用_检查物品",G.QueryName(0x10060040)) then 
								G.call("场景系统_添加静态人物",0x56020035,0,95,"无名僧",nil)
								G.call("对话系统_显示NPC对话","无名僧",0x56020035,"施主的拈花指和易筋经不知练得如何了？")
								G.call("对话系统_显示主角对话","什么人？！ 你什么时候多在这里的？你怎么知道我练了易筋经？")
								G.call("对话系统_显示NPC对话","无名僧",0x56020035,"施主问我躲在这里有多久了？我记不清楚了，不知是四十二年，还是四十三年。有位萧老居士最初晚上来看经之时，我已来了十多年。")
								G.call("对话系统_显示NPC对话","无名僧",0x56020035,"后来慕容老居士来了，前几年，那天竺僧波罗星也来盗经。唉，你来我去，将阁中的经书翻得乱七八糟，也不知为了甚么。")
								G.call("对话系统_显示NPC对话","无名僧",0x56020035,"失主第一次来借阅的，是一本《拈花指法》吧。当时老僧暗暗叹息，知道施主由此入魔，愈陷愈深，心中不忍，在施主惯常取书之处，放了一部《法华经》，一部《阿含经》，只盼施主能借了去，研读参悟。")
								G.call("对话系统_显示NPC对话","无名僧",0x56020035,"不料施主沉迷于武学，于正宗佛法却置之不理，将这两部经书撇在一旁，找到了《易筋经》，却欢喜鼓舞而去。唉，沉迷苦海，不知何日方得回头？")
								int_选择 = G.call("对话系统_显示主角选项","",{"你这老头有何本事，胆敢教训我！", "（来者不善，偷偷溜走吧）"})
								if int_选择 == 1 then 
									G.call("场景系统_隐藏")
									enum_战斗结果_战斗结果 = G.call("战斗_少林_无名僧",1)
									G.call("场景系统_显示")
									if enum_战斗结果_战斗结果 == 1 then 
										G.call("对话系统_显示NPC对话","无名僧",0x56020035,"善哉善哉。施主武功已达化境，真是难能可贵。如果能够造福天下，才真是不枉此生。")
										G.call("对话系统_显示主角对话","多谢高僧教诲。晚辈一定铭记在心。")
									else 
										G.call("对话系统_显示NPC对话","无名僧",0x56020035,"善哉善哉，施主虽然学了少林的武功，却没有领会少林的佛法精神。一味残忍好斗，与真正的少林武学之道背道而驰。")
										G.call("对话系统_显示NPC对话","无名僧",0x56020035,"须知佛法在求渡世，武功在求杀生，两者背道而驰，相互克制。只有佛法越高，慈悲之念越盛，武功绝技才能练得越强越多，因此少侠武功虽强，但也只能到如此境界而已了。")
										G.call("对话系统_显示主角对话","我偏就不信你的连篇鬼话。总有一天我会用真正实力来反驳你今天说的话。告辞了！")
									end
								else 
								end
							else 
								G.call("通知系统_显示系统提示","获得[04]《法华经》",nil)
								G.call("对话系统_显示主角对话","原来是本佛经，不是武功秘籍，真是扫兴。下次再来吧。")
							end
						else 
						end
					else 
						G.call("场景系统_隐藏")
						G.call("场景系统_设置背景图片",0x5606001b)
						G.call("场景系统_添加静态人物",0x5602001e,0,95,"僧人",nil)
						G.call("场景系统_显示")
						G.call("对话系统_显示NPC对话","僧人",0x5602001e,"藏经阁乃少林藏经重地，非方丈许可，外人不得入内！")
						G.call("对话系统_显示主角对话","糟了！被发现了，赶紧跑吧。")
					end
				else 
					G.call("场景系统_隐藏")
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","僧人",0x5602001e,"少林寺乃佛门清净地，居心不良者妄想入内！")
					G.call("对话系统_显示主角对话","糟了！被发现了，赶紧跑吧。")
				end
				G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
				return
			else 
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_少林寺_拜师'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606001c)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020037,0,120,"玄慈")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "玄慈" then 
			G.call("对话系统_显示NPC对话","玄慈",0x56020037,"佛法无边，无不可渡之人。施主既然诚心入我少林，然尘心未了，可算做少林俗家弟子，拜师在玄苦师弟门下。")
			G.call("通用_变更人物属性","声望","增减",50)
			o_role_主角.门派 = "少林派"
			o_role_主角.称号 = "少林派弟子"
			G.call("场景系统_切换剧本",{n = 0, "剧情_少林寺_日常"})
			return 
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_少林寺_日常'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606001c)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020037,0,120,"玄慈")
	G.call("场景系统_添加交互人物",0x5602001e,- 208,0,"僧人")
	G.call("场景系统_添加交互人物",0x56020005,208,0,"玄苦")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "玄慈" then 
			G.call("通用_变更人物属性","杀孽","设为",0)
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070015))
			if int_标记 == 0 and G.call("通用_检查人物属性","等级",30,100) then 
				G.call("对话系统_显示NPC对话","玄慈",0x56020037,"各大派现在围攻光明顶，我少林身为武林领袖岂可袖手？虽造杀戮，但救千万人。佛曰：我不入地狱，谁入地狱？")
			else 
				G.call("对话系统_显示NPC对话","玄慈",0x56020037,"阿弥陀佛，少林弟子需得存慈悲心，渡世渡人，大慈大悲。")
			end
		elseif string_标识名称 == "僧人" then 
			G.call("对话系统_显示NPC对话","僧人",0x5602001e,"本门武功需得勤学苦练方能有所成就。师弟，准备好跟我过招了吗？")
			int_选择 = G.call("对话系统_显示主角选项","",{"向师兄请教武功，请师兄手下留情。", "小弟哪里是师兄对手，日后再向师兄讨教。"})
			if int_选择 == 1 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_少林_僧人",1)
				G.call("场景系统_显示")
			else 
			end
		elseif string_标识名称 == "玄苦" then 
			if not  G.call("通用_检查武功",G.QueryName(0x10040004),1) then 
				G.call("对话系统_显示NPC对话","玄苦",0x56020005,"少林武功讲究循序渐进。想要练好高深武功需要以初级武功为基础。为师先传你少林入门功夫“罗汉拳”。")
				G.call("通知系统_显示系统提示","习得[04]《罗汉拳》")
				G.call("通用_学会武功",G.QueryName(0x10040004))
			elseif G.call("通用_检查武功",G.QueryName(0x10040004),6) and not  G.call("通用_检查武功",G.QueryName(0x1004000b),1) then 
				G.call("对话系统_显示NPC对话","玄苦",0x56020005,"为师俗家之时曾得到高人传授一门掌法，讲究内外兼修，虽然不是少林武功，但是你也不算少林入门弟子，传于你也不算是破了寺规。")
				G.call("通知系统_显示系统提示","习得[04]混元掌")
				G.call("通用_学会武功",G.QueryName(0x1004000b))
			elseif G.call("通用_检查武功",G.QueryName(0x1004000b),6) and not  G.call("通用_检查武功",G.QueryName(0x10040011),1) then 
				G.call("对话系统_显示NPC对话","玄苦",0x56020005,"姑苏慕容家有一门指法绝学，可堪比大理段家的一阳指，和黄岛主的弹指神通。当年慕容家一位高人与掌门师兄切磋时曾经使过。你若能练成，将会对你大有裨益。")
				G.call("通知系统_显示系统提示","习得[04]参合指")
				G.call("通用_学会武功",G.QueryName(0x10040011))
			elseif G.call("通用_检查武功",G.QueryName(0x10040011),6) and not  G.call("通用_检查武功",G.QueryName(0x10040012),1) then 
				G.call("对话系统_显示NPC对话","玄苦",0x56020005,"想不到慕容家的精妙指法你都能够练成，看来你果然是练武的好材料。现在传授你本门七十二绝技中的拈花指。拈花指属于我少林佛门至高武学之一，只有精通佛法，心怀慈悲之人，才能施展其真正威力。")
				G.call("通知系统_显示系统提示","习得[04]七十二绝技。拈花指")
				G.call("通用_学会武功",G.QueryName(0x10040012))
			else 
				G.call("对话系统_显示NPC对话","玄苦",0x56020005,"你身为少林俗家弟子，也需受少林戒律约束。忌酒色戒杀生，倘若破戒，别怪为师不讲情面。")
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_少林寺_思过'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local int_计数 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606001c)
	G.call("场景系统_添加静态人物",0x56020005,0,95,"玄苦",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","玄苦",0x56020005,"你这次下山又伤了多条性命，不管你所杀是善是恶，总归是破了戒，罚你去伙房思过。")
	G.call("场景系统_隐藏")
	G.call("场景系统_设置背景图片",0x5606001d)
	G.call("场景系统_移除人物","玄苦")
	G.call("场景系统_添加静态人物",0x56020036,0,95,"缘根",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","缘根",0x56020036,"你给我老老实实说个明白，你究竟犯了什么戒？莫说你是个没职司的小和尚，便是达摩院，罗汉堂的首座犯了戒，只要是罚到我这后厨来，我一般要问个明白，谁敢不答？")
	G.call("对话系统_显示NPC对话","缘根",0x56020036,"我瞧你啊，脸上红红白白，定是偷吃荤腥，是也不是？说不定私下还偷喝酒呢，你要想瞒我，可没这么容易。")
	G.call("对话系统_显示NPC对话","缘根",0x56020036,"嘿嘿，灌饱了黄汤，那便心猿意马，这“色即是空，空即是色”八个字，定然也置之脑后了。你心中便想女娘们，是不是？不但想一次，至少也想了七次八次，你敢不敢认？")
	G.call("对话系统_显示主角对话","不敢欺瞒师兄。以上几戒皆未犯过，只因为制作者没有提供这些功能，所以即便是师弟有这贼心贼胆，却没贼能力。")
	G.call("对话系统_显示NPC对话","缘根",0x56020036,"原来如此。你究竟何故才被罚到这里？")
	G.call("对话系统_显示主角对话","我就是不小心杀了几个人。师父因我杀生所以罚我到此思过。")
	G.call("对话系统_显示NPC对话","缘根",0x56020036,"哦，原来这样。你空有一身本领，但是到了我这里，凡事还需得听我的安排。胆敢反抗，死路一条！")
	G.call("场景系统_隐藏")
	G.call("场景系统_移除人物","缘根")
	G.call("场景系统_添加交互人物",0x56020036,0,120,"缘根")
	G.call("场景系统_显示")
	int_计数 = 0
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "缘根" then 
			int_选择 = G.call("运算_随机数",1,5)
			if int_选择 == 1 then 
				G.call("对话系统_显示NPC对话","缘根",0x56020036,"小崽子，去给老子倒盆洗脚水来！")
				int_选择 = G.call("对话系统_显示主角选项","",{"是，这就给师兄准备。", "臭秃驴想找死啊！"})
				if int_选择 == 1 then 
					int_计数 = int_计数 + 1
				else 
				end
			elseif int_选择 == 2 then 
				G.call("对话系统_显示NPC对话","缘根",0x56020036,"看你小子真不顺眼！叫三声“好爷爷”，今天就饶了你！")
				int_选择 = G.call("对话系统_显示主角选项","",{"好爷爷，好爷爷，好爷爷。", "臭秃驴想找死啊！"})
				if int_选择 == 1 then 
					int_计数 = int_计数 + 1
				else 
				end
			elseif int_选择 == 3 then 
				G.call("对话系统_显示NPC对话","缘根",0x56020036,"这里有碗发霉的剩饭，你快给我吃掉！")
				int_选择 = G.call("对话系统_显示主角选项","",{"吃了会影响身体健康，但是我不怕。", "臭秃驴想找死啊！"})
				if int_选择 == 1 then 
					G.call("通用_变更人物属性","生命","乘以",0.9)
					G.call("通用_变更人物属性","内力","乘以",0.9)
					int_计数 = int_计数 + 1
				else 
				end
			elseif int_选择 == 4 then 
				G.call("对话系统_显示NPC对话","缘根",0x56020036,"这几天老子不爽，你就别吃饭了！")
				int_选择 = G.call("对话系统_显示主角选项","",{"饿死我了，体力已经支持不住了。", "臭秃驴想找死啊！"})
				if int_选择 == 1 then 
					G.call("通用_变更人物属性","生命","设为",1)
					int_计数 = int_计数 + 1
				else 
				end
			elseif int_选择 == 5 then 
				G.call("对话系统_显示NPC对话","缘根",0x56020036,"我正在练一门很厉害的功夫，你来陪我练练。")
				int_选择 = G.call("对话系统_显示主角选项","",{"是。", "臭秃驴想找死啊！"})
				int_选择 = 2
			else 
			end
			if int_选择 == 2 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_少林_僧人2",1)
				G.call("场景系统_显示")
				if enum_战斗结果_战斗结果 == 1 then 
					G.call("对话系统_显示NPC对话","缘根",0x56020036,"你竟然敢打伤我，你会后悔的！")
					G.call("对话系统_显示NPC对话","玄苦",0x56020005,"罪过罪过。本来叫你来这里受罚希望你能悔过自新，谁知你劣性难改，你不是少林门弟子，所以无法用更重的刑法责罚你，因此为了维护少林清誉只有把你逐出少林。")
					G.call("通用_设置全局标记",G.QueryName(0x10070018),1)
					G.call("通用_变更人物属性","声望","增减",- 50)
					o_role_主角.门派 = "无门派"
					o_role_主角.称号 = "少林弃徒"
					G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
					return 
				else 
					G.call("对话系统_显示NPC对话","缘根",0x56020036,"老子看你天生就是欠揍的坯子！")
				end
			else 
			end
			G.call("场景系统_隐藏")
			G.call("场景系统_显示")
			if 5 <= int_计数 then 
				G.call("对话系统_显示NPC对话","玄苦",0x56020005,"你的刑期已满，可以离开这里了。")
				G.call("通用_变更人物属性","杀孽","设为",0)
				G.call("场景系统_切换剧本",{n = 0, "剧情_少林寺_日常"})
				return 
			else 
			end
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_武当派'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070001))
	if int_标记 == 0 then 
		G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_拜师"})
	elseif int_标记 == 1 then 
		int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070015))
		if G.call("通用_检查人物属性","等级",30,100) and int_标记 == 0 then 
			G.call("通用_设置全局标记",G.QueryName(0x10070001),2)
			G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_远征"})
		else 
			G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_日常"})
		end
	elseif int_标记 == 2 or int_标记 == 3 then 
		G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_远征"})
	elseif int_标记 == 4 then 
		G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_救难"})
	elseif int_标记 == 5 then 
		G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_掌门"})
	else 
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_武当派_拜师'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060019)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020021,0,120,"张三丰")
	G.call("场景系统_添加交互人物",0x5602002c,- 208,55,"宋远桥")
	G.call("场景系统_添加交互人物",0x5602002d,208,55,"俞岱岩")
	G.call("场景系统_添加交互人物",0x5602002f,- 208,- 49,"宋青书")
	G.call("场景系统_添加交互人物",0x5602002e,208,- 49,"张翠山")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "张三丰" then 
			G.call("对话系统_显示主角对话","晚辈仰慕贵派已久，近日得见武当张真人芝颜，实属万分荣幸。晚辈此行特来拜师学艺，恳请真人能收录晚辈于门下。")
			G.call("对话系统_显示NPC对话","张三丰",0x56020021,"本派择徒极严，若非品德，资质上佳者，是无缘入我门派的。")
			if G.call("通用_检查人物属性","侠义",50,nil) and G.call("通用_检查人物属性","悟性",60,nil) then 
				G.call("对话系统_显示NPC对话","张三丰",0x56020021,"我看少侠气宇轩昂，根骨结实。正是练武奇才。只是老道多年前已不再收徒，你可归入我第三弟子俞岱岩门下。")
				G.call("通用_变更人物属性","声望","增减",50)
				G.call("通用_变更人物属性","银两","增减",30)
				G.call("通用_变更人物属性","侠义","增减",6)
				o_role_主角.门派 = "武当派"
				o_role_主角.称号 = "武当派弟子"
				G.call("通用_设置全局标记",G.QueryName(0x10070001),1)
				G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_日常"})
				return 
			else 
				G.call("对话系统_显示NPC对话","张三丰",0x56020021,"武当门下无一不是品德资质上佳者。阁下与本门要求不合，还请另投名师。")
			end
		elseif string_标识名称 == "宋远桥" then 
			G.call("对话系统_显示NPC对话","宋远桥",0x5602002c,"我是恩师座下武当首席大弟子-宋远桥，若要拜师学艺，需获得恩师应允。这还要看你有没有福气了。")
		elseif string_标识名称 == "俞岱岩" then 
			G.call("对话系统_显示NPC对话","俞岱岩",0x5602002d,"在下是恩师座下武当第三弟子-俞岱岩，若要拜师学艺，需获得恩师应允。这还要看你有没有福气了。")
		elseif string_标识名称 == "宋青书" then 
			G.call("对话系统_显示NPC对话","宋青书",0x5602002f,"在下宋青书。家父是武当大弟子宋远桥。")
		elseif string_标识名称 == "张翠山" then 
			G.call("对话系统_显示NPC对话","张翠山",0x5602002e,"在下是恩师座下武当第五弟子-张翠山，若要拜师学艺，需获得恩师应允。这还要看你有没有福气了。")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_武当派_日常'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060019)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020021,0,120,"张三丰")
	G.call("场景系统_添加交互人物",0x5602002c,- 208,55,"宋远桥")
	G.call("场景系统_添加交互人物",0x5602002d,208,55,"俞岱岩")
	G.call("场景系统_添加交互人物",0x5602002f,- 208,- 49,"宋青书")
	G.call("场景系统_添加交互人物",0x5602002e,208,- 49,"张翠山")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "张三丰" then 
			G.call("对话系统_显示NPC随机对话","张三丰",0x56020021,{"武当武功在技击上专讲柔化，不以气力胜人，以静而制动，以慢而制快，以不变而因应万变，故在修炼上，也纯以养气为主。", "太极武事，外操柔软，内含坚刚，非有心之坚刚，实有心之柔软也", "人的一辈子精力有限，一门武功尚难精通，如再涉猎其他，最终定难有成就。", "练拳时，最忌用力，务使全身松开，气血贯注，日久自然练成内劲。这种内劲是很柔的，遇敌时，不含抵抗性，能随敌劲以为伸缩，所谓柔中而有弹性。"})
		elseif string_标识名称 == "宋远桥" then 
			G.call("对话系统_显示NPC随机对话","宋远桥",0x5602002c,{"我忝居武当首席大弟子，自然事事要做师弟及各位后辈的表率。", "我那儿子虽然不争气，但也是武当派第二代弟子中出类拔萃的人物了，呵呵。", "人的一辈子精力有限，一门武功尚难精通，如再涉猎其他，最终定难有成就。", "有的心法秘籍，研习到最高境界，就可悟出隐藏其中的深奥武功。"})
		elseif string_标识名称 == "俞岱岩" then 
			if not  G.call("通用_检查物品",G.QueryName(0x10060034)) then 
				G.call("对话系统_显示NPC对话","俞岱岩",0x5602002d,"你是我门下的第一个弟子，你一定要对自己高标准严要求，也为以后的师弟们起到表率作用。今天我先传你本门入门心法-《武当心法》")
				G.call("通知系统_显示系统提示","获得[04]《武当心法》")
				G.call("通用_变更物品数量",G.QueryName(0x10060034),1)
			elseif G.call("通用_检查秘籍",G.QueryName(0x10060034),5) and not  G.call("通用_检查物品",G.QueryName(0x10060038)) then 
				G.call("对话系统_显示NPC对话","俞岱岩",0x5602002d,"你眼下内力也有一定基础，可以修习本门轻功-梯云纵了。我现在就传授给你。")
				G.call("通知系统_显示系统提示","获得[04]《梯云纵》")
				G.call("通用_变更物品数量",G.QueryName(0x10060038),1)
			elseif G.call("通用_检查人物属性","等级",10,nil) and not  G.call("通用_检查武功",G.QueryName(0x1004000a),1) then 
				G.call("对话系统_显示NPC对话","俞岱岩",0x5602002d,"你入我门下也有一段时日，果然是块练武的好材料。今日我便传你武当入门拳法-绵掌！")
				G.call("通知系统_显示系统提示","习得[04]《绵掌》")
				G.call("通用_学会武功",G.QueryName(0x1004000a))
			else 
				G.call("对话系统_显示NPC对话","俞岱岩",0x5602002d,"你是我门下的第一个弟子，你一定要对自己高标准严要求，也为以后的师弟们起到表率作用。如果你的武学修为能有所进境，我会传你新的功夫。")
			end
		elseif string_标识名称 == "宋青书" then 
			G.call("对话系统_显示NPC对话","宋青书",0x5602002f,"本门武功需得勤学苦练方能有所成就。师弟，准备好跟我过招了吗？")
			int_选择 = G.call("对话系统_显示主角选项","",{"向师兄请教武功，请师兄手下留情。", "小弟哪里是师兄对手，日后再向师兄讨教。"})
			if int_选择 == 1 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_武当_宋青书",1)
				G.call("场景系统_显示")
			else 
			end
		elseif string_标识名称 == "张翠山" then 
			G.call("对话系统_显示NPC随机对话","张翠山",0x5602002e,{"我派入门内功有武当心法，拳术有绵掌，轻功有梯云纵。", "武当心法根基于武当九阳功，虽不能克敌制胜，但也可强身健体。", "有的心法秘籍，研习到最高境界，就可悟出隐藏其中的深奥武功。", "武当绵掌以柔克刚，借力打力，以虚御实。在当今各派武功中算是后发之人的武学。", "武当梯云纵，练到最深处，纵身一跃，半空中可以鸟为梯。"})
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_武当派_远征'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060019)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020021,0,120,"张三丰")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070001))
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "张三丰" then 
			if int_标记 == 2 then
				G.call("对话系统_显示NPC对话","张三丰",0x56020021,"现下各大门派联合起来围攻明教光明顶。武当派已派出一、二代弟子。你赶紧速上光明顶协助各门派。记住，对奸佞邪恶之辈不可心慈手软！")
				G.call("通用_设置全局标记",G.QueryName(0x10070001),3)
			elseif int_标记 == 3 then
				G.call("对话系统_显示NPC对话","张三丰",0x56020021,"现在形势非常紧张，你还不赶紧上光明顶救援？")
			else
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_武当派_救难'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060019)
	G.call("场景系统_添加静态人物",0x56020021,0,95,"张三丰",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","张三丰",0x56020021,"好孩子，你在光明顶威震群雄的事，我已经听说了。不错不错，想不到武当第三代弟子中，除了青书，还有你这样的杰出人才。看来武当有传人了。")
	G.call("对话系统_显示NPC对话","武当弟子",0x56020026,"启秉祖师爷，现在有上百名不知什么门派的人物，手持刀剑，硬闯上山来。说是要踏平武当山。来者武功奇强，师兄弟们伤亡惨重。请祖师爷定夺。")
	G.call("对话系统_显示NPC对话","张三丰",0x56020021,"现在远桥等人远征明教未返，敌人又在此时进攻，定是安排了许久，意欲一举灭掉我武当派。依大数而言，我武当派绝不会就此而亡。现在远桥等人不在，日后兴复本派的重任就交给你了！")
	G.call("对话系统_显示NPC对话","张三丰",0x56020021,"生死胜负，无足介怀，武当派的绝学却不可因此中断。我坐关十八月，得悟武学精要，一套太极拳和太极剑，此刻便传了你罢。我这套太极拳和太极剑，跟自来武学之道全然不同，讲究以静制动，后发制人……")
	G.call("通知系统_显示系统提示","习得 [04]太极拳[br][02]习得 [04]太极剑[br][02]获得 [04]真武剑",nil)
	G.call("通用_学会武功",G.QueryName(0x10040006))
	G.call("通用_学会武功",G.QueryName(0x10040017))
	G.call("通用_变更物品数量",G.QueryName(0x10060003),1)
	G.call("场景系统_隐藏")
	G.call("场景系统_移除人物","张三丰")
	G.call("场景系统_添加静态人物",0x56020021,- 182,60,"张三丰",nil)
	G.call("场景系统_添加静态人物",0x56020030,64,60,"赵敏",nil)
	G.call("场景系统_添加静态人物",0x56020031,163,- 55,"阿大",nil)
	G.call("场景系统_添加静态人物",0x56020032,163,60,"阿二",nil)
	G.call("场景系统_添加静态人物",0x56020033,163,175,"阿三",nil)
	G.call("通用_变更人物属性","生命","增减",9999)
	G.call("通用_变更人物属性","内力","增减",9999)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","赵敏",0x56020030,"晚辈乃绍敏郡主赵敏，今日得见武林中北斗之望，幸也何如！普天之下，莫非王土，率土之滨，莫非王臣。我蒙古皇帝威加四海，张真人若能效顺，皇上立颁殊封，武当派自当大蒙荣宠……")
	G.call("对话系统_显示主角对话","你不必再说下去了！你们自是有备而来，倘若我们不归顺元朝，那边要踏平武当山是不是？")
	G.call("对话系统_显示NPC对话","赵敏",0x56020030,"这位公子所言差异。武当派是武林的泰山北斗，晚辈怎敢如此狂妄！只是听闻武当绝学冠绝天下，我这有三个不成器的奴才，想要请张真人指点几招。张真人想必一定不会让晚辈失望的。")
	G.call("对话系统_显示主角对话","对付你们哪里用得到太师父动手。我来会会你这三个狗奴才，也一样会叫他们受益匪浅的。")
	G.call("对话系统_显示NPC对话","阿三",0x56020033,"小子自己找死，需怪不得别人。就让你领教领教我的少林金刚指力！")
	if int_选择 == 1 then 
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_武当_阿三",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
	else 
	end
	G.call("通知系统_显示系统提示","获得 [04]黑玉断续膏",nil)
	G.call("通用_变更物品数量",G.QueryName(0x10060017),3)
	G.call("对话系统_显示NPC对话","阿二",0x56020032,"小子当真邪门，竟然能打得过三弟，果然有两下子。拳脚算你厉害，不过我还要看看你的内功是否也有些火候！")
	G.call("对话系统_显示NPC对话","阿大",0x56020031,"二弟且慢！今日是郡主来武当山扬威来的，咱们已然输去一场，切不可大意了。我看此人拳掌凌厉，而且内功卓绝，你也不一定能伤得到他。我自信跟他比试一下剑术尚有六成胜算。这一场我来吧！")
	G.call("对话系统_显示NPC对话","阿二",0x56020032,"大哥既如此说，小弟也不说什么了。只是心里不服！")
	G.call("对话系统_显示NPC对话","阿大",0x56020031,"这位武当派的少侠，在下向你请教武当派的奥妙剑术！")
	if int_选择 == 1 then 
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_武当_阿大",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
	else 
	end
	G.call("对话系统_显示主角对话","赵姑娘，你手下奴才已经领教过我武当绝学，是否你也亲自下场领教一下才肯心服？")
	G.call("对话系统_显示NPC对话","赵敏",0x56020030,"虽说只是这几个不成器的奴才败了，但终究是我汝阳王府的人，近日我们认这个栽，日后再来拜会！")
	G.call("对话系统_显示主角对话","赵姑娘，你们私带兵器硬闯武当山，现在便想一走了之吗？")
	G.call("对话系统_显示NPC对话","阿二",0x56020032,"难道你们还想胁持郡主不成？小小武当山只需汝阳王调动一成的兵马，保管叫武当上下鸡犬不剩！")
	G.call("对话系统_显示NPC对话","赵敏",0x56020030,"张真人，后会有期！")
	G.call("场景系统_隐藏")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060019)
	G.call("场景系统_添加静态人物",0x56020021,0,95,"张三丰",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","张三丰",0x56020021,"想不到你的武艺已经精进如斯，而且悟性颇高，以深得我武当派真传。武当一派日后将由你来发扬光大！今日起，你便是武当派掌门！")
	G.call("对话系统_显示主角对话","徒孙自当尽心竭力发扬武当，使武当一脉，名垂千古！")
	G.call("通用_变更人物属性","声望","增减",150)
	o_role_主角.称号 = "武当掌门"
	G.call("通用_设置全局标记",G.QueryName(0x10070001),5)
	G.call("场景系统_切换剧本",{n = 0, "剧情_武当派_掌门"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_武当派_掌门'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060019)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020021,0,120,"张三丰")
	G.call("场景系统_添加交互人物",0x5602002c,- 208,55,"宋远桥")
	G.call("场景系统_添加交互人物",0x5602002d,208,55,"俞岱岩")
	G.call("场景系统_添加交互人物",0x5602002f,- 208,- 49,"宋青书")
	G.call("场景系统_添加交互人物",0x5602002e,208,- 49,"张翠山")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "张三丰" then 
			G.call("对话系统_显示NPC对话","张三丰",0x56020021,"我武当立派以来，多行侠义之举。论武功声望当和少林相提并论。但我年少时，曾得少林，峨嵋两派前辈的恩惠，因此我武当门下对这两大门派一定要倍加礼遇。")
		elseif string_标识名称 == "宋远桥" then 
			G.call("对话系统_显示NPC对话","宋远桥",0x5602002c,"参见掌门。")
		elseif string_标识名称 == "俞岱岩" then 
			G.call("对话系统_显示NPC对话","俞岱岩",0x5602002d,"参见掌门。")
		elseif string_标识名称 == "宋青书" then 
			G.call("对话系统_显示NPC对话","宋青书",0x5602002f,"参见掌门。")
		elseif string_标识名称 == "张翠山" then 
			G.call("对话系统_显示NPC对话","张翠山",0x5602002e,"参见掌门。")
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山派'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070002))
	if int_标记 == 0 then 
		if o_role_主角.门派 == "华山派" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_华山派_日常"})
		else 
			G.call("场景系统_切换剧本",{n = 0, "剧情_华山派_拜师"})
		end
	elseif int_标记 == 1 then 
		if G.call("通用_检查人物属性","等级",15,nil) then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_华山派_考验"})
		else 
			G.call("场景系统_切换剧本",{n = 0, "剧情_华山派_无人"})
		end
	elseif int_标记 == 2 then 
		G.call("场景系统_切换剧本",{n = 0, "剧情_华山派_终"})
	else 
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山派_拜师'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060008)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602000a,0,120,"岳不群")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "岳不群" then 
			G.call("对话系统_显示主角对话","晚辈慕名而来，诚心拜师学艺。肯求前辈能够收录门墙，晚辈一定恪遵教诲，严守门规，决不敢有丝毫违背师命。")
			if G.call("通用_检查人物属性","侠义",50,nil) then 
				G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"入我华山门下，需得尊师重道，师兄弟间互敬互爱。华山派是响当当的名门正派，日后你若与奸邪为伍，我第一个不饶你。")
				G.call("通知系统_显示系统提示","获得[04]《华山心法》")
				G.call("通用_变更物品数量",G.QueryName(0x10060032),1)
				G.call("通用_变更人物属性","声望","增减",50)
				G.call("通用_变更人物属性","银两","增减",30)
				G.call("通用_变更人物属性","侠义","增减",5)
				o_role_主角.门派 = "华山派"
				o_role_主角.称号 = "华山派弟子"
				G.call("场景系统_切换剧本",{n = 0, "剧情_华山派_日常"})
				return 
			else 
				G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"阁下似乎近来名声不大入耳，恕岳某不能接纳。阁下根骨精奇，投我华山门下，未免耽误阁下前程，请往他处另访名师。")
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山派_日常'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060008)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602000a,0,120,"岳不群")
	G.call("场景系统_添加交互人物",0x5602000b,- 208,55,"令狐冲")
	G.call("场景系统_添加交互人物",0x5602000c,208,55,"陆大有")
	G.call("场景系统_添加交互人物",0x5602000d,- 208,- 49,"梁发")
	G.call("场景系统_添加交互人物",0x5602000e,208,- 49,"岳灵珊")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "岳不群" then 
			if G.call("通用_检查秘籍",G.QueryName(0x10060032),5) and G.call("通用_检查人物属性","等级",10,nil) then 
				G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"近来我发现你内功精进不少，可见你资质不俗，若肯勤勉奋进，他日兴旺华山派的重任必定落在你肩上。我决定让你在思过崖闭关一段时间，而后传你华山绝学！")
				G.call("对话系统_显示主角对话","多谢师父尽心栽培，弟子此生难保师父大恩。闭关期间，弟子一定刻苦研修本门武学，将来一定将华山派发扬光大。")
				G.call("通用_设置全局标记",G.QueryName(0x10070002),1)
				G.call("场景系统_切换剧本",{n = 0, "剧情_华山派_思过"})
				return 
			else 
				int_选择 = G.call("对话系统_显示NPC选项","岳不群",0x5602000a,"",{"请教武功", "江湖掌故", "离开"})
				if int_选择 == 1 then 
					G.call("对话系统_显示NPC随机对话","岳不群",0x5602000a,{"华山武功讲究以气御剑，气功为本，剑术为末。", "华山剑法轻灵稳重兼而有之。", "“有凤来仪”是我派华山剑法的精髓，可同时制敌七处要害。", "紫霞秘籍的修炼需要以深厚的华山心法为基础，否则会使修炼者筋脉俱损，走火入魔。", "人的一辈子精力有限，一门武功尚难精通，如再涉猎其他，最终定难有成就。", "有的心法秘籍，研习到最高境界，就可悟出隐藏其中的深奥武功。", "寒冰真气是嵩山左掌门的独门秘籍，当年曾和任我行的吸星大法相抗衡。"})
					int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000d))
					if G.call("运算_随机数",1,7) <= 3 then 
						G.call("通用_设置全局标记",G.QueryName(0x1007000d),int_标记 + 1)
					else 
					end
				elseif int_选择 == 2 then 
					G.call("对话系统_显示NPC随机对话","岳不群",0x5602000a,{"青城派为了林家的《辟邪剑谱》，竟然灭掉福威镖局满门，余馆主做事未免太过歹毒。", "现任五岳盟主左冷禅武功深不可测，当年任我行来袭，只有左盟主一人能与之抗衡。", "自古正邪不容，凡我正派门下，遇到奸佞之徒切不可手软。", "采花大盗田伯光最近又出现在华山附近，此人轻功刀法俱是一流，你们要多加小心。", "华山派正宗武学讲究以气御剑，虽然我不禁你们涉猎其他武学，但是本门宗旨不可忘却。", "近几年各个邪教林立而起，正派虽然人数众多，但是魔教武功诡异歹毒，一时间正邪僵持不下。", "魔教的吸星大法为邪派武功之冠，能够吸纳旁人内力为己用。稍次一些的叫化功大法。"})
				else 
				end
			end
		elseif string_标识名称 == "令狐冲" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000e))
			if int_标记 == 0 then 
				G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"你是师父新收的小师弟吧。一看就是了不起的英雄少年。你爱喝酒不？常言：酒逢知己千杯少。华山上下没有一个能陪我喝酒的真扫兴。")
				G.call("通用_设置全局标记",G.QueryName(0x1007000e),1)
			elseif int_标记 == 1 then 
				G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"最近酒瘾又上来了，师父管得严，有日子没尝到酒味了。小师弟，能不能劳烦你下山帮我买一瓶[04]关外白酒[02]？")
				G.call("通用_设置全局标记",G.QueryName(0x1007000e),2)
			elseif int_标记 == 2 then 
				if G.call("通用_检查物品",G.QueryName(0x10060027)) then 
					G.call("通用_变更物品数量",G.QueryName(0x10060027),- 1)
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"果然是好兄弟，难得你能觅来这[04]关外白酒[02]，只可惜有好酒，却无好器皿，可惜啊可惜。")
					G.call("通用_设置全局标记",G.QueryName(0x1007000e),3)
				else 
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"不知道我什么时候才能喝道心仪的美酒阿。")
				end
			elseif int_标记 == 3 then 
				if G.call("通用_检查物品",G.QueryName(0x10060028)) then 
					G.call("通用_变更物品数量",G.QueryName(0x10060028),- 1)
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"看来你比六师弟还了解我。这坛[04]关外白酒[02]，酒味是极好的，只可惜少了一股芳冽之气，最好就是用这[04]犀角杯[02]盛之而饮。那就醇美无比。只可惜比之[04]葡萄酒[02]似乎略逊。")
					G.call("通用_设置全局标记",G.QueryName(0x1007000e),4)
				else 
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"不知道我什么时候才能喝道心仪的美酒阿。")
				end
			elseif int_标记 == 4 then 
				if G.call("通用_检查物品",G.QueryName(0x10060029)) then 
					G.call("通用_变更物品数量",G.QueryName(0x10060029),- 1)
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"古人诗云：葡萄美酒夜光杯，欲饮琵琶马上催。葡萄美酒盛入[04]夜光杯[02]之后，酒色便与鲜血一般无异，饮酒有如饮血。岳武穆词云：壮志饥餐胡虏肉，笑谈渴饮匈奴血。岂不壮哉！")
					G.call("通用_设置全局标记",G.QueryName(0x1007000e),5)
				else 
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"不知道我什么时候才能喝道心仪的美酒阿。")
				end
			elseif int_标记 == 5 then 
				if G.call("通用_检查物品",G.QueryName(0x1006002a)) then 
					G.call("通用_变更物品数量",G.QueryName(0x1006002a),- 1)
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"师弟果然深得我心！难得咱们师兄弟这么投缘，礼尚往来，让我想想做师兄的该拿什么回报你。")
					G.call("通用_设置全局标记",G.QueryName(0x1007000e),6)
					if G.call("通用_检查人物属性","悟性",60,nil) and G.call("通用_检查人物属性","御剑",28,nil) then 
						G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"我当年曾经跟一位高人学过一套剑法，叫[04]独孤九剑[02]。今天我就传给你吧。")
						G.call("通用_学会武功",G.QueryName(0x10040019))
					else 
						G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"我当年曾经跟一位高人学过一套极高明的剑法，但是你剑术造诣有限，现在无法领会。我就传给你一些[04]无招胜有招[02]的心得吧。")
						G.call("通用_变更人物属性","身法","增减",20)
						G.call("通用_变更人物属性","拳掌","增减",20)
						G.call("通用_变更人物属性","御剑","增减",20)
						G.call("通用_变更人物属性","暗器","增减",20)
					end
				else 
					G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"不知道我什么时候才能喝道心仪的美酒阿。")
				end
			else 
				G.call("对话系统_显示NPC对话","令狐冲",0x5602000b,"不知道我什么时候才能喝道心仪的美酒阿。")
			end
		elseif string_标识名称 == "陆大有" then 
			G.call("对话系统_显示NPC随机对话","陆大有",0x5602000c,{"师父人称君子剑，修为高深莫测。想了解门规和江湖逸闻，可向他老人家请教。", "大师兄令狐冲是我派出类拔萃的人物，剑术内功十分了得，只是嗜酒如命。", "三师兄梁发，专门负责指导新进本门的师弟们的武功，平时可向想他切磋切磋。", "我嘛，他们叫我六猴儿，什么本事没有。我最钦佩的人就是大师哥了。", "小师妹可是师父的掌上明珠，大家都很让得她。你可别得罪她，有大师兄罩着她呢。", "本门绝学是紫霞神功，但是因为我们内功修为不足，无缘修炼。", "大师兄最爱喝酒，一般城里就有卖的，你代我买来孝敬大师兄吧。"})
		elseif string_标识名称 == "梁发" then 
			G.call("对话系统_显示NPC对话","梁发",0x5602000d,"本门武功需得勤学苦练方能有所成就。师弟，准备好跟我过招了吗？")
			int_选择 = G.call("对话系统_显示主角选项","",{"向师兄请教武功，请师兄手下留情。", "小弟哪里是师兄对手，日后再向师兄讨教。"})
			if int_选择 == 1 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_华山_梁发",1)
				G.call("场景系统_显示")
			else 
			end
		elseif string_标识名称 == "岳灵珊" then 
			if G.call("运算_随机数",1,5) == 1 then 
				G.call("对话系统_显示NPC对话","岳灵珊",0x5602000e,"喂，今天我闷的紧了，你陪我练练招！你要是敢不尽力，我就告诉爹说你武功退步了。")
				if true then 
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_华山_岳灵珊",1)
					G.call("场景系统_显示")
					int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000f))
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("对话系统_显示NPC对话","岳灵珊",0x5602000e,"不错不错，虽然你武功很差劲，但是在我这个英明神武的师姐领导和呵护下，你总有一天会出人头地的。")
						int_标记 = int_标记 + 1
					else 
						G.call("对话系统_显示NPC对话","岳灵珊",0x5602000e,"臭师弟！你敢这么用力打我！你是想杀死我吗？！我去向爹告状去！")
						int_标记 = int_标记 - 5
						if int_标记 < 10 then 
							int_标记 = 0
						else 
						end
					end
					G.call("通用_设置全局标记",G.QueryName(0x1007000f),int_标记)
				else 
				end
			else 
				G.call("对话系统_显示NPC随机对话","岳灵珊",0x5602000e,{"别看你人高马大的，入到华山门下还得管我教一声“师姐”！", "你要是把我哄高兴了，日后我自然会罩着你的，华山上下没人会欺负你。", "爹爹一点不懂得女儿的心思，每次买的胭脂水粉全是次品。", "我娘昨天又教了我几招“玉女十九剑”，也不知威力怎么样。"})
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山派_思过'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060009)
	G.call("场景系统_显示指令按钮",{"休息"})
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","在这里呆着真是无聊，又无人可以练招。没事还是多休息休息，养精蓄锐吧。")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "休息" then 
			G.call("场景系统_休息")
			break
		else 
		end
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "休息" then 
			G.call("场景系统_休息")
			break
		else 
		end
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "休息" then 
			G.call("场景系统_休息")
			break
		else 
		end
	end
	G.call("对话系统_显示主角对话","噫？这里的石壁似乎有些怪异。上面怎么刻了这么多小人，倒象是远古洞穴人的壁画。说不定这里大有文章，我得好好研究研究。")
	if G.call("通用_检查人物属性","悟性",71,100) then 
		G.call("对话系统_显示主角对话","看出来了！！！原来石壁上刻的是一套极高明的武功。不过似乎这套武功似是专为克制我五岳剑派的武功而制。")
		G.call("通知系统_显示系统提示","悟出 [04]五岳剑法",nil)
		G.call("通用_学会武功",G.QueryName(0x10040015))
		G.call("通用_变更人物属性","御剑","增减",3)
	else 
		G.call("对话系统_显示主角对话","实在看不出来。肯定是上一位来这里的本派前辈在这里呆着无聊时，随手瞎画的。")
	end
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000b))
	if 5 <= int_标记 then 
		G.call("场景系统_添加静态人物",0x56020007,0,95,"田伯光",nil)
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"哈哈哈哈~~~~[br]好兄弟，一个人在这思过崖上闷得狠吧。")
		G.call("对话系统_显示主角对话","原来是田兄来了！你怎么会找到这来的？师父和几位别派的掌门师伯都欲除你而后快，你还竟然敢冒险来到这里？")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"还不是为了来看我的好兄弟。放心吧，我已经使计策把你师父暂时调开了华山。今天你尽管和我一醉方休，不用担心有人会来管你的。")
		G.call("对话系统_显示主角对话","恐怕田兄此来不是为了跟兄弟喝酒这么简单吧。要是这酒喝的不明不白，那可没趣的很。")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"实不相瞒。我今天来是想兄弟救我一命。")
		G.call("对话系统_显示主角对话","田兄武功比我高明太多了，我怎么能够救你的性命。")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"你还记得当日你在衡阳救的那位衡山小师父吗？ 只因为你当时豪气冲天英雄救美，使得这位清修多年的小师父竟然动了凡心。")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"按理说，兄弟少年才俊，小师父少女怀春，发生这种事也不足为奇。可是小师父碍于身份门规之限，不敢言明。最终相思日苦，人也削瘦了下来。我此番前来，就是想请兄弟随我下山见一见小师父，以解她的相思之苦。")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"我总觉得这事对你来说也没什么亏损，想必你一定不会拒绝吧。")
		G.call("对话系统_显示主角对话","请田兄言语间自重。说我什么没有关系，万万不可诋毁恒山小师父的清誉！")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"呦！我倒忘记，你已入了华山门下，自然对我这等粗胚的言语听不入耳。实话告诉你，我是受人之托，请你下山去，而且被那人点了死穴，现在只你能救我。")
		G.call("对话系统_显示主角对话","田兄，当日衡阳我敬你是条汉子，又谢你不杀之恩，所以与你结义。今日我已是正派弟子，若田兄还念结义之情，就赶快下山吧。如果被别人撞到，我可保不了你。")
		G.call("对话系统_显示NPC对话","田伯光",0x56020007,"奶奶的！我不管了！我就快毒发身亡了，我会用十成功力尽快解决战斗。你可要留神了！")
		G.call("对话系统_显示主角对话","那你就来试试看啊！我已经不是当年那个初出江湖的毛头小子了！")
		if G.call("通用_检查人物属性","悟性",90,100) then 
			if G.call("通用_检查人物属性","福缘",80,100) then 
				if not  G.call("通用_检查武功",G.QueryName(0x10040019),1) then 
					G.call("场景系统_添加静态人物",0x56020010,131,130,"风清扬",nil)
					G.call("对话系统_显示NPC对话","风清扬",0x56020010,"呵~呵~呵~[br]好狂妄的田伯光，敢到华山来撒野，你可真是胆大！ 你是华山岳不群那小子新近收来的弟子吧。")
					G.call("对话系统_显示主角对话","请问前辈是哪一位？")
					G.call("对话系统_显示NPC对话","风清扬",0x56020010,"岳不群这小子！武功还勉强说得过去，可就是不会教徒弟。像你这样的一块良质美玉竟然被他雕成了一块废石。")
					G.call("对话系统_显示NPC对话","风清扬",0x56020010,"本来我不便插手华山气宗的事，可是又不忍心把前辈们的绝艺带进棺材里。你过来闭上眼睛！")
					G.call("场景系统_隐藏")
					G.call("场景系统_移除人物","风清扬")
					G.call("场景系统_显示")
					G.call("通知系统_显示系统提示","习得 [04]独孤九剑",nil)
					G.call("通用_学会武功",G.QueryName(0x10040019))
					G.call("通用_变更人物属性","御剑","增减",5)
					G.call("通用_变更人物属性","身法","增减",10)
					G.call("对话系统_显示主角对话","多谢前辈授艺之恩！[br]咦？？？ 前辈怎么不见了？")
					G.call("对话系统_显示NPC对话","田伯光",0x56020007,"奶奶的！从哪冒出的糟老头，竟然敢点我的昏睡穴。喂！耽搁了这么久，我已经等不及了。你小心了！")
				else 
				end
			else 
			end
		else 
		end
		if true then 
			G.call("场景系统_隐藏")
			enum_战斗结果_战斗结果 = G.call("战斗_华山_田伯光")
			if enum_战斗结果_战斗结果 == 0 then 
				G.call("通用_显示结束菜单")
				return 
			else 
			end
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","田伯光",0x56020007,"好好好。没想到你投到华山门下，学了这么高明的武艺。你既然不顾念我的死活，那么，今日起你我兄弟之情结束了。田某告辞！")
			G.call("对话系统_显示主角对话","田兄请见谅。可否告知点你死穴那人的名讳？改日我向他老人家当面求情，给你解穴。")
			G.call("对话系统_显示NPC对话","田伯光",0x56020007,"罢了，罢了。田某贱命一条，不足为大侠操心了。")
			G.call("场景系统_移除人物","田伯光")
		else 
		end
	else 
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "休息" then 
			G.call("场景系统_休息")
			break
		else 
		end
	end
	G.call("场景系统_添加静态人物",0x5602000c,0,95,"陆大有",nil)
	G.call("对话系统_显示NPC对话","陆大有",0x5602000c,"恭喜师弟，贺喜师弟！")
	G.call("对话系统_显示主角对话","原来是六师兄！我有什么喜阿？")
	G.call("对话系统_显示NPC对话","陆大有",0x5602000c,"师父已打算明日把《紫霞秘籍》传给你了。我们都没有这个福分。以后师兄的武功可还要靠你多多指点呢。")
	G.call("对话系统_显示主角对话","师兄太客气了。我一定不会忘记师兄对我的好处的。")
	G.call("场景系统_移除人物","陆大有")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "休息" then 
			G.call("场景系统_休息")
			break
		else 
		end
	end
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000d))
	if 10 < int_标记 then 
		G.call("场景系统_添加静态人物",0x5602000a,0,95,"岳不群",nil)
		G.call("对话系统_显示NPC对话","姓名",0x5602000a,"本来我打算亲自指导你修炼这门心法，但是最近一段时间，为师要和众师兄弟去一趟嵩山。你在这里可以安心修炼，将来学有所成，也好为我华山派争光添彩。")
		G.call("对话系统_显示主角对话","多谢师父！")
		G.call("场景系统_移除人物","岳不群")
		G.call("通知系统_显示系统提示","获得 [04]《紫霞秘籍》",nil)
		G.call("通用_变更物品数量",G.QueryName(0x10060033),1)
	else 
		int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000f))
		if 10 < int_标记 then 
			G.call("场景系统_添加静态人物",0x5602000e,0,95,"岳灵珊",nil)
			G.call("对话系统_显示NPC对话","岳灵珊",0x5602000e,"呵呵，你这个懒鬼竟然才起！最近一段时间，我跟爹和众师兄弟要去一趟嵩山。这《紫霞秘籍》是我偷偷拿来的，希望你这段日子能刻苦研习，勿辜负我的一番苦心")
			G.call("对话系统_显示主角对话","多谢师姐，我一定终身不忘师姐的大恩大德。")
			G.call("场景系统_移除人物","岳灵珊")
			G.call("通知系统_显示系统提示","获得 [04]《紫霞秘籍》",nil)
			G.call("通用_变更物品数量",G.QueryName(0x10060033),1)
		else 
			G.call("对话系统_显示主角对话","这么晚了，师父怎么还没来，不会遇到什么麻烦了吧。")
			G.call("场景系统_添加静态人物",0x5602000c,0,95,"陆大有",nil)
			G.call("对话系统_显示NPC对话","陆大有",0x5602000c,"师弟阿，今天起得这么早，昨晚兴奋的没睡好觉吧。我给你带来一个好消息，一个坏消息，你想先听哪一个？")
			G.call("对话系统_显示主角对话","师兄您就别逗了，先告诉我有什么好消息吧。")
			G.call("对话系统_显示NPC对话","陆大有",0x5602000c,"好消息是：昨晚师父接到左盟主令牌，需到嵩山议事，这一走就是至少十数天，你可就轻松了，这些天不会有人来管教你了。")
			G.call("对话系统_显示主角对话","确实不错，但是总觉得什么地方很不对劲似的。那坏消息呢？")
			G.call("对话系统_显示NPC对话","陆大有",0x5602000c,"坏消息是：我们也都跟师父下山，这些日子就没人给你送饭了。你可能要饿几天肚子了……")
			G.call("对话系统_显示主角对话","呼，原来就是这回事啊。我还以为是什么大不了的呢。")
			G.call("对话系统_显示NPC对话","陆大有",0x5602000c,"师父还说，因为走得匆忙，所以等他回来，有时间再传授你《紫霞秘籍》。让你这些日子，千万不要把功夫荒废了。师父意思我已传达到了，师弟你好自为之吧，我也要马上去追上师父他们了。")
			G.call("对话系统_显示主角对话","……（说话不算数！这师父也真不地道！）[br]现在大家都走了，我在这里实在憋屈得很，我得下山活动活动去。")
			G.call("场景系统_移除人物","陆大有")
		end
	end
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山派_无人'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060008)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	if G.call("场景系统_检查能否触发事件") then
		G.call("对话系统_显示主角对话","华山派现在只有我一人，呆着也是无聊，还是离开吧。")
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "休息" then 
			G.call('场景系统_休息')
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山派_考验'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060008)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602000a,0,120,"岳不群")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "岳不群" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070002))
			if 1 < int_标记 then 
				G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"但愿你没有辜负我对你的期望。来，进招！")
				G.call("对话系统_显示主角对话","请师父赐教！")
				if true then 
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_华山_岳不群",1)
					G.call("场景系统_显示")
					if enum_战斗结果_战斗结果 == 1 then 
						G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"看来你已大大超出我的期望，很好很好。这次我们嵩山之行得到一个消息：嵩山左盟主野心勃勃，意欲兼并我们五月剑派。他提出要要举行“五岳并派大会”，届时一定会引起各大门派的不满，最终可能还是要以武功定胜")
						G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"负。看你武功精进如斯，将来定能传我衣钵。这次的“五岳并派大会”，华山派的希望可就全指望你了。我们一定要阻止左冷禅合并五岳剑派！")
						G.call("对话系统_显示主角对话","弟子一定粉身碎骨全力而为，请师父放心。")
						G.call("通用_变更人物属性","生命","增减",9999)
						G.call("通用_变更人物属性","内力","增减",9999)
						G.call("场景系统_切换剧本",{n = 0, "剧情_五岳并派"})
						return 
					else 
						G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"看来你的武功退步不少，着实叫我很失望。")
					end
				else 
				end
			else 
				G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"在我们离开华山的日子里，你的武功是否有所进境？待你准备好后，过来找我考验你的武功。")
				G.call("通用_设置全局标记",G.QueryName(0x10070002),2)
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山派_终'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060008)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602000a,0,120,"岳不群")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "岳不群" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070010))
			if int_标记 == 1 then 
				G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"五岳掌门驾临，岳某未曾远迎，当面赎罪。")
			else 
				G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"哈哈哈，从今往后，我便是五岳派掌门。早晚我要做得武林盟主，叫少林，武当也臣服在我岳某的脚下。哈哈哈，千秋万载，一统江湖……")
				G.call("对话系统_显示主角对话","以前师父宛如谦谦君子，与世不争。师父自从当上五岳派掌门，整日便如同着了魔似的，竟妄想统一江湖，这还是当初我那个可敬可佩的华山掌门吗？")
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_五岳并派'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606002a)
	G.call("场景系统_添加交互人物",0x56020025,0,120,"左冷禅")
	G.call("场景系统_添加交互人物",0x5602000a,- 208,55,"岳不群")
	G.call("场景系统_添加交互人物",0x56020023,208,55,"定逸师太")
	G.call("场景系统_添加交互人物",0x5602004f,- 208,- 49,"莫大")
	G.call("场景系统_添加交互人物",0x5602002a,208,- 49,"玉机子")
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"众位朋友瞧得起左某，惠然驾临嵩山，在下感激不尽。众位朋友来此之前，想必已然风闻，今日乃是我五岳剑派协力同心，归并为一派的好日子。")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"想我五岳剑派向来同气连枝，百余年来携手结盟，早便如同一家，兄弟忝为五派盟主，亦已多历年所。")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"只是近年来武林中出了不少大事，兄弟与五岳剑派的前辈师兄们商量，均觉若非联成一派，统一号令，则来日大难，只怕不易抵挡。")
	G.call("对话系统_显示NPC对话","莫大",0x5602004f,"不知左盟主和哪一派的前辈师兄们商量过了？怎地我莫某人不知其事？")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"兄弟适才说道，武林中出了不少大事，五派非合而为一不可，其中一件大事，便是咱们五派中人，自相残杀戕害，不顾同盟义气。")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"莫大先生，我嵩山派弟子大嵩阳手费师弟，在衡山城外丧命，有人亲眼目睹，说是你莫大先生下的毒手，不知此事可真？")
	G.call("对话系统_显示NPC对话","莫大",0x5602004f,"并无其事！谅莫某这一点儿微末道行，怎杀得了大嵩阳手？")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"莫大先生，你我均是一派之主，当知大事为重，私怨为轻。只要于我五派有利，个人的恩怨也只好搁在一旁了。")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"莫兄，这件事你也不用太过担心，费师弟是我师弟，等我五派合并之后，莫兄和我也是师兄弟了。死者已矣，活着的人又何必再逞凶杀，多造杀孽？莫兄，你说是不是呢？")
	G.call("对话系统_显示NPC对话","莫大",0x5602004f,"哼！")
	G.call("对话系统_显示NPC对话","玉机子",0x5602002a,"在下玉玑子，新任泰山派掌门。泰山派全派尽数赞同并派，有人妄持异议，泰山全派誓不与之干休。")
	G.call("对话系统_显示NPC对话","武林豪客",0x5602003b,"泰山派掌门之前是天门道长。天门似乎对并派大持异议，因而遭到他人暗害。最后不知为何是他这名声狼藉的师弟接任了掌门。这倒像是精心策划的阴谋！")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"我五岳剑派之中，衡山，泰山两派，已然赞同并派之议，看来这是大势所趋，既然并派一举有百利而无一害，我嵩山派自也当追随众位之后，共襄大举。")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"五派之中，已有三派同意并派，不知华山派意下如何？")
	G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"在下深觉武林中的宗派门户，分不如合。千百年来，江湖上仇杀斗殴，不知有多少武林同道死于非命，推原溯因，泰半是因门户之见而起。")
	G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"在下常想，倘若武林之中并无门户宗派之别，天下一家，人人皆如同胞手足，那么种种流血惨剧，十成中至少可以减去九成。英雄豪杰不致盛年丧命，世上也少了许许多多无依无靠的孤儿寡妇。")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"如此说来，华山派也同意并派。似乎并派大局已定，但是左某身为五岳盟主，一定会秉公处事。现下听听恒山派的高见。")
	if o_role_主角.称号 == "恒山掌门" then 
		G.call("对话系统_显示主角对话","岳先生见地果然高明。既然并派对于武林稳定有某大好处，我恒山派也自当鼎力支持。")
		G.call("对话系统_显示主角对话","然而五岳并派可不比五岳同盟，此次所推五岳派的掌门也必然要德高望重并且武艺精湛。恒山派提议比剑夺帅！")
	else 
		G.call("对话系统_显示NPC对话","定逸师太",0x56020023,"岳先生见地果然十分高明。既然并派对于武林稳定有某大好处，我恒山派也自当鼎力支持。")
		G.call("对话系统_显示NPC对话","定逸师太",0x56020023,"然而五岳并派可不比五岳同盟，此次所推五岳派的掌门也必然要德高望重并且武艺精湛。恒山派提议比剑夺帅！")
	end
	G.call("对话系统_显示NPC对话","武林豪客",0x5602003b,"好噢！好噢！比剑夺帅！谁武功高谁做掌门！")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"大家既然同意比剑夺帅，那就各门派相互切磋一下，点到为止，切不可伤及性命。最后胜出者即为五岳派掌门！")
	G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"比剑夺帅现在开始！第一场！")
	G.call("场景系统_隐藏")
	if o_role_主角.门派 == "华山派" then 
		enum_战斗结果_战斗结果 = G.call("战斗_嵩山_弟子")
	else 
		enum_战斗结果_战斗结果 = G.call("战斗_嵩山_岳灵珊")
	end
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"第二场开始！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_嵩山_玉机子")
		if enum_战斗结果_战斗结果 == 1 then 
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"想不到最近武林中新人辈出。凭你的年龄，能有今日的修为也实属不易。不过你若痴心妄想做五岳掌门，还需要问我同意不同意！")
			G.call("对话系统_显示主角对话","今日我不与你做口舌之争。左先生，请赐招吧！")
			G.call("场景系统_隐藏")
			enum_战斗结果_战斗结果 = G.call("战斗_嵩山_左冷禅")
		else 
		end
	else 
	end
	if enum_战斗结果_战斗结果 == 1 then 
		G.call("场景系统_显示")
		G.call("对话系统_显示主角对话","多谢左先生承让！")
		G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"哼！")
		G.call("对话系统_显示NPC对话","武林豪客",0x5602003b,"好噢！好噢！[姓名]是五岳派掌门！恭喜掌门！五岳派自此定会发扬光大！前途无量！")
		G.call("对话系统_显示主角对话","既是众位抬爱，在下也不敢推辞。五岳派今日新创，百废待举，在下只能总领其事。各派事务还需由原来的各派掌门进行主持。")
		G.call("对话系统_显示主角对话","咱们五岳剑派今日合派，若不和衷同济，那么五派合并云云，也只有虚名而已。大家今后都是份属同门，再也休分彼此。")
		G.call("对话系统_显示主角对话","在下无德无能，暂且执掌本门门户，种种兴革，还须和众位兄弟从长计议，在下不敢自专。现下天色已晚，各位都辛苦了，便请到嵩山本院休息，喝酒用饭！")
	else 
		G.call("场景系统_清空")
		-- G.call("场景系统_显示")
		G.call("通知系统_显示全屏字幕", "    嵩山封禅台上的比剑夺帅仍在继续着……[br]    虽然事先已经言明是点到为止，但是越到最后，参加比试的越是功力高深，稍有失手，对方就是非死就重伤。左冷禅却视而不见，似对如此伤亡早在预料之中。[br]    华山派掌门岳不群力挫其他门派掌门，最终与左冷禅逐决这五岳掌门之位。[br]    岳不群在原本势均力敌的情况下，突然使出以诡异莫名的剑法，刺瞎了左冷禅的双眼，获得比剑夺帅的最终胜利，成为五岳派第一任掌门！", 10000)
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_黑木崖'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070016))
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_显示主界面",true)
	if int_标记 == 0 or int_标记 == 1 then 
		G.call("场景系统_设置背景图片",0x56060023)
		G.call("场景系统_添加交互人物",0x56020042,0,120,"风雷堂主")
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
	elseif int_标记 == 2 then 
		G.call("场景系统_设置背景图片",0x56060024)
		G.call("场景系统_添加交互人物",0x56020043,0,120,"向问天")
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
	elseif int_标记 == 3 or int_标记 == 4 then 
		G.call("场景系统_设置背景图片",0x56060025)
		G.call("场景系统_添加交互人物",0x56020044,0,120,"任我行")
		G.call("场景系统_显示指令按钮",{"休息", "离开"})
		G.call("场景系统_显示")
	elseif int_标记 == 5 then 
		G.call("场景系统_设置背景图片",0x56060025)
		G.call("场景系统_添加交互人物",0x56020042,0,120,"风雷堂主")
		G.call("场景系统_显示指令按钮",{"休息", "离开"})
		G.call("场景系统_显示")
	elseif int_标记 == 6 then 
		G.call("场景系统_设置背景图片",0x56060023)
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
		if G.call("场景系统_检查能否触发事件") then
			G.call("对话系统_显示主角对话","上百年的日月神教毁于一旦，真是武林之福。")
		end
	else 
		G.call("场景系统_设置背景图片",0x56060023)
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "风雷堂主" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070016))
			if int_标记 == 5 then 
				G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"属下参见文成武德，仁义英明圣教主.教主中兴圣教，泽被苍生，千秋万载，一统江湖。")
			elseif int_标记 == 1 then 
				if G.call("通用_检查武功",G.QueryName(0x10040009),10) then 
					G.call("通用_设置全局标记",G.QueryName(0x10070016),2)
					o_role_主角.称号 = "惊涛堂堂主"
					G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"不错不错。你已经顺利通过测试。教主荣升你为惊涛堂堂主.以后神教护法右使向问天将成为你的直系领导。有事情他会跟你直接安排。")
					G.call("场景系统_隐藏")
					G.call("通用_停止所有声音")
					G.call("场景系统_清空")
					G.call("场景系统_显示主界面",true)
					G.call("场景系统_设置背景图片",0x56060024)
					G.call("场景系统_添加交互人物",0x56020043,0,120,"向问天")
					G.call("场景系统_显示指令按钮",{"离开"})
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","向问天",0x56020043,"听说你就是最近升上来的惊涛堂堂主.果然年少有为。十年前神教十长老毙命华山，神教元气大损，所以才不拘一格破例提拔人才。若是十年前，你坐到这个位子，起码要二三十年。")
					G.call("对话系统_显示NPC对话","向问天",0x56020043,"你现在功力浅薄而且声望低微，叫我如何向教主推荐你。去江湖上闯荡一番再来吧。")
				else 
					G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"你去勤加练习，等你武功练到一定程度，我自然会提拔你。练好武功，才能更好的为教主尽心办事。")
				end
			else 
				if G.call("通用_检查物品",G.QueryName(0x1006002b)) then 
					G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"神教认令不认人，你手中持有黑木令，可以直接去见杨总管。")
					G.call("对话系统_显示主角对话","怎么是杨总管，不是教主姓任吗？属下有左右护法，六堂堂主.什么时候有了杨总管？")
					G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"任教主早已经传位给了文成武德，仁义英明圣教主东方不败了。杨总管是教主最宠信的人。")
					G.call("场景系统_隐藏")
					G.call("通用_停止所有声音")
					G.call("场景系统_清空")
					G.call("场景系统_设置背景图片",0x56060025)
					G.call("场景系统_添加静态人物",0x56020045,- 108,95,"杨莲亭",nil)
					G.call("场景系统_添加静态人物",0x56020046,108,95,"东方不败",nil)
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","杨莲亭",0x56020045,"你是什么人？教中没你这个人物，从哪里得到的黑木令，你一定是奸细！来人，拖下去处斩！")
					G.call("对话系统_显示主角对话","不要以为你有东方不败罩着你就没人敢动你，今天要拿你开杀戒。")
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_黑木崖_杨莲亭",1)
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("通用_显示结束菜单")
						return 
					else 
					end
					G.call("通用_变更人物属性","杀孽","增减",1)
					G.call("场景系统_移除人物","杨莲亭")
					G.call("场景系统_移除人物","东方不败")
					G.call("场景系统_添加静态人物",0x56020046,0,95,"东方不败",nil)
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","东方不败",0x56020046,"大侠不要杀我啊，我是被迫假扮东方教主的。你不要杀我啊，我是无辜的。")
					G.call("场景系统_变色",255.0)
					G.call("场景系统_移除人物","东方不败")
					G.call("场景系统_添加静态人物",0x56020047,0,95,"东方不败",nil)
					G.call("场景系统_显示")
					G.call("对话系统_显示主角对话","你是什么人？")
					G.call("对话系统_显示NPC对话","东方不败",0x56020047,"你好大的胆子！竟敢伤害我的莲弟，今日叫你死无葬身之地！")
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_黑木崖_东方不败",1)
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("通用_显示结束菜单")
						return 
					else 
					end
					G.call("通用_变更人物属性","杀孽","增减",1)
					G.call("场景系统_移除人物","东方不败")
					G.call("场景系统_显示主界面",true)
					G.call("场景系统_显示指令按钮",{"离开"})
					G.call("场景系统_显示")
					G.call("对话系统_显示主角对话","想不到东方不败一代枭雄，竟然半男半女，武功虽然高强，活着做人又有什么意味。今日我挑了这万恶的日月神教，也算是为江湖造福了。")
					G.call("通用_设置全局标记",G.QueryName(0x10070016),6)
				else 
					G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"小子，你是新来报到的吧。一入神教，生为神教人，死为神教鬼。终生对教主忠心不二，若有违背，身受万虫食脑之苦！你决定加入神教吗？")
					int_选择 = G.call("对话系统_显示主角选项","",{"在下心仪神教已久，能入神教是毕生的心愿。", "暂时没有打算加入神教。"})
					if int_选择 == 1 then 
						G.call("通用_设置全局标记",G.QueryName(0x10070016),1)
						o_role_主角.门派 = "日月教"
						o_role_主角.称号 = "日月教教徒"
						G.call("通用_变更人物属性","声望","增减",50)
						G.call("通用_变更人物属性","侠义","增减",-25)
						G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"不管你之前在江湖上是多么风光，来到神教也必须从一名普通教众开始做起。只要对本教尽忠，奋不顾身完成教主分下的任务，早晚会升到教中高位上的。")
						G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"先传你一套入门掌法。这套掌法曾是铁掌帮的高级武功，但是经我日月神教的高手改良之后，成为新人入教的必修掌法。如果有毅力能将此掌法练到最高境界，就算是通过了新人的入教考验。")
						G.call("通用_学会武功",G.QueryName(0x10040009))
						G.call("通知系统_显示系统提示","习得 [04]铁掌")
						G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"你去勤加练习，等你武功练到一定程度，我自然会提拔你。练好武功，才能更好的为教主尽心办事。")
					else 
						G.call("对话系统_显示NPC对话","风雷堂堂主",0x56020042,"当这里是消遣的地方吗？想要命的话不要在这里胡闹！")
					end
				end
			end
		elseif string_标识名称 == "向问天" then 
			if G.call("通用_检查人物属性","等级",30,nil) then 
				G.call("对话系统_显示NPC对话","向问天",0x56020043,"你最近功力突飞猛进，而且又在江湖上为我神教创出了很大的名堂，教主他老人家听说后，打算召见你，你一定要好好表现，说不定会得到教主的重用。")
				G.call("场景系统_隐藏")
				G.call("通用_停止所有声音")
				G.call("场景系统_清空")
				G.call("场景系统_显示主界面",true)
				G.call("场景系统_设置背景图片",0x56060025)
				G.call("场景系统_添加交互人物",0x56020044,0,120,"任我行")
				G.call("场景系统_显示指令按钮",{"休息", "离开"})
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","任我行",0x56020044,"小兄弟，近来听向兄弟对你极为推荐，老夫便想见一见你是如何的英雄了得。今日一见才发觉不过寻常一般人而已。真奇怪向兄弟为何对你有所青睐？")
				G.call("对话系统_显示主角对话","在下入教来一直兢兢业业鞠躬尽瘁任劳任怨，才有今天的些许微功。请教主明鉴。")
				G.call("对话系统_显示NPC对话","任我行",0x56020044,"哼！口说无凭，用你的本事来说服我吧。如果言过其实，不但你要受罚，向问天也难辞其咎。")
				G.call("对话系统_显示主角对话","请教主赐招。")
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_黑木崖_任我行1",1)
				G.call("场景系统_显示")
				if enum_战斗结果_战斗结果 == 1 then 
					G.call("通用_设置全局标记",G.QueryName(0x10070016),4)
					o_role_主角.称号 = "神教副教主"
					G.call("对话系统_显示NPC对话","任我行",0x56020044,"不错不错。我已经暗中观察你好久了，发现你不但武功盖世，更为可贵的是对我日月神教衷心耿耿。我决定任命你为日月神教副教主.并传授你本教至宝《葵花宝典》！")
					G.call("通用_变更物品数量",G.QueryName(0x1006003a),1)
					G.call("通知系统_显示系统提示","习得 [04]葵花宝典")
					G.call("对话系统_显示主角对话","多谢教主.祝教主千秋万载，一统江湖！")
					G.call("对话系统_显示NPC对话","任我行",0x56020044,"好兄弟，你我以后不用这么见外。这日月神教以后和你共分享，呵呵呵……")
				else 
					G.call("通用_设置全局标记",G.QueryName(0x10070016),3)
					o_role_主角.称号 = "护法左使"
					G.call("对话系统_显示NPC对话","任我行",0x56020044,"恩，年轻人能有你这样的本事也很不错了，我日月神教也正需要你这样的人才，我任命你为日月神教的护法左使，和向兄弟同为我的左膀右臂。")
					G.call("对话系统_显示主角对话","多谢教主提携，在下日后一定粉身碎骨以报教主知遇之恩。")
					G.call("对话系统_显示NPC对话","任我行",0x56020044,"我要开始闭关修炼，没有特殊事情，不要来影响我。")
				end
			else 
				G.call("对话系统_显示NPC对话","向问天",0x56020043,"你现在功力浅薄而且声望低微，叫我如何向教主推荐你。去江湖上闯荡一番再来吧。")
			end
		elseif string_标识名称 == "任我行" then 
			int_选择 = G.call("对话系统_显示主角选项","",{"向教主请教武功。", "千秋万载，一统江湖。"})
			if int_选择 == 1 then 
				if G.call("运算_随机数",1,9) == 2 then 
					G.call("对话系统_显示NPC对话","任我行",0x56020044,"老夫今天身体不适，改天再陪兄弟过招。")
					int_选择 = G.call("对话系统_显示主角选项","",{"等教主康复后，属下再来请教。", "老东西！可等到你这一天了。"})
					if int_选择 == 2 then 
						G.call("对话系统_显示NPC对话","任我行",0x56020044,"你说什么？难道你想谋反！")
						G.call("对话系统_显示主角对话","老东西，我忍你很久了！你老了，也该退休了。")
						G.call("对话系统_显示NPC对话","向问天",0x56020043,"小子，枉我向教主极力推荐你，想不到你狼子野心。想谋害教主就先过我这关！")
						G.call("场景系统_隐藏")
						enum_战斗结果_战斗结果 = G.call("战斗_黑木崖_向问天",1)
						if enum_战斗结果_战斗结果 == 0 then 
							G.call("通用_显示结束菜单")
							return 
						else 
						end
						G.call("通用_变更人物属性","杀孽","增减",1)
						G.call("场景系统_显示")
						G.call("对话系统_显示NPC对话","任我行",0x56020044,"向兄弟！向兄弟你怎么样了？好小子！没想到你的功夫又精进不少，老夫只有亲自来收拾你了。")
						G.call("场景系统_隐藏")
						enum_战斗结果_战斗结果 = G.call("战斗_黑木崖_任我行3",1)
						if enum_战斗结果_战斗结果 == 0 then 
							G.call("通用_显示结束菜单")
							return 
						else 
						end
						G.call("通用_变更人物属性","杀孽","增减",1)
						G.call("场景系统_移除人物","任我行")
						G.call("场景系统_显示")
						G.call("对话系统_显示主角对话","哼！从今往后我就是日月神教的教主！我就是真正的东方不败！")
						G.call("通用_设置全局标记",G.QueryName(0x10070016),5)
						o_role_主角.称号 = "东方不败"
						G.call("场景系统_隐藏")
						G.call("场景系统_添加交互人物",0x56020042,0,120,"风雷堂主")
						G.call("场景系统_显示")
					else 
						G.call("场景系统_隐藏")
						G.call("场景系统_显示")
					end
				else 
					G.call("对话系统_显示NPC对话","任我行",0x56020044,"老夫今天心情很好，正好要找个人陪着过几招。")
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_黑木崖_任我行2",1)
					G.call("场景系统_显示")
					if enum_战斗结果_战斗结果 == 1 then 
						G.call("对话系统_显示NPC对话","任我行",0x56020044,"不错不错。")
					else 
						G.call("对话系统_显示NPC对话","任我行",0x56020044,"可惜可惜。你还是要勤加练习才好。")
					end
				end
			else 
				G.call("场景系统_隐藏")
				G.call("场景系统_显示")
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_明教'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060026)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602004a,- 208,55,"杨逍")
	G.call("场景系统_添加交互人物",0x5602004b,208,55,"殷天正")
	G.call("场景系统_添加交互人物",0x5602004c,- 208,- 49,"韦一笑")
	G.call("场景系统_添加交互人物",0x5602004d,208,- 49,"冷谦")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "杨逍" then 
			G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"参见教主！")
		elseif string_标识名称 == "殷天正" then 
			G.call("对话系统_显示NPC对话","殷天正",0x5602004b,"参见教主！")
		elseif string_标识名称 == "韦一笑" then 
			G.call("对话系统_显示NPC对话","韦一笑",0x5602004c,"参见教主！")
		elseif string_标识名称 == "冷谦" then 
			G.call("对话系统_显示NPC对话","冷谦",0x5602004d,"参见教主！")
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_明教_山道'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060027)
	G.call("场景系统_添加静态人物",0x5602003d,0,120,"灭绝师太",nil)
	G.call("场景系统_添加静态人物",0x56020034,0,0,"明教教众",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","看来名门正派已和明教发生了冲突，难怪山口防守松懈，死尸遍地。正派人事虽有伤亡，但不惨重，怎么如此一个大教派竟会如此轻易攻破？")
	G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"魔教的人听着：哪一个想活命的，只须出声求饶，便放你们走路。")
	G.call("对话系统_显示NPC对话","明教教众",0x56020034,"明教替天行道，济世救民，生死始终如一。老贼尼想要我们屈膝投降，趁早别妄想了。")
	G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"好啊。这当儿还充英雄好汉！你想死得爽快，我便成全你们！")
	G.call("对话系统_显示主角对话","这些魔教妖人虽然名声恶劣，倒也没见过违法乱纪之徒。而且这份慷慨赴义的精神也令人折服。这位师太下手如此毒辣，莫非就是峨嵋的灭绝师太？")
	int_选择 = G.call("对话系统_显示主角选项","我究竟该帮哪一方呢？",{"帮灭绝师太，消灭这伙明教教徒。", "帮明教教徒解围。"})
	if int_选择 == 1 then 
		G.call("对话系统_显示主角对话","师太且慢动手！杀鸡焉用牛刀？晚辈为师太料理掉这些狂妄之徒！")
		G.call("对话系统_显示NPC对话","明教教众",0x56020034,"毛头小子也太小瞧我们明教了。不怕死就来领教明教的武功绝学吧！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_教众",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("通用_变更人物属性","杀孽","增减",1)
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","明教教众",0x56020034,"好小子，果然英雄出少年。可惜却是个不明是非的家伙。可惜可惜……")
		G.call("场景系统_播放通用动画","明教教众",G.QueryName(0x1002000c),false)
		G.call("场景系统_移除人物","明教教众")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"好小子，武功当真不弱。正派人士中有你这样的英雄少年，实是武林苍生的福气。可惜我峨嵋派没有你这样的人才。")
		G.call("对话系统_显示主角对话","多谢师太抬爱。晚辈以为，当世武林中，武功最高当属武当张真人。其次便是师太您了。今日真使晚辈眼界大开。")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"少侠真会说笑。若少侠不嫌弃我们这群老老少少的尼姑，不妨一同上光明顶，诛杀那些大魔头！")
		G.call("对话系统_显示主角对话","晚辈正要打扰师太。")
		G.call("场景系统_切换剧本",{n = 0, "剧情_明教_光明顶"})
		return 
	else 
		G.call("对话系统_显示主角对话","住手！这般残忍凶狠，你不惭愧么？")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"邪魔歪道，人人得而诛之，有甚么残忍不残忍的？")
		G.call("对话系统_显示主角对话","这些人个个轻生重义，慷慨求死，实是铁铮铮的英雄好汉，怎么说是邪魔外道？而且都已经身负重伤，请师太就此罢手，放他们一条活路吧。")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"好小子，竟敢来教训我！你来接我几招。接得住，说明阁下武功高明，有资格来命令老尼我。否则的话，连你一起毙在掌下！")
		G.call("对话系统_显示主角对话","晚辈虽然才疏学浅，但今天迫于无奈，也只好领教峨嵋老师太的绝招！！请赐教！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_灭绝1",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"哼。看来你也是邪魔歪道的一伙！老尼说到做到，便放了你们一干人等。今日只用了5成功力，而且倚天剑未出，你们不要以为峨嵋好欺负了！光明顶上见！")
		G.call("场景系统_播放通用动画","灭绝师太",G.QueryName(0x10020009),false)
		G.call("场景系统_移除人物","灭绝师太")
		G.call("对话系统_显示NPC对话","明教教众",0x56020034,"多谢少侠救命之恩，他日必保大恩。我们还要赶赴光明顶救援，先行告辞。另外提醒少侠，少侠相助我们明教，自然已和六大派为敌。少侠若要上山，可走小路，以免不必要的麻烦。")
		G.call("对话系统_显示主角对话","多谢大哥指点！")
		G.call("场景系统_隐藏")
		G.call("场景系统_移除人物","明教教众")
		G.call("场景系统_显示")
		int_选择 = G.call("对话系统_显示主角选项","前面似乎有个山洞，不知通向哪里。",{"进入山洞", "不进山洞"})
		if int_选择 == 1 then 
			G.call("场景系统_隐藏")
			G.call("场景系统_设置背景图片",0x56060028)
			G.call("对话系统_显示主角对话","没想到这洞里漆黑一片，早知道就不进来了。谁晓得哪辈子能走出这破山洞！只好硬着头皮摸黑前行了。")
			G.call("对话系统_显示主角选项","",{"向左走！", "向前走！", "向右走！"})
			G.call("对话系统_显示主角对话","这山洞怎么还有岔道？")
			G.call("对话系统_显示主角选项","",{"向左走！", "向前走！", "向右走！"})
			G.call("对话系统_显示主角对话","靠，又是岔路口！")
			G.call("对话系统_显示主角选项","",{"向左走！", "向前走！", "向右走！"})
			G.call("对话系统_显示主角对话","晕！这该不会是传说中的仙剑迷宫吧！还要摸黑走，简直怀疑制作者本人就是路痴！")
			G.call("对话系统_显示主角选项","",{"向左走！", "向前走！", "向右走！"})
			if G.call("运算_随机数",1,4) < 3 then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_明教_光明顶"})
				return 
			else 
			end
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","总算看到光亮了！ 咦？怎么有两具骷髅？[br]地上还有一封信和一个羊皮卷轴。")
			int_选择 = G.call("对话系统_显示主角选项","",{"看书信", "看羊皮卷轴"})
			if int_选择 == 1 then 
				G.call("对话系统_显示主角对话","[03]“……三十二代教主遗命，令余练成乾坤大挪移神功后，率众前赴波斯总教，设法迎回圣火令。本教虽发源于波斯，然在中华生根，开枝散叶，已数百年于兹。今鞑子占我中土，本教誓与周旋到底，决不可遵波斯总教无理命令,")
				G.call("对话系统_显示主角对话","[03]而奉蒙古元人为主.圣火令若重入我手，我中华明教即可与波斯总教分庭抗礼也。”[02]原来明教的总教在波斯国。这前教主和阳教主不肯奉总教之命而降顺元朝，实是极有血性骨气的好汉子。")
				G.call("对话系统_显示主角对话","[03]“今余命在旦夕，有负衣教主重托，实为本教罪人，盼夫人持余亲笔遗书，召聚左右光明使者、四大护教法王、五行旗使、五散人，颁余遗命曰：不论何人重获圣火令者，为本教第三十四代教主.不服者杀无赦。")
				G.call("对话系统_显示主角对话","[03]余名顶天，然于世无功，于教无勋，赍恨而没，狂言顶天立地，诚可笑也。绝世神功原版乾坤大挪移心法已附烈毒，沾之必死！以防小人耳。余将心法摘录信后，望有缘者习得后相助明教，余亦瞑目。资质高者可年内学成，庸碌者此生可不必学也。")
				G.call("对话系统_显示主角对话","[03]乾坤大挪移心法汉化版内容如下：捧气灌顶，吐故纳新，气沉丹田……”")
				G.call("通用_变更物品数量",G.QueryName(0x1006003e),1)
				G.call("通知系统_显示系统提示","获得[04]《乾坤大挪移心法》",nil)
				G.call("对话系统_显示主角对话","幸亏我没去拿羊皮卷轴，不然一定会中毒死得很惨。两位前辈好好安息吧，如果晚辈有能力的话，一定会帮助明教摆脱这次的危机。请前辈安息吧。")
				G.call("对话系统_显示主角对话","想不到这里虽然隐蔽，但是竟然距离出口这么近，已经隐约看到洞口的光亮了。我该赶紧离开这里，还不知道明教和各大派现在情况如何了。")
				G.call("场景系统_切换剧本",{n = 0, "剧情_明教_密道"})
				return 
			else 
				G.call("对话系统_显示主角对话","这羊皮卷轴上怎么有股异味？不好！卷轴上面有毒！[br]啊啊啊啊啊啊啊啊！！！！！！！！！！！！！")
				G.call("通用_显示结束菜单")
				return 
			end
		else 
			G.call("对话系统_显示主角对话","现在身处敌人巢穴，还是不要乱闯的好。万一进得去，出不来就不妙了。")
			G.call("场景系统_添加静态人物",0x56020048,0,120,"成昆",G.QueryName(0x10020005))
			G.call("对话系统_显示NPC对话","成昆",0x56020048,"小子！你在这里偷偷摸摸的干什么？你刚才听见了什么？看到了什么？！")
			G.call("对话系统_显示主角对话","从哪里冒出来的和尚？我什么也没看见，什么也没听见。莫非你在这里做了昧心的事，怕叫别人发现吗？")
			G.call("对话系统_显示NPC对话","成昆",0x56020048,"不管你知道了什么，总之是不能让你活着离开。受死吧！")
			G.call("场景系统_隐藏")
			enum_战斗结果_战斗结果 = G.call("战斗_明教_成昆",1)
			if enum_战斗结果_战斗结果 == 0 then 
				G.call("通用_显示结束菜单")
				return 
			else 
			end
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","成昆",0x56020048,"小子果然厉害！咱们走着瞧！")
			G.call("场景系统_播放通用动画","成昆",G.QueryName(0x10020009),false)
			G.call("场景系统_移除人物","成昆")
			G.call("对话系统_显示主角对话","这和尚看样子也不是好东西，看他似乎向山顶去了。我也赶紧赶去，说不定能发现什么。")
			G.call("场景系统_切换剧本",{n = 0, "剧情_明教_光明顶"})
			return 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_明教_密道'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060028)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_明教_光明顶"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_明教_光明顶'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060029)
	G.call("场景系统_添加静态人物",0x56020005,- 250,30,"玄慈",nil)
	G.call("场景系统_添加静态人物",0x56020049,250,30,"唐文亮",nil)
	G.call("场景系统_添加静态人物",0x5602002c,- 125,- 35,"宋远桥",nil)
	G.call("场景系统_添加静态人物",0x5602003d,0,- 35,"灭绝师太",nil)
	G.call("场景系统_添加静态人物",0x5602000a,125,- 35,"岳不群",nil)
	G.call("场景系统_添加静态人物",0x5602004a,- 147,175,"杨逍",nil)
	G.call("场景系统_添加静态人物",0x5602004b,- 49,175,"殷天正",nil)
	G.call("场景系统_添加静态人物",0x5602004c,49,175,"韦一笑",nil)
	G.call("场景系统_添加静态人物",0x5602004d,147,175,"冷谦",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","看来双方仍是势均力敌，明教高手现已聚齐，但是正派人数较多，已成合围之势。看来胜负在一时半刻间仍无法预料阿。")
	int_选择 = G.call("对话系统_显示主角选项","我究竟该帮哪一方呢？",{"相助明教！", "相助正派！"})
	if int_选择 == 1 then 
		G.call("对话系统_显示主角对话","各位请听我一言。我虽不知道各位为何兴师动众来围剿明教，但是据我所知，明教宗旨是去恶扬善，至于外界如何招惹恶名，想是门人管教不严导致一些宵小之辈混入其中。这是哪门哪派都无可避免的。")
		G.call("对话系统_显示主角对话","现在大家互有损伤，不如到此为止，大家两相罢斗……")
		G.call("对话系统_显示NPC对话","唐文亮",0x56020049,"好狂妄的小子！你是武当张真人吗？你是武林至尊吗？等你取了屠龙刀来，再号令大伙也不迟！哈哈哈哈哈哈……")
		G.call("对话系统_显示主角对话","难道今日之事非要用武力解决不可吗？小子定要当成这个和事老，就请各位前辈来指教。近日单有一口气在，也不让你们灭掉明教！")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"小兄弟，你的好意明教上下一起拜领了，只是你并非明教中人，犯不着冒这个险……")
		G.call("对话系统_显示主角对话","我就是看不惯人多欺负人少，今天能避免死伤最好，若是避免不了，就用武力来解决问题吧。")
		G.call("对话系统_显示NPC对话","唐文亮",0x56020049,"小子真是活得不耐烦了。让你先领教领教我崆峒派的七伤拳！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_唐文亮",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		if G.call("通用_检查秘籍",G.QueryName(0x1006003e),5) then 
			G.call("通用_学会武功",G.QueryName(0x10040007))
			G.call("通知系统_显示系统提示","习得[04]七伤拳","乾坤大挪移产生功效")
		else 
		end
		G.call("对话系统_显示NPC对话","唐文亮",0x56020049,"阁下功夫唐某佩服。今日崆峒派便不再诛杀明教一干人等。")
		if o_role_主角.门派 == "华山派" then 
			G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"想不到我华山派竟出了一个勾结邪魔歪道的孽徒！从今往后，你不再是华山门下，你也不许再提我是你师父！")
			o_role_主角.称号 = "华山弃徒"
			G.call("通用_变更人物属性","声望","增减",- 20)
			G.call("通用_变更人物属性","侠义","增减",- 15)
			G.call("对话系统_显示主角对话","师父，今日之事弟子实在是被逼无奈。请师父原谅不肖弟子吧。")
		else 
		end
		G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"华山派岳某人来领教少侠的高招！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_岳不群",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"阁下功夫岳某佩服。今日华山派便不再诛杀明教一干人等。")
		if o_role_主角.门派 == "武当派" then 
			G.call("对话系统_显示NPC对话","宋远桥",0x5602002c,"想不到我武当派竟出了一个勾结邪魔歪道的孽徒！从今往后，你不再是武当门下，你也不许再提我是你师伯！")
			o_role_主角.称号 = "武当弃徒"
			G.call("通用_变更人物属性","声望","增减",- 20)
			G.call("通用_变更人物属性","侠义","增减",- 15)
			G.call("对话系统_显示主角对话","师伯，今日之事弟子实在是被逼无奈。请师父原谅不肖弟子吧。")
		else 
		end
		G.call("对话系统_显示NPC对话","宋远桥",0x5602002c,"武当派宋某人来领教少侠的高招！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_宋远桥",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","宋远桥",0x5602002c,"阁下功夫宋某佩服。今日武当派便不再诛杀明教一干人等。")
		if o_role_主角.门派 == "少林派" then 
			G.call("对话系统_显示NPC对话","玄慈",0x56020005,"想不到我少林派竟出了一个勾结邪魔歪道的孽徒！从今往后，你不再是少林门下，你也不许再提我是你师父！")
			o_role_主角.称号 = "少林弃徒"
			G.call("通用_变更人物属性","声望","增减",- 20)
			G.call("通用_变更人物属性","侠义","增减",- 15)
			G.call("对话系统_显示主角对话","师父，今日之事弟子实在是被逼无奈。请师父原谅不肖弟子吧。")
		else 
		end
		G.call("对话系统_显示NPC对话","玄慈",0x56020005,"老衲不愿趁人之危，你去休息一下，再来找我比试！")
		G.call("场景系统_隐藏")
		G.call("通用_变更人物属性","生命","增减",9999)
		G.call("通用_变更人物属性","内力","增减",9999)
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","玄慈",0x56020005,"少林派玄慈来领教少侠的高招！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_玄慈",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","玄慈",0x56020005,"阁下功夫老衲佩服。今日少林派便不再诛杀明教一干人等。")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"哼！你们这些人平时不是都挺自负自己武功了得，怎么今天连一个小贼也收拾不了！看我峨嵋派的绝学如何解决这个小贼，也叫尔等不敢小觑我峨嵋派")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"小子！今日让你领教领教倚天剑的利害！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_灭绝2",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("通用_变更物品数量",G.QueryName(0x10060004),1)
		G.call("通知系统_显示系统提示","获得[04]倚天剑")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"老尼招式上从未落过半点下风。今日宝剑却被夺了去，真是平生未有的奇耻大辱！要杀要刮悉听尊便！")
		G.call("通用_变更人物属性","声望","增减",300)
		G.call("通用_变更人物属性","侠义","增减",20)
		G.call("对话系统_显示主角对话","前辈说哪里话来？各位前辈武功绝伦，令晚辈好生佩服。晚辈仍旧是先前那句话，想请各位休戈止息，不要再做无畏的杀戮。")
		G.call("对话系统_显示主角对话","你们在这里厮杀拼命，可曾想过家中的妻儿父母？你们一旦战死，她们又何以生存？你们既然自称侠义道，又怎忍心让这些老幼妇孺孤苦无依？")
		G.call("对话系统_显示主角对话","我只晓明教教义，是为除恶扬善，驱除鞑虏。试问这不是和各证派宗旨同出一辙吗？明教教众龙蛇混杂，以至于个别宵小毁了整个明教的名声。还望明教汲取教训，立时整顿教务，重申教义。")
		G.call("对话系统_显示主角对话","还望明教汲取教训，立时整顿教务，重申教义。")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"明教上下感谢少侠相助大德。明教日后一定整顿教务，严惩不法之徒！")
		G.call("对话系统_显示NPC对话","玄慈",0x56020005,"少侠所言确实有理。今日各大派虽然一败涂地，但对少侠的武功人品心服口服。今日少侠于明教大有恩惠，希望少侠日后能指引明教走上正途，才是我武林之福阿。")
		G.call("对话系统_显示NPC对话","玄慈",0x56020005,"今时今日武林声望之隆无人能与少侠比肩，他日少侠定为武林盟主，号令天下，去恶扬善！")
		G.call("对话系统_显示主角对话","武林盟主…武林盟主…武林盟主…")
		G.call("场景系统_隐藏")
		G.call("场景系统_清空")
		G.call("场景系统_设置背景图片",0x56060029)
		G.call("场景系统_添加静态人物",0x5602004a,- 147,95,"杨逍",nil)
		G.call("场景系统_添加静态人物",0x5602004b,- 49,95,"殷天正",nil)
		G.call("场景系统_添加静态人物",0x5602004c,49,95,"韦一笑",nil)
		G.call("场景系统_添加静态人物",0x5602004d,147,95,"冷谦",nil)
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"明教光明左使-杨逍！")
		G.call("对话系统_显示NPC对话","殷天正",0x5602004b,"明教白眉鹰王-殷天正！")
		G.call("对话系统_显示NPC对话","韦一笑",0x5602004c,"明教青翼蝠王-韦一笑！")
		G.call("对话系统_显示NPC对话","冷谦",0x5602004d,"明教五散人-冷谦！")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"感谢少侠相助明教！大恩大德明教上下没齿难忘！[br]明教自三十三代阳教主离奇失踪后，明教内部为争教主之位，四分五裂，法纪松弛，以至本教名声日益不堪。更招致各大派此次围攻光明顶。")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"若不是少侠仗义相救，明教恐怕会有灭教之灾。杨某已和众位兄弟商议，决议立少侠为第三十四代教主，光复我教昔日辉煌！")
		G.call("对话系统_显示主角对话","各位既然拥立我为明教教主，需当应允我三件事。但凡有一条不能照办，我便不做这教主之位！")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"请教主示下，属下定当尊从！")
		G.call("对话系统_显示主角对话","第一，我意欲与各大派和好。今日之恩怨大家都忘却了吧。弟二，明教立刻严整教务，重申教义。第三，本人迫于形势暂代教主之职。日后如遇贤能，本人自当退位让贤。")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"属下一定照办。请教主放心。")
		G.call("通用_变更人物属性","声望","增减",100)
		o_role_主角.门派 = "明教"
		o_role_主角.称号 = "明教教主"
		G.call("通用_设置全局标记",G.QueryName(0x10070015),1)
		G.call("场景系统_切换剧本",{n = 0, "剧情_明教"})
		return 
	else 
		G.call("对话系统_显示主角对话","晚辈不自量力，斗胆请教明教的绝学！")
		G.call("场景系统_添加静态人物",0x5602004e,0,120,"张无忌",G.QueryName(0x10020005))
		G.call("对话系统_显示NPC对话","张无忌",0x5602004e,"你们人多欺负人少，这还是名门正派的作风吗？大家都伤亡惨重，还是不要再打了，有什么问题不能换种方式解决吗？")
		G.call("对话系统_显示主角对话","你是武林至尊吗？你有号令天下的屠龙刀吗？打得过我，再来说教吧！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_明教_张无忌",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_移除人物","张无忌")
		G.call("场景系统_显示")
		if G.call("通用_检查物品",G.QueryName(0x1006003e)) then 
		else 
			G.call("通用_变更物品数量",G.QueryName(0x1006003e),1)
			G.call("通知系统_显示系统提示","获得[04]《乾坤大挪移心法》")
		end
		G.call("通用_变更人物属性","杀孽","增减",1)
		G.call("对话系统_显示主角对话","这小子武功倒是不弱，就可惜白白送了性命！")
		G.call("通用_变更人物属性","声望","增减",100)
		G.call("通用_变更人物属性","侠义","增减",10)
		G.call("通用_设置全局标记",G.QueryName(0x10070015),1)
		G.call("通用_设置全局标记",G.QueryName(0x10070001),4)
		G.call("对话系统_显示NPC对话","玄慈",0x56020005,"明教劫数难逃。华山派和崆峒派各位，请将场上的魔教余孽一概诛灭了。武当派从西往东搜索，峨嵋派从东往西搜索，别让魔教有一人漏网。少林子弟各取法器，诵念往生经文，替六派殉难的英雄，魔教教众超度，化除冤孽。")
		G.call("对话系统_显示NPC对话","杨逍",0x5602004a,"焚我残躯，熊熊圣火，生亦何欢，死亦何苦？为善除恶，惟光明故，喜乐悲愁，皆归尘土。怜我世人，忧患实多！怜我世人。忧患实多！")
		G.call("对话系统_显示NPC对话","殷天正",0x5602004b,"焚我残躯，熊熊圣火，生亦何欢，死亦何苦？为善除恶，惟光明故，喜乐悲愁，皆归尘土。怜我世人，忧患实多！怜我世人。忧患实多！")
		G.call("对话系统_显示NPC对话","韦一笑",0x5602004c,"焚我残躯，熊熊圣火，生亦何欢，死亦何苦？为善除恶，惟光明故，喜乐悲愁，皆归尘土。怜我世人，忧患实多！怜我世人。忧患实多！")
		G.call("对话系统_显示NPC对话","冷谦",0x5602004d,"焚我残躯，熊熊圣火，生亦何欢，死亦何苦？为善除恶，惟光明故，喜乐悲愁，皆归尘土。怜我世人，忧患实多！怜我世人。忧患实多！")
		G.call("场景系统_变色",255.0)
		G.call("场景系统_清空")
		G.call("场景系统_设置背景图片",0x56060029)
		G.call("场景系统_添加静态人物",0x56020005,- 196,95,"玄慈",nil)
		G.call("场景系统_添加静态人物",0x5602002c,- 98,95,"宋远桥",nil)
		G.call("场景系统_添加静态人物",0x5602003d,0,95,"灭绝师太",nil)
		G.call("场景系统_添加静态人物",0x5602000a,98,95,"岳不群",nil)
		G.call("场景系统_添加静态人物",0x56020049,196,95,"唐文亮",nil)
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","玄慈",0x56020005,"少侠一身通天彻底之能，又能明辨是非，实属武林之福。今日一战，少侠名扬四宇，他日成就定然不可限量。")
		if o_role_主角.门派 == "武当派" then 
			G.call("对话系统_显示NPC对话","宋远桥",0x5602002c,"好孩子！不枉我武当派多年的栽培！你先行赶回，禀告师尊这个天大的喜讯。我们随后便回去。师尊一高兴说不定亲自指导你武功。")
			G.call("对话系统_显示主角对话","多谢师伯！")
		else 
		end
		G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
		return 
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_嵩山派'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060015)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020025,0,120,"左冷禅")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "左冷禅" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070013))
			if int_标记 == 0 then 
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"小兄弟来我嵩山做客，就是看得起左某。现在我嵩山派急缺人手，现有几件大事想劳烦兄弟帮忙办理一下。")
				G.call("通知系统_显示系统提示","获得[04]五岳令",nil)
				G.call("通用_变更物品数量",G.QueryName(0x10060024),1)
				G.call("通用_设置全局标记",G.QueryName(0x10070013),1)
			elseif int_标记 == 1 then 
				int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070003))
				if int_标记 == 0 then 
					G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"近日接到密报，衡山派刘正风结交魔教长老曲洋。几日后要在衡阳城举行金盆洗手大会，意欲脱离我五岳派，去和魔教同流合污。")
					G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"你持我五岳令，速去阻止他。")
					G.call("通用_设置全局标记",G.QueryName(0x10070013),2)
				else 
					G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"听说华山派早年有剑宗，气宗之分，后来剑宗一脉式微。我担心华山剑宗绝艺就此失传，请你去华山寻找剑宗的后人。")
					G.call("通用_设置全局标记",G.QueryName(0x10070013),5)
				end
			elseif int_标记 == 3 then 
				G.call("对话系统_显示主角对话","禀告左盟主：已经顺利阻止刘正风金盆洗手。刘正风身受重伤之际被曲洋救走。生死未卜。")
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"魔教中人公然出手解救刘正风，更确定与魔教关系非常。刘正风即便此刻不死，以后也无法立足于江湖正道。你办的很好很好！")
				G.call("通用_设置全局标记",G.QueryName(0x10070013),4)
			elseif int_标记 == 4 then 
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"听说华山派早年有剑宗，气宗之分，后来剑宗一脉式微。我担心华山剑宗绝艺就此失传，请你去华山寻找剑宗的后人。")
				G.call("通用_设置全局标记",G.QueryName(0x10070013),5)
			elseif int_标记 == 6 then 
				G.call("通知系统_显示系统提示","获得[04]银子500两",nil)
				G.call("通用_变更人物属性","银两","增减",500)
				G.call("对话系统_显示主角对话","哇！左盟主怎么赏赐这么多银子。我实在受之有愧。")
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"有功则奖，有过则罚。左某身为五岳掌门一向公正。")
				G.call("通用_设置全局标记",G.QueryName(0x10070013),7)
			elseif int_标记 == 7 then 
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"泰山派天门道长似乎不能服众，泰山内部也四分五裂。应该为泰山派另选掌门人了。听说天门有个师叔玉玑子，武功高强德高望重，你去把他给我找来。")
				G.call("通用_设置全局标记",G.QueryName(0x10070013),8)
			elseif int_标记 == 9 then 
				G.call("对话系统_显示主角对话","玉玑子在妓院里泡妞，正好让我逮到了。像这样不守清规而且人老心不老的家伙怎配执掌泰山派的门户？")
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"不该你管的事，你也不要打听。事情知道的多了会活不长的。")
				G.call("通用_设置全局标记",G.QueryName(0x10070013),10)
			elseif int_标记 == 10 then 
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"恒山那几个老尼姑总是处处和我作对，不给他们点颜色看看以后我这个盟主还如何做得下去！定逸那个老尼姑现在铸剑谷一带，你去教训一下她们。")
				int_选择 = G.call("对话系统_显示主角选项","",{"同意去教训恒山派。", "不同意去教训恒山派。"})
				if int_选择 == 1 then 
					G.call("通用_设置全局标记",G.QueryName(0x10070013),11)
				else 
					G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"怎么，你不打算为我嵩山派做事了吗？我本来还打算待你做完这件事后，亲自传授给你一门嵩山绝学。看来你与本门神功无缘，你走吧。")
					G.call("通用_设置全局标记",G.QueryName(0x10070013),12)
				end
			elseif int_标记 == 13 then 
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"很好。你终于完成了我所交待的全部任务。这是我近来自悟的一门绝学，现在传授给你。至于功效如何，你自己去细心体会吧。")
				G.call("通知系统_显示系统提示","习得[04]寒冰真气",nil)
				G.call("通用_学会武功",G.QueryName(0x1004001c))
				G.call("通用_设置全局标记",G.QueryName(0x10070013),14)
			elseif int_标记 == 2 or int_标记 == 5 or int_标记 == 8 or int_标记 == 11 then 
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"事情办得怎么样了？")
			elseif int_标记 == 12 or int_标记 == 14 then 
				G.call("对话系统_显示NPC对话","左冷禅",0x56020025,"我现在正在酝酿一件大事，和你无关。以后你可以不必再来找我。")
			else 
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_福威镖局'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000b)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602000f,245,120,"林平之")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "林平之" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000c))
			if int_标记 == 0 then 
				G.call("对话系统_显示主角对话","怎么诺大个镖局竟如此残破？倒好像是遭了打劫的似的。你们这里还能承接保镖的业务吗？")
				G.call("对话系统_显示NPC对话","林平之",0x5602000f,"家门惨遭不幸，父母双亲下落不明，祖业也毁在我这一辈了。恳请大侠帮忙查找父母下落和仇人姓名，林某感激不尽！")
				G.call("通用_设置全局标记",G.QueryName(0x1007000c),1)
			elseif int_标记 == 1 then 
				G.call("对话系统_显示NPC对话","林平之",0x5602000f,"可打探到了我父母下落？")
				G.call("对话系统_显示主角对话","现在还没有任何线索，林兄切莫着急。")
			elseif int_标记 == 2 then 
				G.call("对话系统_显示主角对话","林少侠，你双亲已经遇害。凶手是于沧海和木高峰。林伯父托我转告你：“福州向阳巷老宅地窖中的物事，需小心保管，不得翻看！”")
				G.call("对话系统_显示NPC对话","林平之",0x5602000f,"多谢了。阁下大恩林某铭记于心，待我报得仇后，鞍前马后任您驱策！！！")
				G.call("通用_设置全局标记",G.QueryName(0x1007000c),3)
			elseif int_标记 == 3 then 
				G.call("对话系统_显示NPC对话","林平之",0x5602000f,"林某已杀了木高峰，但是中了毒液，毁了眼睛，看来这辈子是无法亲手再杀死于沧海了。")
			elseif int_标记 == 4 then 
				G.call("对话系统_显示主角对话","林少侠，于沧海已经被我诛杀！你父母可以瞑目了。")
				G.call("对话系统_显示NPC对话","林平之",0x5602000f,"你说的是真的？！父亲啊~孩儿不孝，未能手刃恶贼，多亏了[姓]少侠为我林家除害！您二老可以安息了~  林某粉身碎骨难报大恩，这是我林家祖传之物——")
				G.call("对话系统_显示NPC对话","林平之",0x5602000f,"[03]《辟邪剑谱》[02]，希望您收下。以后如有难处，林某定当粉身碎骨两肋插刀！！！")
				G.call("通用_变更物品数量",G.QueryName(0x1006003c),1)
				G.call("通用_设置全局标记",G.QueryName(0x1007000c),5)
			else 
				G.call("对话系统_显示NPC对话","林平之",0x5602000f,"林某既然大仇得报，也就没什么可牵挂的了。只有这福威镖局是我林家百年的基业，决不会断送在我手上，总有一日会重振当年雄风。")
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_无量山洞'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local int_计数 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000e)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_显示")
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070006))
	if 0 < int_标记 then 
		G.call("对话系统_显示主角对话","神仙姊姊，请你保佑在下事事如意、长命百岁。")
		G.call("对话系统_显示主角对话","我知道你在这里一定非常寂寞，日后在下厌倦了江湖生涯，一定来此长伴神仙姊姊，隐居终老。")
		G.call("对话系统_显示主角对话","只是现有俗务缠身，不得不先行离开，望请见谅。")
	else 
		G.call("对话系统_显示主角对话","想不到这里竟然别有洞天。若非我运气上佳，可能一辈子也无法见到这洞天福地。")
		G.call("对话系统_显示主角对话","这玉雕美女像竟然如此逼真细腻，仿佛是极具灵气的活物似的。")
		G.call("对话系统_显示主角对话","神仙姊姊，在下今日得睹芳容，死而无憾。姊姊在此离世独居，不也太寂寞了么？")
		G.call("对话系统_显示主角对话","神仙姊姊，你若能活过来跟我说一句话，我便为你死一千遍，一万遍，也如身登极乐，欢喜无限。")
		int_计数 = 0
		while true do 
			int_选择 = G.call("对话系统_显示主角选项","",{"跪拜“神仙姊姊”", "离开这里"})
			if int_选择 == 1 then 
				int_计数 = int_计数 + 1
				G.call("对话系统_显示主角对话",G.call("通用_数字转文本",int_计数) .. "下……")
			else 
				break
			end
			if 100 <= int_计数 then 
				G.call("通用_设置全局标记",G.QueryName(0x10070006),1)
				G.call("对话系统_显示主角对话","我娘，磕得我头都晕了。咦？原来跪拜用的蒲团都被我磕烂了。这蒲团里面似乎有夹层，该不会藏了什么东西吧？我来看一看。")
				if G.call("运算_随机数",1,3) == 1 or G.call("通用_检查物品",G.QueryName(0x1006003d)) then 
					G.call("对话系统_显示主角对话","晕！果然里面原来放过东西，还有一张便条：")
					G.call("对话系统_显示主角对话","[03]汝既磕首百遍，自当供我驱策，终身无悔。此卷为我逍遥派武功精要，每日卯午酉三时，务须用心修习一次，若稍有懈惰，余将蹙眉痛心矣。")
					G.call("对话系统_显示主角对话","[03]神功既成，可至琅圜福地遍阅诸般曲籍，天下各门派武功家数尽集于斯，亦即尽为汝用。勉之勉之。")
					G.call("对话系统_显示主角对话","[03]学成下山，为余杀尽逍遥派弟子，有一遗漏，余于天上地下耿耿长恨也。")
					G.call("对话系统_显示主角对话","也不知这里原来放了什么武功秘籍，这逍遥派有和这放书之人是什么关系？头都大了，还是不想了。")
					G.call("对话系统_显示主角对话","既然我无缘得窥绝学，还是就不要奢望了。")
				else 
					G.call("通知系统_显示系统提示","获得[04]《北冥神功》[br][02]获得[04]《凌波微步》",nil)
					G.call("通用_变更物品数量",G.QueryName(0x1006003d),1)
					G.call("通用_变更物品数量",G.QueryName(0x10060036),1)
					G.call("对话系统_显示主角对话","哇！原来里面还有如此好东西，还有一张便条：")
					G.call("对话系统_显示主角对话","[03]汝既磕首百遍，自当供我驱策，终身无悔。此卷为我逍遥派武功精要，每日卯午酉三时，务须用心修习一次，若稍有懈惰，余将蹙眉痛心矣。")
					G.call("对话系统_显示主角对话","[03]神功既成，可至琅圜福地遍阅诸般曲籍，天下各门派武功家数尽集于斯，亦即尽为汝用。勉之勉之。")
					G.call("对话系统_显示主角对话","[03]学成下山，为余杀尽逍遥派弟子，有一遗漏，余于天上地下耿耿长恨也。")
					G.call("对话系统_显示主角对话","也不知这里原来放了什么武功秘籍，这逍遥派有和这放书之人是什么关系？头都大了，还是不想了。")
					G.call("对话系统_显示主角对话","看来我和神仙姊姊真是有缘，一定是姊姊指引我来此学成神功绝学。")
				end
				break
			else 
			end
		end
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_万劫谷_谷口'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060010)
	G.call("场景系统_添加静态人物",0x5602001b,0,95,"南海鳄神",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"哈哈，小子你一定是段家请来助拳的吧！你南海爷爷闷了这么许多日子，现在终于可以开杀戒了。受死吧！")
	G.call("对话系统_显示主角对话","怎么回事？那个华司徒没说守在这的便是四大恶人之一啊？上当了！这个狡猾的家伙！")
	G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"咦？！有趣，有趣，妙极，妙极！你很像我，你很像我！")
	G.call("对话系统_显示主角对话","（怎么回事？他这么说，莫非他就是我失散多年的亲爹？ )")
	G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"你快快叩头！求我收你为弟子。你一求，我立即答允。你手长足长，腰胁柔软，聪明机敏，相貌英俊，年纪不大，又是男人，真是武学奇材。简直是像极了当年的我！")
	int_选择 = G.call("对话系统_显示主角选项","",{"师傅在上，请受徒儿一拜！", "你当我的徒弟还差不多，接招吧！"})
	if int_选择 == 1 then 
		int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070014))
		if int_标记 == 0 then 
			G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"今天真是痛快，收了一个这么优秀的徒弟。今天师父高兴，给你2000两银子就当作见面礼吧。以后一定要把我南海派发扬光大啊！")
			o_role_主角.门派 = "南海派"
			o_role_主角.称号 = "第五恶人"
			G.call("通用_变更人物属性","声望","增减",30)
			G.call("通用_变更人物属性","银两","增减",2000)
			G.call("通用_变更人物属性","侠义","增减",-40)
			G.call("对话系统_显示主角对话","（华司徒应该已经溜进去了，我也该走了）多谢师父。弟子一定会尽心尽力发扬南海派。弟子告辞了。")
		else 
			G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"好徒儿，你快快闭眼。师父马上传给你南海派的绝世武功。")
			G.call("场景系统_隐藏")
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"不妙！不妙！你所修炼的内功和我南海派不是一路，虽然洗去了你的功力，可还是不适合学我南海派的神功，真是遗憾！")
			G.call("通用_变更人物属性","力道","设为",10)
			G.call("通用_变更人物属性","身法","设为",10)
			G.call("通用_变更人物属性","护体","设为",10)
			G.call("通用_变更人物属性","拳掌","设为",1)
			G.call("通用_变更人物属性","御剑","设为",1)
			G.call("通用_变更人物属性","暗器","设为",1)
			G.call("对话系统_显示主角对话","什么？你洗去了我的功力？你是个乌龟王八蛋！")
			G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"混账！敢辱骂师父！我今天就要清理门户，彻底废了你！")
			G.call("对话系统_显示主角对话","你没教我功夫，就不是我师父！你欺负丝毫不会武功的人，就是王八蛋中的极品王八蛋！")
			G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"不好不好，虽然我名列四大恶人，但是“王八蛋”这个称号是万万不能要的。今天老子就饶了你，给你几颗灵丹妙药作为补偿。过了今天，老子以后在杀你就不是王八蛋了！哈哈，老子果然很聪明！")
			G.call("通知系统_显示系统提示","获得 [04]豹胎易筋丸")
			G.call("通用_变更物品数量",G.QueryName(0x10060019),3)
			G.call("对话系统_显示主角对话","以后我一定会报仇的！后会有期！（这大药丸哪里产的，服下后不会有副作用吧.)")
		end
	else 
		if true then 
			G.call("场景系统_隐藏")
			enum_战斗结果_战斗结果 = G.call("战斗_万劫谷_南海鳄神",1)
			if enum_战斗结果_战斗结果 == 0 then 
				G.call("通用_显示结束菜单")
				return 
			else 
			end
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","怎么样？还是我的功夫高吧！快点磕头拜我为师！不然你就是乌龟王八蛋！")
			G.call("对话系统_显示NPC对话","南海鳄神",0x5602001b,"娘老子的，真是晦气！师父在上，弟子岳老二叩拜恩师。")
			o_role_主角.称号 = "恶人之师"
			G.call("通用_变更人物属性","声望","增减",20)
			G.call("对话系统_显示主角对话","（华司徒应该已经溜进去了，我也该走了）乖徒弟，你以后一定要尽心尽力把我的名号发扬光大，不然你就是乌龟王八蛋！师父有事先告辞了。")
		else 
		end
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_万劫谷_牢房'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060011)
	G.call("场景系统_添加静态人物",0x5602001c,0,95,"段延庆",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","段延庆",0x5602001c,"小子，你是段家请来助拳的吧。你认为凭你的功力可以打得到我吗？段家一向自认慈悲为怀，怎么把你却往地狱里送。看来段家真的事没有能人了。")
	G.call("对话系统_显示主角对话","你这丑八怪长得难看也就算了，还在这里吓唬人，你到底还有没有公德心？")
	G.call("对话系统_显示NPC对话","段延庆",0x5602001c,"哼！若不是当年……多说无用，你既然为救人而来，就先打到我再说吧！")
	if true then 
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_万劫谷_段延庆",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","段延庆",0x5602001c,"哼！想不到段家还能请到你这样的少年高手。看来段家气数未尽，以后再作打算吧。")
		G.call("场景系统_移除人物","段延庆")
		G.call("对话系统_显示NPC对话","华赫艮",0x5602001d,"多谢少侠赶跑四大恶人。我家公子已平安救出。我现下传授少侠你[04]一阳指法[02]，就当是谢礼了。日后少侠若有为难，大理国一定全力帮助少侠。告辞了。")
		G.call("通知系统_显示系统提示","习得 [04]一阳指",nil)
		G.call("通用_学会武功",G.QueryName(0x10040010))
		G.call("通用_变更人物属性","银两","增减",1000)
		G.call("对话系统_显示主角对话","善事做完了，还是赶紧离开这是非地吧。万一被谷主看到，又该误会我垂涎他那半老徐娘的老婆了。")
	else 
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_天龙寺'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local int_计数 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000f)
	G.call("场景系统_添加静态人物",0x56020019,108,95,"鸠摩智",nil)
	G.call("场景系统_添加静态人物",0x5602001a,-108,95,"枯荣大师",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","鸠摩智",0x56020019,"枯荣大师，故友对贵寺的六脉神剑绝技非常的推崇，恨不能想见。现在故友已经亡去，我只想借剑谱一用，拿去祭奠故友。日后定当归还。望大师成全。")
	G.call("对话系统_显示NPC对话","枯荣大师",0x5602001a,"六脉神剑剑谱乃镇寺绝学，从不外传，更不用说是借出。即便本寺高僧，若无机缘也不可得见。国师就请不要再为难本寺了。")
	G.call("对话系统_显示NPC对话","鸠摩智",0x56020019,"小僧愿以故友所赠的少林绝艺与大师交换。")
	G.call("对话系统_显示主角对话","（这个吐蕃国师处心积虑要得到剑谱，竟不惜用少林绝技来换，莫非那剑谱所载武功比少林绝学还要厉害？）")
	G.call("对话系统_显示NPC对话","鸠摩智",0x56020019,"这是少林拈花指，小僧献丑了。")
	G.call("场景系统_播放序列帧动画",0,0,48)
	G.call("对话系统_显示NPC对话","枯荣大师",0x5602001a,"国师武功果然神奇，老衲佩服。本寺并无窥视少林绝学之意，请国师从哪来回哪去吧。")
	G.call("对话系统_显示NPC对话","鸠摩智",0x56020019,"大师竟然不吃敬酒，小僧只好亲自去找了。可叹这百年古刹将会毁于今日。")
	G.call("对话系统_显示主角对话","住手！原以为吐蕃国师是何等的庄严宝相，原来竟是一个为达目的不择手段的卑鄙小人。今日让你领教一下中原武学的利害！")
	if true then 
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_天龙寺_鸠摩智",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
	else 
	end
	G.call("对话系统_显示NPC对话","鸠摩智",0x56020019,"中原武林竟出了如此厉害的小辈，中原武学真是深不可测，待日后再来讨教天龙寺的绝学！")
	G.call("场景系统_移除人物","鸠摩智")
	G.call("场景系统_移除人物","枯荣大师")
	G.call("场景系统_添加静态人物",0x5602001a,0,95,"枯荣大师",nil)
	if G.call("通用_检查武功",G.QueryName(0x10040010),1,100) then 
		G.call("对话系统_显示NPC对话","枯荣大师",0x5602001a,"看少侠武功路数中似乎有我大理段氏一阳指的路数，不知少侠是段家哪位传人？")
		G.call("对话系统_显示主角对话","晚辈日前曾在万劫谷帮忙救出大理世子，因此华司徒传授了晚辈一阳指。")
		G.call("对话系统_显示NPC对话","枯荣大师",0x5602001a,"原来少侠早已对大理国有了莫大的恩惠。善哉善哉。这六脉剑谱虽从不外传，但少侠与大理有恩，今日又保全了剑谱。如今只须少侠入我段家，老衲自当传授[04]六脉神剑剑谱[02]。")
		int_选择 = G.call("对话系统_显示主角选项","莫非他是想让我改姓“段”，才好名正言顺传我剑谱。",{"晚辈不敢忘记祖宗名讳，谢大师美意，就此告辞。", "晚辈愿随段家名讳，生为段家人，死为段家死人。"})
		if int_选择 == 2 then 
			o_role_主角.姓 = "段"
			o_role_主角.姓名 = o_role_主角.姓 .. o_role_主角.名
			G.call("通用_变更人物属性","声望","增减",50)
			G.call("通知系统_显示系统提示","获得 [04]《六脉神剑剑谱》")
			G.call("通用_变更物品数量",G.QueryName(0x1006003f),1)
			G.call("对话系统_显示主角对话","多谢大师传授绝学，晚辈一定会擒住鸠摩智那奸贼，以保天龙寺长久太平。晚辈告辞了。")
		else 
			G.call("通用_变更人物属性","侠义","增减",10)
		end
	else 
		G.call("对话系统_显示NPC对话","枯荣大师",0x5602001a,"多谢少侠为本寺解围，使得天龙绝学不会在老衲手中断绝。老衲现在传授你大理段家[04]一阳指[02]，就当是报答少侠了。")
		G.call("通知系统_显示系统提示","习得 [04]一阳指")
		G.call("通用_学会武功",G.QueryName(0x10040010))
		G.call("对话系统_显示主角对话","多谢大师传授绝学，晚辈一定会擒住鸠摩智那奸贼，以保天龙寺长久太平。晚辈告辞了。")
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_剑冢'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070007))
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000c)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020011,245,120,"巨雕")
	if int_标记 == 1 then 
		G.call("场景系统_显示指令按钮",{"休息", "离开"})
	else 
		G.call("场景系统_显示指令按钮",{"离开"})
	end
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "巨雕" then 
			if int_标记 == 1 then 
				G.call("对话系统_显示主角对话","小弟来向雕兄请教武功。")
				G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…嘎……")
				if true then 
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_剑冢_巨雕2",1)
					G.call("场景系统_显示")
				else 
				end
			else
				G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…嘎……")
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_剑冢_救雕'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000c)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","这里折剑。断剑无数，倒似是剑的坟墓。莫非是传说中的“剑冢”？")
	G.call("通用_播放音效",0x49000005)
	G.call("通用_延时",1500)
	G.call("对话系统_显示主角对话","似乎是一种猛禽的叫声，我得过去看看是什么怪物。")
	G.call("场景系统_隐藏")
	G.call("场景系统_添加静态人物",0x56020011,- 53,95,"巨雕",nil)
	G.call("场景系统_添加静态人物",0x56020012,53,95,"怪蟒",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","原来是一只巨雕在和一只怪蟒相互缠斗。看那巨雕身法有度，攻守有道，似乎一派高手宗师的风范。那怪蟒估计不久便落于下风。")
	G.call("对话系统_显示主角对话","糟糕！怪蟒缠住巨雕双翼，意欲全力反击！这大雕现在是险境环生。")
	int_选择 = G.call("对话系统_显示主角选项","",{"救巨雕。", "保命要紧，赶紧离开这里！"})
	if int_选择 == 1 then 
		G.call("对话系统_显示主角对话","大雕小心！我来助你！")
		if true then 
			G.call("场景系统_隐藏")
			enum_战斗结果_战斗结果 = G.call("战斗_剑冢_怪蟒",1)
			if enum_战斗结果_战斗结果 == 0 then 
				G.call("通用_显示结束菜单")
				return 
			else 
			end
			G.call("通用_变更人物属性","杀孽","增减",1)
			G.call("场景系统_移除人物","巨雕")
			G.call("场景系统_移除人物","怪蟒")
			G.call("场景系统_添加静态人物",0x56020011,0,95,"巨雕",nil)
			G.call("场景系统_显示")
		else 
		end
		G.call("对话系统_显示主角对话","这怪蛇怎么如此凶猛！险些就把小命交待了。")
		G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…嘎。")
		G.call("对话系统_显示主角对话","呵呵，大老雕是在感谢我吗？")
		G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎。嘎。（点头）")
		G.call("对话系统_显示主角对话","（这巨雕似乎颇有灵性，竟然能听懂人言）[br]雕兄不必客气，举手之劳何足挂齿。")
		G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎…嘎…嘎…（用爪拨土）")
		G.call("对话系统_显示主角对话","咦？雕兄这是何用意？ 地上似乎显出一些痕迹，像是有人刻意把字刻在地上。[br]“[04]纵横江湖三十余载，杀尽仇寇，败尽英雄，天下更无抗手，无可奈何，惟隐居深谷，以雕为友,")
		G.call("对话系统_显示主角对话","[04]呜呼，生平求一敌手而不可得，诚寂寥难堪也[02]。”[br]下面落款是：“[04]剑魔独孤求败[02]”。莫非这便是当年独孤前辈的隐居处。这巨雕原来和前辈以朋友相交，看来还是我的前辈了。")
		G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎‥（点头，随后用爪将一个大石碓拨开）")
		G.call("对话系统_显示主角对话","咦？雕兄这又是在做什么？[br]啊！这石碓里竟然放着三柄剑！旁边还有几行小字。")
		G.call("对话系统_显示主角对话","“[04]凌厉刚猛，无坚不摧，弱冠前以之与河朔群雄争锋。[br]紫薇软剑，三十岁前所用，误伤义士不祥，乃弃之深谷。”")
		G.call("对话系统_显示主角对话","“[04]重剑无锋，大巧不工。四十岁前恃之横行天下。[br]四十岁后，不滞于物，草木竹石均可为剑。自此精修，渐进于无剑胜有剑之境。”")
		G.call("对话系统_显示主角对话","这几句话分明记载了独孤前辈不同时期的武功造诣，前辈真可谓绝世高人！")
		if false then 
			G.call("对话系统_显示主角对话","我所学得《独孤九剑》一定是独孤前辈四十之前所创，那时前辈便创出此等威力无穷的奥妙剑法，可见前辈晚年的武功当真深不可测。我也算是前辈隔代传人，给前辈磕个头原也应该。")
		else 
		end
		G.call("对话系统_显示主角对话","（前辈所留这三柄剑果然与众不同。第一柄锋利无比，吹毛断刃;第二柄黝黑沉重，双刃无锋;第三柄却是把普通木剑……）")
		G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…嘎‥嘎‥嘎…（将玄铁剑抛了过来）")
		G.call("通知系统_显示系统提示","获得 [04]玄铁剑")
		G.call("通用_变更物品数量",G.QueryName(0x10060005),1)
		while true do 
			G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…")
			G.call("对话系统_显示主角对话","你还要试试我的武功么？也罢，左右无事，我便跟你玩玩。")
			G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…嘎‥")
			G.call("通用_播放音效",0x49000005)
			G.call("通用_延时",1500)
			if true then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_剑冢_巨雕1",1)
				G.call("场景系统_显示")
				if enum_战斗结果_战斗结果 == 1 then 
					break
				else 
					G.call("对话系统_显示主角对话","雕兄神力过人，而且长年伴随独孤前辈。论武功绝对勘比当世高人。我怎能打得过你呢？")
					G.call("通用_变更人物属性","生命","增减",9999)
					G.call("通用_变更人物属性","内力","增减",9999)
				end
			else 
			end
		end
		G.call("通知系统_显示系统提示","习得 [04]玄铁剑法")
		G.call("通用_学会武功",G.QueryName(0x10040018))
		G.call("对话系统_显示主角对话","原来雕兄是在传我武功。小弟感激不尽。今日天色不早，小弟改日再来向雕兄讨教武功。")
		G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…嘎‥")
		G.call("对话系统_显示主角对话","雕兄多多保重，小弟告辞了。")
		G.call("对话系统_显示NPC对话","巨雕",0x56020011,"嘎‥嘎…嘎‥")
		G.call("通用_设置全局标记",G.QueryName(0x10070007),1)
	else 
		G.call("通用_设置全局标记",G.QueryName(0x10070007),2)
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_百花谷'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060012)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602001f,0,120,"周伯通")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "周伯通" then 
			G.call("对话系统_显示NPC对话","周伯通",0x5602001f,"小兄弟，我在这闷得紧了，你来陪我玩玩如何？")
			int_选择 = G.call("对话系统_显示主角选项","",{"现在正好左右无事，正可以向前辈请教。", "晚辈才疏学浅，他日再向前辈请教。"})
			if int_选择 == 1 then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_百花谷_周伯通",1)
				G.call("场景系统_显示")
				if enum_战斗结果_战斗结果 == 1 then 
					if G.call("通用_检查物品",G.QueryName(0x1006003b)) then 
						G.call("对话系统_显示NPC对话","周伯通",0x5602001f,"师父武功越来越厉害了，不过徒弟也不差，总有一天我会再打过你！")
					else 
						G.call("对话系统_显示NPC对话","周伯通",0x5602001f,"哇，你这是用的什么功夫，这么厉害！师父在上，弟子周伯通在下，请师父日后多多指点弟子武功。这本书算是给师父的见面礼，请师父笑纳。")
						G.call("通知系统_显示系统提示","获得 [04]《九阴真经》")
						G.call("通用_变更物品数量",G.QueryName(0x1006003b),1)
					end
					if G.call("通用_检查秘籍",G.QueryName(0x1006003e),5) then 
						if not  G.call("通用_检查武功",G.QueryName(0x10040005),1) then 
							G.call("通知系统_显示系统提示","习得 [04]空明拳", "乾坤大挪移产生功效")
							G.call("通用_学会武功",G.QueryName(0x10040005))
						else 
						end
					else 
					end
				else 
					if G.call("通用_检查武功",G.QueryName(0x10040005),1) or 0 < G.call("通用_获取全局标记",G.QueryName(0x10070011)) then 
						G.call("对话系统_显示NPC对话","周伯通",0x5602001f,"没想到你的功夫还是这么差，玩起来真没意思！你可不要说对外说跟我玩过，我可不能丢这个人。")
					else 
						if G.call("通用_检查人物属性","悟性",0,50) then 
							G.call("对话系统_显示NPC对话","周伯通",0x5602001f,"你真是古往今来天下第一的大笨蛋！以你这样的资质，怎么也跑出来学人家闯荡江湖？真是笑死人了。")
							G.call("对话系统_显示NPC对话","周伯通",0x5602001f,"我老顽童今天发发慈悲，教你一套打架的法门，这样也许你凑巧能多活一二十年吧。")
							G.call("通知系统_显示系统提示","习得 [04]左右互搏之术")
							G.call("通用_设置全局标记",G.QueryName(0x10070011),1)
							G.call("通用_变更人物属性","悟性","设为",100)
						else 
							G.call("对话系统_显示NPC对话","周伯通",0x5602001f,"没想到你的功夫这么差，玩起来真没意思！这样吧，我传给你一套功夫，回去好好练练，再来找我玩！")
							G.call("通知系统_显示系统提示","习得 [04]空明拳")
							G.call("通用_学会武功",G.QueryName(0x10040005))
						end
					end
				end
			else 
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_渡口'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060013)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020020,245,120,"张三")
	G.call("场景系统_添加交互人物",0x56020022,245,0,"杨过")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "张三" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070012))
			if int_标记 == 0 then 
				G.call("对话系统_显示NPC对话","张三",0x56020020,"你不是我要接待的人。")
			elseif int_标记 == 1 then 
				if G.call("通用_检查物品",G.QueryName(0x10060023)) then 
					G.call("对话系统_显示NPC对话","张三",0x56020020,"侠客岛迎宾使，奉岛主之命，恭请少侠启程。")
					G.call("场景系统_切换剧本",{n = 0, "剧情_侠客岛"})
					return 
				else 
					G.call("对话系统_显示NPC对话","张三",0x56020020,"你不是我要接待的人。")
				end
			else 
				G.call("对话系统_显示NPC对话","张三",0x56020020,"侠客岛岛主谕告武林同道：侠客岛从此不再召集各位上岛赴腊八粥之宴。")
			end
		elseif string_标识名称 == "杨过" then 
			if G.call("通用_检查人物属性","等级",20,100) then 
				G.call("对话系统_显示NPC对话","杨过",0x56020022,"十六年之期果然漫长无聊。小兄弟可否陪杨某切磋一下武艺。")
				int_选择 = G.call("对话系统_显示主角选项","",{"在下正要向杨兄请教。", "小弟哪里是杨兄对手，日后再来讨教。"})
				if int_选择 == 1 then 
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_渡口_杨过",1)
					G.call("场景系统_显示")
					if enum_战斗结果_战斗结果 == 1 then 
						if G.call("通用_检查武功",G.QueryName(0x1004000d),1) then 
						else 
							G.call("对话系统_显示主角对话","没想到杨兄身负惊世绝艺！不知道杨兄所使这套掌法叫什么名字？")
							G.call("对话系统_显示NPC对话","杨过",0x56020022,"这是我所创的一路掌法，叫[04]黯然销魂掌[02]。共有一十七招。你若有兴趣，我便将全套掌法一一演与你瞧罢，不到之处，尚请指点。")
							G.call("通知系统_显示系统提示","习得 [04]黯然销魂掌")
							G.call("通用_学会武功",G.QueryName(0x1004000d))
							G.call("对话系统_显示主角对话","杨兄这一路掌法，以力道的雄劲而论，当世唯郭靖郭大侠的降龙十八掌可以比拟。然而论招式之巧妙似乎又在降龙之上。")
							G.call("对话系统_显示NPC对话","杨过",0x56020022,"小兄弟，你虽然学得了此套掌法，但是只得其形未得其神，这套掌法由心而发，你没经历过相思别离之苦，自然无法领会其中滋味。所以此套掌法在你手中也最多发挥到六七成而已。")
						end
					else 
					end
				else 
				end
			else 
				G.call("对话系统_显示NPC随机对话","杨过",0x56020022,{"十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。", "夜来幽梦忽还乡，小轩窗，正梳妆；相对无言，惟有泪千行！料得年年肠断处，明月夜，短松冈。", "“十六年后，在此重会，夫妻情深，勿失信约！”", "黯然销魂者，唯别而已矣"})
				G.call("对话系统_显示主角对话","此人年纪不大，但是双鬓如霜，所吟之词又是如此伤感，想必是相思所至。")
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_侠客岛'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060020)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x5602003e,0,120,"侠客岛主")
	if G.call("通用_获取全局标记",G.QueryName(0x10070012)) > 1 then
		G.call("场景系统_显示指令按钮",{"休息", "离开"})
	end
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "侠客岛主" then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070012))
			if int_标记 == 1 then 
				G.call("通用_设置全局标记",G.QueryName(0x10070012),2)
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"欢迎各位光临侠客岛。老夫僻处荒岛，今日得见众位高贤，大感荣庞。只是荒岛之上，诸物简陋，款待未周，各位见谅。")
				G.call("对话系统_显示主角对话","（这侠客岛岛主也不知是何用意，似乎请遍了中原各大门派的精英人物。假如他居心不良，在这里把我们一举而歼，中原武林可就从此一蹶不振了）")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"各位远道光临，敝岛无以为敬。这碗腊八粥外边倒还不易喝到，其中最主要的一味“断肠蚀骨腐心草”，要开花之后效力方着。")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"但这草隔十年才开一次花。我们总要等其开花之后，这才邀请江湖同道来此同享，屈指算来，这是第四回邀请。请，请，不用客气。")
				G.call("通用_变更物品数量",G.QueryName(0x10060018),2)
				G.call("通知系统_显示系统提示","获得 [04]腊八粥")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"老夫数十年前，在此岛上发现了一套武功秘籍，但是始终不能参悟出其中奥妙。只盼天下的武学好手群集此岛，能助我解开心中疑团，将武学之道发扬光大，推高一层。")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"恰好其时岛上的“断肠蚀骨腐心草”开花，此草若再配以其他佐使之药，熬成热粥，服后于我辈练武之士大有补益，")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"于是老夫派出使者，邀请当世名门大派的掌门人，各教教主，各帮帮主，来到敝岛喝碗腊八粥，喝过粥后，再请他们去参研图解。")
				G.call("对话系统_显示主角对话","你这话岂非当面欺人？倘若只是邀人前来共同钻研武学，为何我曾听说人家若是不来，你们就杀人家满门？天下那有如此强凶霸道的请客法子？")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"凡是给侠客岛剿灭的门派帮会，都是罪大恶极，天所不容之徒。我们虽不敢说替天行道，然而是非善恶，却也分得清清楚楚。")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"我等既住在这侠客岛上，所作所为，总须对得住这“侠客”两字才是。老夫只恨侠客岛能为有限，不能尽诛普天下的恶徒。")
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"各位请仔细想一想，有那一个名门正派或是行侠仗义的帮会，是因为不接邀请铜牌而给侠客岛诛灭了的？因此上，我们所杀之人，其实无一不是罪有应得……")
				if G.call("通用_检查人物属性","侠义",50,100) then 
					G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"少侠年纪轻轻美名远扬，老夫十分钦佩。更难得的是你武艺惊人，老夫所料不错的话，你是我历年来所请宾客中年纪最轻，武功修为最深的不世奇才。希望你能解开侠客岛神奇武功之谜。")
					G.call("场景系统_隐藏")
					G.call("场景系统_显示指令按钮",{"休息", "离开"})
					G.call("场景系统_显示")
				else 
					G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"至于少侠你，我们倒是最近才有所耳闻。虽然阁下名声显赫，但是劣迹斑斑，似乎已为天理所不容。今日上的侠客岛，就不必再回去了。")
					G.call("对话系统_显示主角对话","你们自以为武功高强，就可以随便决定我的生死吗？我既然放心来这，就不怕回不去。")
					G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"阁下武功虽未达到登峰造极的地步，不过少年人能练到你这地步也极为罕见。如果就此废去了，也是一件憾事。不过总好过留你在世间继续为恶。老夫就亲自为你送行吧。")
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_侠客岛_岛主1")
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("通用_显示结束菜单")
						return 
					else 
					end
					G.call("场景系统_显示")
					G.call("对话系统_显示主角对话","（这老爷子功力果然深厚，也不知道练得什么功夫。幸亏他先住手，不然我可吃不消。）怎么不打了？")
					G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"罢了，老夫动了恻隐之心。不忍心毁去你这个武林奇才，今日放你回去，希望你能改过自新。如果再为非作歹，老夫必定倾全岛之力把你除去！")
					G.call("对话系统_显示主角对话","多谢岛主不杀之恩，我一定会痛改前非，弃恶从善。")
					G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
					return 
				end
			elseif int_标记 == 2 then 
				int_选择 = G.call("对话系统_显示主角选项","",{"向前辈讨教武功。", "研究侠客岛武学。", "无心路过，打扰前辈了。"})
				if int_选择 == 1 then 
					int_选择 = G.call("对话系统_显示主角选项","",{"挑战岛主二成功力。", "挑战岛主五成功力。", "挑战岛主十成功力。"})
					G.call("场景系统_隐藏")
					if int_选择 == 1 then 
						enum_战斗结果_战斗结果 = G.call("战斗_侠客岛_岛主2",0.2)
					elseif int_选择 == 2 then 
						enum_战斗结果_战斗结果 = G.call("战斗_侠客岛_岛主2",0.5)
					else 
						enum_战斗结果_战斗结果 = G.call("战斗_侠客岛_岛主2",1)
					end
					G.call("场景系统_显示")
					if enum_战斗结果_战斗结果 == 1 then 
						G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"不错不错。")
					else 
						G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"可惜可惜。")
					end
				elseif int_选择 == 2 then 
					G.call("场景系统_隐藏")
					G.call("场景系统_显示")
					if G.call("通用_检查人物属性","悟性",0,50) then 
						int_标记 = 3
					elseif G.call("通用_检查人物属性","悟性",90,100) then 
						if G.call("通用_检查人物属性","学点",5,nil) then 
							G.call("通用_变更人物属性","学点","增减",- 5)
							int_标记 = 3
						else 
							G.call("对话系统_显示主角对话","看来我的修为还远远不够，还未能参悟这深奥武学。")
						end
					else 
						if G.call("通用_检查人物属性","学点",3,nil) then 
							G.call("通用_变更人物属性","学点","增减",- 3)
							int_标记 = 3
						else 
							G.call("对话系统_显示主角对话","似乎已经能初窥门径了，但是仍有许多不能融会贯通。")
						end
					end
					if int_标记 == 3 then 
						G.call("通用_设置全局标记",G.QueryName(0x10070012),3)
						G.call("通用_学会武功",G.QueryName(0x10040020))
						G.call("通知系统_显示系统提示","悟出 [04]太玄经神功")
						G.call("对话系统_显示主角对话","原来这门神功的修炼法门是这个样子的……原来越笨的人反而领悟越快。莫非是专给笨人练的？")
						G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"老夫果然没有看走眼。恭喜少侠悟出绝世神功。今日神功幸遇传人，老夫心愿已了。这十年一度的侠客岛腊八粥宴从此就可免了。少侠神功既成，它日在江湖上扬名立万那是轻而易举。希望不要忘了'侠客'之名。")
					else 
					end
				else 
				end
			else 
				G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"少侠神功既成，它日在江湖上扬名立万那是轻而易举。希望不要忘了'侠客'之名。")
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("对话系统_显示NPC对话","侠客岛岛主",0x5602003e,"侠客岛已备好船只，少侠可以随时回到中原。但是再想来到这侠客岛可就千难万难。")
			int_选择 = G.call("对话系统_显示主角选项","",{"我要离开侠客岛！", "暂时先不离开！"})
			if int_选择 == 1 then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
				return 
			else 
			end
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_铸剑谷'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060014)
	if G.call("场景系统_检查能否触发事件") then
		int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070013))
		if int_标记 == 11 then 
			G.call("场景系统_添加静态人物",0x56020023,0,95,"定逸师太",nil)
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","定逸师太，我不知道你何处得罪了左盟主，左盟主命我来教训一下你们衡山派。不过请师太放心，我不会取你们性命的。")
			G.call("对话系统_显示NPC对话","定逸师太",0x56020023,"原来是左冷禅的走狗！不要以为恒山派全是女流就好欺负，我可不会手下留情的！")
			if true then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_铸剑谷_定逸",1)
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("场景系统_显示")
				G.call("对话系统_显示主角对话","近日算是领教了定逸师太的高招。可以回复左盟主了。")
				G.call("对话系统_显示NPC对话","定逸师太",0x56020023,"哼！")
				G.call("通用_变更人物属性","侠义","增减",- 10)
				G.call("通用_设置全局标记",G.QueryName(0x10070013),13)
			else 
			end
			G.call("场景系统_隐藏")
			G.call("场景系统_移除人物","定逸师太")
			G.call("场景系统_显示指令按钮",{"离开"})
			G.call("场景系统_显示主界面",true)
			G.call("场景系统_显示")
		elseif int_标记 == 12 then 
			G.call("场景系统_添加静态人物",0x56020024,- 108,95,"职业杀手",nil)
			G.call("场景系统_添加静态人物",0x56020023,108,95,"定逸师太",nil)
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","职业杀手",0x56020024,"定逸师太，我不知道你何处得罪了左盟主，左盟主命我来教训一下你们衡山派。不过请师太放心，我不会取你们性命的。")
			G.call("对话系统_显示NPC对话","定逸师太",0x56020023,"原来是左冷禅的走狗！不要以为恒山派全是女流就好欺负，我可不会手下留情的！")
			G.call("对话系统_显示主角对话","定逸师太，不用担心！好在我没有来迟，原来左冷禅又找了别人来为难恒山派。左冷禅的人品真是非常低劣！")
			G.call("对话系统_显示NPC对话","职业杀手",0x56020024,"不管你是谁，敢耽误我的买卖，都是死路一条！")
			if true then 
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_铸剑谷_杀手",1)
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("场景系统_移除人物","职业杀手")
				G.call("场景系统_移除人物","定逸师太")
				G.call("场景系统_添加静态人物",0x56020023,0,95,"定逸师太",nil)
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","定逸师太",0x56020023,"多谢少侠为恒山派解围，贫尼无以为报，只有朝夕以清香一炷，祷祝少侠福体康健，万事如意。")
				G.call("对话系统_显示主角对话","晚辈也祝老师太和众位小师太一路顺风，逢凶化吉，万事顺利，左冷禅心胸狭隘，请师太一定要多加小心。")
				G.call("对话系统_显示NPC对话","定逸师太",0x56020023,"多谢少侠。")
				G.call("通用_变更人物属性","侠义","增减",10)
				G.call("通用_变更人物属性","福缘","增减",20)
				G.call("通用_设置全局标记",G.QueryName(0x10070013),14)
			else 
			end
			G.call("场景系统_隐藏")
			G.call("场景系统_移除人物","定逸师太")
			G.call("场景系统_显示指令按钮",{"离开"})
			G.call("场景系统_显示主界面",true)
			G.call("场景系统_显示")
		else 
			G.call("场景系统_显示指令按钮",{"离开"})
			G.call("场景系统_显示主界面",true)
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","这里没有特殊情况发生。")
		end
	else
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示")
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_破庙'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000d)
	if G.call("场景系统_检查能否触发事件") then
		int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000c))
		if int_标记 == 1 then 
			G.call("场景系统_添加静态人物",0x56020013,- 108,95,"木高峰",nil)
			G.call("场景系统_添加静态人物",0x56020014,108,95,"林震南",nil)
			G.call("场景系统_显示")
			G.call("对话系统_显示NPC对话","木高峰",0x56020013,"那辟邪剑谱此刻在哪里？你只须老老实实的跟我说了，我便替你诛灭青城派全派，为你夫妇报仇。")
			G.call("对话系统_显示NPC对话","林震南",0x56020014,"我不知有甚么辟邪剑谱。我林家的辟邪剑法世代相传，都是口授，并无剑谱。")
			G.call("对话系统_显示主角对话","说这话的，莫非是福威镖局少镖头林平之的父亲，是福威镖局总镖师林震南？那个矮驼子似乎在逼迫总镖头交出什么剑谱。我可千万别被他们发现才好。")
			G.call("对话系统_显示NPC对话","林震南",0x56020014,"前辈肯为在下报仇，自是感激不尽。青城派余沧海多行不义，日后必无好报，就算不为前辈所诛，也必死于另一位英雄好汉的刀剑之下。")
			G.call("对话系统_显示NPC对话","木高峰",0x56020013,"嘿嘿，我瞧你实在蠢得厉害。林总镖头，你为甚么死也不肯交剑谱出来？这剑谱于你半分好处也没有。")
			G.call("对话系统_显示NPC对话","木高峰",0x56020013,"依我看啊，这剑谱上所记的剑法，多半平庸之极，否则你为甚么连青城派的几名弟子也斗不过？这等武功，不提也罢。")
			G.call("对话系统_显示NPC对话","木高峰",0x56020013,"另有一节，须得告诉你，林平之这小子聪明伶俐，老夫一见就很喜欢，这孩子倒也识趣，知道老夫功夫厉害，便拜在老夫门下了。")
			G.call("对话系统_显示NPC对话","林震南",0x56020014,"原来我孩子拜了木前辈为师，那真是他的造化。我夫妇遭受酷刑，身受重伤，性命已在顷刻之间，死前得知平之无恙，我等死也瞑目了。只求前辈赏一个痛快的死法！")
			G.call("对话系统_显示NPC对话","木高峰",0x56020013,"哇呀呀！！！你们以为那小子现在不在我手上，你们就有持无恐马？我若当真决意去找他来杀，难道还办不到？既然你死都不肯透露剑谱下落，我只有成全你了！")
			int_选择 = G.call("对话系统_显示主角选项","（不好！那驼子要对总镖头行凶！我该怎么办？）",{"挺身而出！", "离开破庙"})
			if int_选择 == 1 then 
				G.call("对话系统_显示主角对话","住手！")
				G.call("对话系统_显示NPC对话","木高峰",0x56020013,"哪来的毛头小子！对大爷呼喝，活不耐烦了？")
				if o_role_主角.门派 == "无门派" then 
					G.call("对话系统_显示主角对话","木高峰！你在这里做什么！亏的你一身武艺，竟然恃强凌弱，在这里威逼一位奄奄一息的老伯父，你简直无耻之极！")
					G.call("对话系统_显示NPC对话","木高峰",0x56020013,"好小子，木某的事情你也敢管！今天杀一个是杀，杀俩也是杀，你也把命留下吧！")
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_破庙_木高峰",1)
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("通用_显示结束菜单")
						return 
					else 
					end
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","木高峰",0x56020013,"好小子，今天梁子算是结下了，有种的到塞北来玩玩，木某人扫榻恭候！后会有期！")
					G.call("场景系统_移除人物","木高峰")
					G.call("对话系统_显示主角对话","（这驼子原来也是欺软怕硬的家伙，临走还不忘充一下脸面。）林伯父您好，我与前日已见过林少侠，他托我来打听您老的下落。")
				else 
					G.call("对话系统_显示主角对话","木前辈," .. o_role_主角.门派 .. o_role_主角.姓名 .. "奉业师之命，恭请木前辈移驾，有事相商。")
					G.call("对话系统_显示NPC对话","木高峰",0x56020013,"（我在这做见不得人的勾当，他师父叫我出去有甚么事情相商？不是明着好言相劝，实则是冷嘲热讽，损我一番。好汉不吃眼前亏，及早溜开的为是。）")
					G.call("对话系统_显示NPC对话","木高峰",0x56020013,"木某另有要事，不克奉陪。便请拜上尊师，何时有暇，请到塞北来玩玩，木某人扫榻恭候。")
					G.call("场景系统_移除人物","木高峰")
					G.call("对话系统_显示主角对话","（这驼子原来对我师父如此怕得要死。他倘若真的不走，要向我动粗，倒是凶险得紧。）林伯父您好，我与前日已见过林少侠，他托我来打听您老的下落。")
				end
				G.call("对话系统_显示NPC对话","林震南",0x56020014,"少侠多礼，太不敢当。还要多谢少侠救命之恩。我那平之孩儿如今怎样了？")
				G.call("对话系统_显示主角对话","林少侠现在福威镖局附近隐姓埋名，正在发奋图强，希望有一天能重振林家雄风。")
				G.call("对话系统_显示NPC对话","林震南",0x56020014,"唉，我还担心平时过于溺爱他。想不到他这么好强，不愧我林家的后人。可惜我命不久已，不能再见平之一面。林某请求少侠转告孩儿一句话。")
				G.call("对话系统_显示主角对话","请林伯父吩咐。")
				G.call("对话系统_显示NPC对话","林震南",0x56020014,"请你告诉我孩子，福州向阳巷老宅地窖中的物事，是……我林家祖传之物……咳咳咳……")
				G.call("对话系统_显示主角对话","林伯父请保重身体，还是调养好身体，您当面跟林少侠说吧。")
				G.call("对话系统_显示NPC对话","林震南",0x56020014,"来不及了，咳，你一定要仔细听好。告诉他那物事须得……须得好好保管，但……但他曾祖远图公留有遗训，凡我子孙，不得翻看，否则有无穷祸患，要……要他好好记住了。多……多……多……")
				G.call("场景系统_移除人物","林震南")
				G.call("通用_设置全局标记",G.QueryName(0x1007000c),2)
				G.call("通用_设置全局标记",G.QueryName(0x10070014),1)
				G.call("场景系统_隐藏")
				G.call("场景系统_显示指令按钮",{"离开"})
				G.call("场景系统_显示主界面",true)
				G.call("场景系统_显示")
			else 
				G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
				return 
			end
		else 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x10070014))
			if int_标记 == 1 then 
				G.call("场景系统_添加静态人物",0x56020015,- 108,95,"李莫愁",nil)
				G.call("场景系统_添加静态人物",0x56020016,108,95,"程英",nil)
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"小妮子，我看你今天还能往哪跑！你串通陆无双那个贱丫头偷得我的武功秘籍，要是不交出来，我让你求生不得求死不能！")
				G.call("对话系统_显示NPC对话","程英",0x56020016,"你若是敢伤我性命，恩师一定不会放过你的！")
				G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"哼！你不用抬出黄药师来吓我。他的几大弟子一个比一个脓包。料想他也不会有太大本事。当年的中原五绝恐怕都是欺世盗名之辈。")
				G.call("对话系统_显示NPC对话","程英",0x56020016,"大师兄陈玄风，周身铜筋铁骨，刀枪不入;二师姐梅超风，来去如风，出手迅捷无比。三师兄曲灵风轻功神妙，劈空掌凌厉绝伦。四师兄陆乘风不但武术精湛。兼擅奇门遁甲异术，你若是遇到，定然讨不了好去。")
				G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"嘿嘿，铜尸陈玄风，听说是给一个小儿一刀刺死的，那有什么厉害了？说甚么刀枪不入，胡吹大气！梅超风出手太快了，因此先给江南七怪打瞎了眼珠，再给西毒欧阳锋震碎心肺。")
				G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"江湖上传言，有人偷入皇宫内偷盗宝物，给御前侍卫打死了，那便是这位劈空掌凌厉绝伦的曲灵风。掌掌劈出，掌掌落空，这是桃花岛的劈空掌。")
				G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"奇门遁甲又有何用？陆老头在太湖边上起造一座归云庄，江湖上好汉说得奥妙无穷，可是给人一把火烧成了白地，他自己从此也无下落，多半就是给这把火烧死了。")
				G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"黄药师的所剩最后一个弟子恐怕今日也要毙命。相传神乎其神的桃花岛绝学看来真是不值一晒！")
				G.call("对话系统_显示NPC对话","程英",0x56020016,"我师门不幸，人才凋零。晚辈入门日浅，功夫低微，不能为师父争一口气，实是惭愧。你今日辱我师门，虽然我武艺低微，也要与你拼死一搏！")
				int_选择 = G.call("对话系统_显示主角选项","（又遇到江湖恩怨了，我该怎么办？）",{"挺身而出！", "静观其变。", "离开破庙。"})
				G.call("通用_设置全局标记",G.QueryName(0x10070014),2)
				if int_选择 == 1 then 
					G.call("对话系统_显示主角对话","管闲事的来了！我就看不惯恃强凌弱的家伙，尤其是老女人欺负漂亮姑娘！")
					G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"小子你找死！")
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_破庙_李莫愁1",1)
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("通用_显示结束菜单")
						return 
					else 
					end
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"想不到年轻一辈里有你这样的高手，江湖中真是藏龙卧虎！")
					G.call("对话系统_显示主角对话","桃花岛主黄老前辈曾经随意指点过晚辈几招。他老人家武功深不可测，你这种井底之蛙岂能见识的到！今日你有辱黄岛主威名，我代他老人家出手教训教训你！")
					G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"黄岛主只是随意指点一下，你便有如此成就吗？罢了，罢了！")
					G.call("通用_变更人物属性","侠义","增减",10)
					G.call("场景系统_移除人物","李莫愁")
					G.call("对话系统_显示NPC对话","程英",0x56020016,"多谢少侠维护桃花岛颜面。可是看少侠身手不像是桃花岛的功夫。莫非少侠是恩师的旧交吗？")
					G.call("对话系统_显示主角对话","姑娘莫怪。我对黄岛主心仪已久，恨不能想见。方才见那女人轻视黄岛主，就瞎编了一套说辞叫她不敢再胡言乱语。黄岛主当世高人自然不屑和这女人动手，我便代他老人家修理这女人。")
					G.call("对话系统_显示NPC对话","程英",0x56020016,"不管怎么说，少侠都是对桃花岛有恩。这些“九花玉露丸”是桃花岛秘制灵药，赠与少侠。")
					G.call("通知系统_显示系统提示","获得 [04]九花玉露丸")
					G.call("通用_变更物品数量",G.QueryName(0x10060016),5)
					G.call("对话系统_显示NPC对话","程英",0x56020016,"多谢少侠救命之恩。后会有期。")
					G.call("对话系统_显示主角对话","为啥最近美女们总是来去匆匆，咋不给机会交流一下感情呢？")
					G.call("场景系统_隐藏")
					G.call("场景系统_移除人物","程英")
				elseif int_选择 == 2 then 
					G.call("场景系统_隐藏")
					G.call("场景系统_添加静态人物",0x56020017,0,120,"黄药师",nil)
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","黄药师",0x56020017,"你这女人小看我桃花岛武学，欺我爱徒，我若是不给你些教训，你当真是把我桃花岛视若无物。我不跟你亲自动手只需找个小辈随意指点他几招，便可轻易胜你！")
					G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"我就偏不信你能有这个本事！")
					G.call("对话系统_显示NPC对话","黄药师",0x56020017,"小兄弟你出来吧。")
					G.call("对话系统_显示主角对话","原来黄岛主早就知道我躲在外面，实在惭愧。")
					G.call("对话系统_显示NPC对话","黄药师",0x56020017,"小兄弟，你知道我叫你出来的用意吗？")
					G.call("对话系统_显示主角对话","想必是岛主不屑与这女人动手。晚辈可为黄岛主代劳，叫她以后不再目中无人！")
					G.call("对话系统_显示NPC对话","黄药师",0x56020017,"小兄弟所料不错。我现在传你一门“弹指神通”的本事，你可要瞧好了。")
					G.call("通知系统_显示系统提示","习得 [04]弹指神通")
					G.call("通用_学会武功",G.QueryName(0x1004000f))
					G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"临阵磨枪不觉得晚吗？")
					G.call("对话系统_显示主角对话","不晚不晚，正好拿你试试新招！")
					G.call("场景系统_隐藏")
					enum_战斗结果_战斗结果 = G.call("战斗_破庙_李莫愁2",1)
					if enum_战斗结果_战斗结果 == 0 then 
						G.call("通用_显示结束菜单")
						return 
					else 
					end
					G.call("场景系统_显示")
					G.call("对话系统_显示NPC对话","李莫愁",0x56020015,"罢了，罢了。今日对黄岛主是心服口服。")
					G.call("场景系统_隐藏")
					G.call("场景系统_移除人物","李莫愁")
					G.call("场景系统_移除人物","程英")
					G.call("场景系统_移除人物","黄药师")
					G.call("场景系统_添加静态人物",0x56020016,0,95,"程英",nil)
					G.call("场景系统_显示")
					G.call("对话系统_显示主角对话","咦？黄岛主怎么不见了？")
					G.call("对话系统_显示NPC对话","程英",0x56020016,"恩师临行前命我代他老人家向少侠致谢。这些“九花玉露丸”是桃花岛秘制灵药，赠与少侠。")
					G.call("通知系统_显示系统提示","获得 [04]九花玉露丸")
					G.call("通用_变更物品数量",G.QueryName(0x10060016),5)
					G.call("对话系统_显示NPC对话","程英",0x56020016,"多谢少侠救命之恩。后会有期。")
					G.call("对话系统_显示主角对话","为啥最近美女们总是来去匆匆，咋不给机会交流一下感情呢？")
					G.call("场景系统_隐藏")
					G.call("场景系统_移除人物","程英")
				else 
					G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
					return 
				end
				G.call("场景系统_显示指令按钮",{"离开"})
				G.call("场景系统_显示主界面",true)
				G.call("场景系统_显示")
			else 
				G.call("场景系统_显示指令按钮",{"离开"})
				G.call("场景系统_显示主界面",true)
				G.call("场景系统_显示")
				G.call("对话系统_显示主角对话","这个破庙年久失修，人迹罕至，连老鼠也没有一个，肯定不会有什么事情发生。以后有空再过来看看吧。")
			end
		end
	else
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示")
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_破庙_炼毒'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000d)
	G.call("场景系统_添加交互人物",0x56020029,0,120,"阿紫")
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_显示指令按钮",{"休息"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "阿紫" then 
			int_选择 = G.call("对话系统_显示主角选项","",{"请教今天的任务。", "臭丫头，我不陪你玩了！"})
			if int_选择 == 1 then
				G.call("对话系统_显示NPC对话","阿紫",0x56020029,"快去捉毒虫回来供我练功！")
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_破庙_毒蛇")
				if enum_战斗结果_战斗结果 == 0 then
					G.call("通用_显示结束菜单")
					return
				else
				end
				G.call("通用_变更人物属性","杀孽","增减",1)
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","阿紫",0x56020029,"很好很好，给你今天的奖励。")
				G.call("通知系统_显示系统提示","[04]毒术上升！")
				G.call("通用_变更人物属性","用毒","增减",G.call("运算_随机数",1,6))
			elseif int_选择 == 2 then
				G.call("对话系统_显示NPC对话","阿紫",0x56020029,"什么？胆敢放肆！我得好好教训你一下。")
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_破庙_阿紫")
				G.call("场景系统_显示")
				if enum_战斗结果_战斗结果 == 1 then
					G.call("对话系统_显示主角对话","早知道你就这点本事，我就不该赔你玩这么长时间。在下告辞了！")
					G.call("对话系统_显示NPC对话","阿紫",0x56020029,"哼！")
					G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
					return
				else
					G.call("对话系统_显示NPC对话","阿紫",0x56020029,"胆敢反抗我，给你点颜色看看。你已中了我的毒，看看你的血量吧。不想死的话就给我老实点！")
					G.call("场景系统_隐藏")
					G.call("通用_变更人物属性","生命上限","乘以",0.8)
					G.call("场景系统_显示")
				end
			end
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_聚贤庄'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606001f)
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007001a))
	if int_标记 == 0 then 
		G.call("场景系统_添加交互人物",0x5602003b,0,120,"游驹")
	else 
	end
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_显示")
	if G.call("场景系统_检查能否触发事件") then
		if int_标记 == 0 then 
		else 
			G.call("对话系统_显示主角对话","昔日聚贤庄一战，惊天地泣鬼神。这庄园也被严重损毁，恐怕以后不会再有人居住了。")
		end
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "游驹" then 
			G.call("对话系统_显示NPC对话","游驹",0x5602003b,"请出示请帖方能入内。")
			if G.call("通用_检查物品",G.QueryName(0x1006002c)) then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_聚贤庄_乔峰"})
				return 
			else
				G.call("对话系统_显示主角对话","又不是嘉年华游乐园，一个普通庄园也要入场券，真是奇哉怪也。")
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_聚贤庄_乔峰'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606001f)
	G.call("场景系统_添加静态人物",0x5602003b,0,160,"游驹",nil)
	G.call("场景系统_添加静态人物",0x5602000a,- 208,65,"岳不群",nil)
	G.call("场景系统_添加静态人物",0x56020024,208,65,"职业杀手",nil)
	G.call("场景系统_添加静态人物",0x5602003c,- 208,- 50,"何太冲",nil)
	G.call("场景系统_添加静态人物",0x5602003d,208,- 50,"灭绝师太",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","游驹",0x5602003b,"今日各路英雄云集于游某的聚贤庄，真是给游某天大的面子。")
	G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"大家今日都是为了武林中新出的这个祸胎乔峰而来，可以说是同仇敌忾，游庄主这么说就是太见外了。")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"此人丧心病狂，行止乖张。本来嘛，他曾为丐帮立过不少大功，也为武林除过大害。可是大丈夫立身处世，总当以大节为重，一些小恩小惠，也只好置之脑后了。")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"他是我大宋的死仇，在下虽然与他相交日久，也受过他的好处，却不能以私恩而废公义。常言道大义灭亲，何况在下已于他恩断义决。")
	if G.call("通用_获取全局标记",G.QueryName(0x10070005)) == 2 then 
		G.call("对话系统_显示主角对话","咦？！你这个忘恩负义的何掌门不是已经被我干掉了吗，怎么又冒出来了？")
		G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"我是基于义愤，才站出来说句公道话的！")
	else 
	end
	G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"何掌门果然是明辨是非的好汉子！好样的！")
	G.call("对话系统_显示NPC对话","游驹",0x5602003b,"在下刚刚得到消息，乔峰那厮不知如何得知了咱们在此聚会的消息，他也要来赴这个英雄宴。")
	G.call("对话系统_显示NPC对话","职业杀手",0x56020024,"乔峰行事素来有勇有谋，倘若当真单枪匹马闯到聚贤庄来，那就奇怪之至了。我想乔峰那厮乃是故布疑阵，让大伙儿在这里空等，他却溜了个不知去向。这叫做金蝉脱壳之计。")
	G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"脱个屁！乔峰是何等样人物，他说过了话，哪有不作数的？老尼之前对他好生敬佩，但今日势不两立，除恶务尽，老尼定不会手下留情！")
	G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"乔峰拜庄！")
	G.call("场景系统_隐藏")
	G.call("场景系统_添加静态人物",0x5602003a,0,10,"乔峰",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","职业杀手",0x56020024,"乔峰你好大的胆子！知道咱们正在这里商量如何对付你，你却自己跑来送死。就算你本事再大，今天你也未必能讨得了好去！")
	G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"游庄主，在下今日在此遇见不少故人，此后是敌非友，心下不胜伤感，想跟你讨几碗酒喝。")
	G.call("对话系统_显示NPC对话","游驹",0x5602003b,"可以，上酒来！")
	G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"这里众家英雄，多有乔峰往日旧交，今日既有见疑之意，咱们干杯绝交。哪一位朋友要杀乔某的，先来对饮一碗，从此而后，往日交情一笔勾销。我杀你不是忘恩，你杀我不算负义。天下英雄，俱为证见。")
	G.call("场景系统_隐藏")
	G.call("通知系统_显示全屏字幕", "    聚贤庄内上百人之多，与乔峰饮过酒的也有六七十人，其他人非是不愿和乔峰绝交，乃是惧怕乔峰神威，不敢上前饮酒……", 10000)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"还有谁要与乔某饮酒？")
	int_选择 = G.call("对话系统_显示主角选项","",{"姓乔的，我来与你饮一杯。", "（这乔峰正气凛然，我该助他一臂之力.)"})
	if int_选择 == 1 then 
		G.call("通用_设置全局标记",G.QueryName(0x1007001a),2)
		G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"乔某和天下英雄喝这绝交酒，乃是将往日恩义一笔勾销之意。凭你也配和我喝这绝交酒？你跟我有什么交情？要动手就来吧。你们就是千百人齐上，我乔峰何惧！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_聚贤庄_乔峰",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("场景系统_变色", 0xFFFFFF)
		G.call("场景系统_移除人物","乔峰")
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","游驹",0x5602003b,"不妙啊，乔峰那厮被人救走了，武林从此该多事了。没想到的是这位少侠竟然神功盖世，能把号称“北乔峰”的家伙打退，我游某真是万分佩服。")
		G.call("对话系统_显示主角对话","乔峰也确实是江湖中的杰出英雄，我也是被逼无奈才出手。若不是胡汉不两立，真恨不得与他结为兄弟。")
		G.call("对话系统_显示NPC对话","游驹",0x5602003b,"乔峰那厮已受了重伤，看来非得精养几个月了。此间事已了，难得各位英雄齐聚，游某在庄内设下酒宴，席上大家在继续商讨日后如何对付乔峰的策略吧。")
		G.call("对话系统_显示主角对话","庄主好意在下心领，尚有要事在身，不便久留，告辞了。")
	elseif int_选择 == 2 then 
		G.call("通用_设置全局标记",G.QueryName(0x1007001a),1)
		G.call("对话系统_显示主角对话","乔兄，在下平日里好生敬仰你的为人。虽然你是契丹人，但是不曾做过一星半点对不起大宋的事。")
		G.call("对话系统_显示主角对话","别人不把你当朋友，我把你当朋友！如今大家对你有所偏见，以后定会真相大白，明白你的为人。你大可不必意气用事。")
		G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"在此危急关头，乔某还能结识你这样一位朋友，真是乔某的福分。")
		G.call("对话系统_显示主角对话","乔兄若不嫌弃，小弟愿与乔兄结为兄弟。誓要同生共死！")
		G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"哈，哈，哈。好兄弟！")
		G.call("对话系统_显示NPC对话","职业杀手",0x56020024,"你这小子和这乔峰竟敢当着天下英雄的面拜把子，真是不把我们放在眼里。老子就来看看你究竟有什么本事！")
		G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"兄弟小心！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_聚贤庄_杀手",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"果然有两下子，我来会会你！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_聚贤庄_何太冲",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","岳不群",0x5602000a,"华山岳不群讨教阁下高招！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_聚贤庄_岳不群",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","灭绝师太",0x5602003d,"小子不要猖狂！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_聚贤庄_灭绝",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"好兄弟，今日之事是我乔峰一手造成，乔某理应一人承担。能结识你这样的好兄弟，乔峰此生不枉了！我送你出去！")
		G.call("对话系统_显示主角对话","大哥！我们说好要共生死的，我岂能独活！")
	else 
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_长白山'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606001e)
	if G.call("场景系统_检查能否触发事件") then
		int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007001a))
		if int_标记 == 1 then 
			G.call("通用_设置全局标记",G.QueryName(0x1007001a),2)
			G.call("场景系统_添加静态人物",0x5602003a,0,95,"乔峰",nil)
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","这不是大哥吗？没想到你还活着，可想煞小弟了！")
			G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"好兄弟，哥哥也十分想念你啊。哪日聚贤庄一战，就在我即将筋疲力竭的时候，突然有位黑衣人把我救走了，后来我就昏迷了好几日，到现在也不知道那位大恩人是谁。")
			G.call("对话系统_显示主角对话","大哥怎么不回中原？何苦在这苦寒之地忍受煎熬。")
			G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"我身上始终流着契丹人的血，而且聚贤庄一战，又有多少豪杰命丧我手。中原虽大，却再无我立足之地。最新我在这里结识了一些女真族的朋友，他们待我不错，以后我就不再回中原了。")
			G.call("对话系统_显示主角对话","大哥文采武略天下罕有，就此归隐，岂不太可惜了。")
			G.call("对话系统_显示NPC对话","乔峰",0x5602003a,"老天开眼，让你我兄弟在此重逢。乔峰有你这样的好兄弟，死而无憾了。乔峰虽然已不是丐帮中人，却也不希望丐帮绝学就此失传。我现在传授你丐帮绝学-降龙十八掌。你要瞧好了！")
			G.call("场景系统_隐藏")
			G.call("场景系统_移除人物","乔峰")
			G.call("场景系统_显示指令按钮",{"离开"})
			G.call("场景系统_显示主界面",true)
			G.call("场景系统_显示")
			G.call("通知系统_显示系统提示","习得 [04]降龙十八掌")
			G.call("通用_学会武功",G.QueryName(0x1004000e))
			G.call("对话系统_显示主角对话","大哥怎么不见了？莫非大哥真的要决意隐居在这里，再也不见过去的江湖朋友了。")
		elseif G.call("通用_检查人物属性","等级",35,100) and G.call("通用_获取全局标记",G.QueryName(0x1007001b)) == 0 then 
			G.call("场景系统_添加静态人物",0x56020038,- 108,95,"天山童姥",nil)
			G.call("场景系统_添加静态人物",0x56020039,108,95,"李秋水",nil)
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","哇！太精彩了，两个女高人乒乒乓乓打得好不热闹！最难能可贵的是两个都这么“正点”，可惜左侧那个稚气未脱可能也就是十二三的女童吧;另一人恍若仙子入凡间，明艳不可方物……")
			G.call("对话系统_显示NPC对话","李秋水",0x56020039,"小哥，还愣着做什么！还不赶紧来帮忙。帮我料理了这个老妖婆，自然少不了你的好处！")
			G.call("对话系统_显示NPC对话","天山童姥",0x56020038,"老贱人！你别想在这位少侠身上打你的鬼算盘！少侠你若帮我收拾这个贱人，我会将我灵鹫宫的绝世神功传授给你！")
			int_选择 = G.call("对话系统_显示主角选项","我究竟该帮哪一方呢？",{"帮天山童姥。", "帮李秋水。"})
			if int_选择 == 1 then 
				G.call("对话系统_显示主角对话","这位美人前辈，我十分想学灵鹫宫的功夫，所以只好得罪了！")
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_长白山_李秋水",1)
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("场景系统_移除人物","天山童姥")
				G.call("场景系统_移除人物","李秋水")
				G.call("场景系统_添加静态人物",0x56020038,0,95,"天山童姥",nil)
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","天山童姥",0x56020038,"好小子，果然不负姥姥所托。你过来，姥姥现在传你灵鹫宫的绝世神功！")
				G.call("场景系统_隐藏")
				G.call("场景系统_显示")
				G.call("通知系统_显示系统提示","习得 [04]天山六阳掌")
				G.call("通用_学会武功",G.QueryName(0x1004000c))
				G.call("对话系统_显示主角对话","谢前辈授艺之恩。")
				G.call("对话系统_显示NPC对话","天山童姥",0x56020038,"姥姥最恨拖欠别人东西。你今日救了我，我传你套掌法，我们互不相欠。你速速离开，我现在要在这里静养！")
				G.call("对话系统_显示主角对话","是！")
			elseif int_选择 == 2 then 
				G.call("对话系统_显示主角对话","跟武功比起来，我更乐意为美女效劳！你要是再长个十年八年，或许也就能打动我了。现在只好得罪了！")
				G.call("场景系统_隐藏")
				enum_战斗结果_战斗结果 = G.call("战斗_长白山_童姥",1)
				if enum_战斗结果_战斗结果 == 0 then 
					G.call("通用_显示结束菜单")
					return 
				else 
				end
				G.call("场景系统_移除人物","天山童姥")
				G.call("场景系统_移除人物","李秋水")
				G.call("场景系统_添加静态人物",0x56020039,0,95,"李秋水",nil)
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","李秋水",0x56020039,"看来小哥果然很强！我来想想该奖赏你些什么呢？有了，你来看看这些做为谢礼怎么样？")
				G.call("场景系统_隐藏")
				G.call("场景系统_显示")
				G.call("通知系统_显示系统提示","习得 [04]北冥神功")
				G.call("通用_学会武功",G.QueryName(0x1004001d))
				G.call("通知系统_显示系统提示","获得 [04]黑玉断续膏[br][02]获得 [04]九花玉露丸[br][02]获得 [04]九转熊蛇丸")
				G.call("通用_变更物品数量",G.QueryName(0x10060017),3)
				G.call("通用_变更物品数量",G.QueryName(0x10060016),3)
				G.call("通用_变更物品数量",G.QueryName(0x10060015),3)
				G.call("对话系统_显示主角对话","我只是举手之劳，那能收这么重的礼，实在受之有愧。")
				G.call("对话系统_显示NPC对话","李秋水",0x56020039,"若在几十年前，你若救了我，给你的好处还远不止这些，不过现在我已经心灰意冷，除了“他”我谁也不会放在心上。你赶紧离开吧，我还要运功疗伤！")
				G.call("对话系统_显示主角对话","几十年前……几十年前……年龄真是女人最大的秘密阿。")
			else 
			end
			G.call("通用_设置全局标记",G.QueryName(0x1007001b),1)
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
			G.call("场景系统_显示指令按钮",{"离开"})
			G.call("场景系统_显示主界面",true)
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","这里常年积雪，果然是奇寒无比。还是等天气暖和点再来吧，现在冻也冻死了。")
		end
	else
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示")
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_昆仑派'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060022)
	G.call("场景系统_添加静态人物",0x5602003c,0,95,"何太冲",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","昆仑弟子",0x56020026,"启禀掌门，有一位自称能保治百病的少侠，请求来给五夫人治病。")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"这年头骗钱治病的庸医还算少了？要是这次治不好五姑，你也得跟这家伙一起受罚！")
	G.call("对话系统_显示NPC对话","昆仑弟子",0x56020026,"师父，这我也没把握……")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"小子！我先跟你说清楚，治得好本掌门不会亏待你;治不好，你可就要吃些苦头了。")
	G.call("对话系统_显示主角对话","我既然敢来，自然早有准备，掌门大可放心！现在请把五夫人请出来，叫我诊治一下。")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"好！把五夫人给请出来。")
	G.call("场景系统_添加静态人物",0x5602003f,0,- 20,"五姑娘",G.QueryName(0x10020004))
	G.call("对话系统_显示主角对话","（哇靠！这是谁家的猪头妖给跑出来了！）[br]请问掌门，五夫人相貌如此这般，莫非是整容手术失败了吗？")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"……[br]一个月前无缘无故就成这样。请了许多名医都无法看出端倪。不知道少侠是否有对症良策！")
	G.call("对话系统_显示主角对话","凭我多年的行医经验，五夫人这是中了慢性毒！要解此毒以目前的医疗手段是根本不可能的！")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"这么说，五姑的病是治不好了？")
	G.call("对话系统_显示主角对话","毒是解不了，但是我有办法将毒排出！")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"请少侠速施妙手！")
	G.call("对话系统_显示主角对话","看我的独门绝招！[br]保您养颜排毒补气养血滋阴壮阳！[br]还——我——漂——漂——拳！！！")
	G.call("场景系统_隐藏")
	G.call("场景系统_清空",nil)
	G.call("场景系统_显示")
	G.call("场景系统_播放序列帧动画",4,0,0)
	G.call("场景系统_播放序列帧动画",4,0,0)
	G.call("对话系统_显示主角对话","应该差不多了，再打就该毁容了！")
	G.call("场景系统_隐藏")
	G.call("场景系统_设置背景图片",0x56060022)
	G.call("场景系统_添加静态人物",0x5602003c,0,95,"何太冲",nil)
	G.call("场景系统_添加静态人物",0x56020040,0,- 20,"五姑",nil)
	G.call("场景系统_添加静态人物",0x5602003f,0,- 20,"五姑娘",nil)
	G.call("场景系统_显示")
	G.call("场景系统_播放通用动画","五姑娘",G.QueryName(0x1002000c),false)
	G.call("场景系统_移除人物","五姑娘")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"哇！五姑，你现在比以前还要漂亮！还要迷人！[br]神医果然妙手回春！何某之前多有得罪，请神医包涵。")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"这是200两纹银，就当作是神医的出诊费了。稍后摆下酒席，给神医接风洗尘，何某要尽地主之宜。")
	G.call("通用_变更人物属性","声望","增减",35)
	G.call("通用_变更人物属性","银两","增减",200)
	G.call("通用_设置全局标记",G.QueryName(0x10070005),1)
	G.call("对话系统_显示NPC对话","班淑娴",0x56020041,"何太冲，你好本事！竟然能找人解开我下的毒！")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"啊，夫人！！！是这小子自己闯进来非要给五姑看病，不关我的事！")
	G.call("对话系统_显示NPC对话","班淑娴",0x56020041,"哦，原来是这小子多管我昆仑派的闲事来着。[br]哼，就算是如此，你也难逃责罚！[br]你先给我把这臭小子给料理了！")
	G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"小子，地狱无门你自来投！[br]虽然你救了五姑，但是夫人命我教训你，你就认命吧。")
	G.call("对话系统_显示主角对话","堂堂昆仑掌门竟然无耻到这种程度！他们还不知会怎么折磨我，下一步该怎么办？")
	int_选择 = G.call("对话系统_显示主角选项","下一步该怎么办？",{"跟何太冲对招", "逃离昆仑派"})
	if int_选择 == 1 then 
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_昆仑_何太冲",1)
		if enum_战斗结果_战斗结果 == 0 then 
			if G.call('通用_检查人物属性', '福缘', 80, 100) then
				G.call("场景系统_切换剧本",{n = 0, "剧情_昆仑仙境_救猿"})
			else
				G.call("通用_显示结束菜单")
			end
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","何太冲",0x5602003c,"少侠果然技高一筹，何某甘拜下风，任凭少侠处置！")
		int_选择 = G.call("对话系统_显示主角选项","下一步该怎么办？",{"杀何太冲夫妇！", "离开昆仑派。"})
		if int_选择 == 1 then 
			G.call("通用_设置全局标记",G.QueryName(0x10070005),2)
			G.call("通用_变更人物属性","声望","增减",200)
			G.call("通用_变更人物属性","侠义","增减",- 15)
			G.call("通用_变更人物属性","杀孽","增减",2)
			G.call("场景系统_变色",255.0)
			G.call("场景系统_移除人物","何太冲")
			G.call("场景系统_移除人物","五姑")
			G.call("对话系统_显示主角对话","这就是你们忘恩负义的下场！")
		else 
			G.call("通用_变更人物属性","声望","增减",50)
			G.call("通用_变更人物属性","侠义","增减",5)
		end
	else 
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_昆仑仙境_救猿'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060005)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","我怎么躺在这个地方？想起来了，我和何太冲那家伙打架，最后他用内力把我打落了悬崖。幸逢我大难不死！呵呵。老天有眼啊！")
	G.call("对话系统_显示主角对话","这里是什么地方？[br]鸟语花香，仿佛世外桃源一般！")
	G.call("通用_播放音效",0x49000029)
	G.call("通用_延时",1000)
	G.call("对话系统_显示主角对话","这是什么东西的叫声？竟然如此凄惨。")
	G.call("场景系统_隐藏")
	G.call("场景系统_添加静态人物",0x56020050,0,95,"白猿",nil)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","原来是这里的一只大白猿在叫唤。似乎它腹部有一个正在流脓的大疮，可能它是因此疼痛。")
	G.call("对话系统_显示主角对话","你是想请我帮你祛除这个大恶疮吗？")
	G.call("对话系统_显示主角对话","想不到我堂堂妙手神医，近日却要改行做兽医。真是老天捉弄人。")
	G.call("场景系统_隐藏")
	G.call("场景系统_显示")
	G.call("通用_播放音效",0x49000029)
	G.call("对话系统_显示主角对话","原来白猿腹内有本油布包裹的书册，压住血脉运行，以致腹肌腐烂。也不知识何人何故要把这书册藏于猿腹内？")
	G.call("通用_变更物品数量",G.QueryName(0x10060039),1)
	G.call("通知系统_显示系统提示","获得[04]《九阳真经》")
	G.call("对话系统_显示主角对话","原来是传说中的九阳神功！现在世道人心险恶，出去也是受人欺负，不如就在这昆仑仙境好好修炼神功。")
	G.call("对话系统_显示主角对话","他日功成后，我就可以打遍天下无敌手了！")
	G.call("通用_变更物品数量",G.QueryName(0x1006001c),2)
	G.call("通知系统_显示系统提示","获得[04]昆仑蟠桃")
	G.call("对话系统_显示主角对话","呵呵，你是看我治好了你的病，来付诊金了吧。真想不到连畜牲都懂得知恩图报，有的人却连畜牲也不如！")
	G.call("场景系统_切换剧本",{n = 0, "剧情_昆仑仙境"})
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_昆仑仙境'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060005)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_添加交互人物",0x56020050,245,120,"白猿")
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "白猿" then 
			G.call("对话系统_显示主角对话","老白猿，今天咱们一起练功怎么样？")
			G.call("场景系统_隐藏")
			G.call("战斗_昆仑_白猿")
			G.call("场景系统_显示")
		elseif string_标识名称 == "休息" then 
			G.call("场景系统_休息")
		elseif string_标识名称 == "离开" then 
			G.call("对话系统_显示主角对话","今日我即得神功，一定是老天保佑，以后再也不必怕江湖上那些卑鄙小人。只是这昆仑仙境，不知何年何月，才能再度回到这里。")
			G.call("场景系统_隐藏")
			G.call("场景系统_移除人物","白猿")
			G.call("场景系统_添加静态人物",0x56020050,0,95,"白猿",nil)
			G.call("场景系统_显示")
			G.call("对话系统_显示主角对话","老白猿，你舍不得我走吗？我跟你们不一样，可以整天在山谷中无忧无虑。我还有许多人生的大事没有办理，所以不能再在这里呆下去了。")
			G.call("通用_变更物品数量",G.QueryName(0x1006001c),2)
			G.call("通知系统_显示系统提示","获得[04]昆仑蟠桃")
			G.call("对话系统_显示主角对话","老白猿多谢了，后会有期！")
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_青城派'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060016)
	int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007000c))
	if int_标记 <= 3 then 
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","青城弟子",0x56020026,"好小子！当真以为我青城派无人了吗，今天叫你有来无回！")
		for int_i = 1, 5, 1 do 
			G.call("对话系统_显示NPC对话","青城弟子",0x56020026,"大家一齐上！合伙宰了这臭小子！")
			G.call("对话系统_显示主角对话","跟捅了马蜂窝似的，怎么小角色越聚越多？有胆就放马过来吧！")
			G.call("场景系统_隐藏")
			enum_战斗结果_战斗结果 = G.call("战斗_青城_弟子",1)
			if enum_战斗结果_战斗结果 == 0 then 
				G.call("通用_显示结束菜单")
				return 
			else 
			end
			G.call("通用_变更人物属性","杀孽","增减",1)
			if int_i < 5 then 
				G.call("场景系统_显示")
				G.call("对话系统_显示NPC对话","青城弟子",0x56020026,"看不出你还真有两下子。看你还能不能挡住这波攻击！")
			else 
			end
		end
		if true then 
			G.call("场景系统_添加静态人物",0x56020028,0,95,"余沧海",nil)
			G.call("场景系统_显示")
		else 
		end
		G.call("对话系统_显示NPC对话","余沧海",0x56020028,"想不到青城派建派上百年，今天你是第一个敢闯上山的！我青城派与你无仇无怨，为何如此作为？")
		G.call("对话系统_显示主角对话","余矮子，你别装蒜了！我是来替林家讨还公道的。")
		G.call("对话系统_显示NPC对话","余沧海",0x56020028,"别说那么正义凛然。你不过也是觊觎林家的辟邪剑谱而已。我费那么大周折才擒到林家夫妇，想不到让木高峰捡了现成便宜。想必他已套出剑谱下落，自己躲入山已开始修炼了。")
		G.call("对话系统_显示主角对话","嘿嘿。你俩是一路货色！木驼子已然伏诛，恶人就剩下你一个，拿命来吧！")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_青城_余沧海",1)
		if enum_战斗结果_战斗结果 == 0 then 
			G.call("通用_显示结束菜单")
			return 
		else 
		end
		G.call("场景系统_显示")
		G.call("对话系统_显示NPC对话","余沧海",0x56020028,"原来世上除了辟邪剑法，还有如此精妙的武功。余某死在阁下手中，也可死而瞑目了。")
		int_选择 = G.call("对话系统_显示主角选项","",{"杀余沧海！", "不杀余沧海！"})
		if int_选择 == 1 then 
			G.call("通用_变更人物属性","声望","增减",80)
			G.call("通用_设置全局标记",G.QueryName(0x1007000c),4)
			G.call("通用_变更人物属性","杀孽","增减",1)
			G.call("对话系统_显示NPC对话","余沧海",0x56020028,"青城余沧海，为了区区剑谱，败坏了青城百年基业，死后无颜面对各位师尊前辈！余某唯有以死谢罪了！呃……")
			G.call("场景系统_移除人物","余沧海")
			G.call("对话系统_显示主角对话","灭人全家，夺人家业，就算是一派之主，也是死有余辜！青城事已了，我该告诉林少侠这件喜事。")
		else 
			G.call("对话系统_显示NPC对话","余沧海",0x56020028,"不要以为饶我性命余某就会感激你！下次你有胆再来，定要你死无全尸！！！")
			G.call("对话系统_显示主角对话","青城之主果然是个小人！今日我不想血洗青城，暂时留你多活几日，日后我定会再来讨教青城派的高招！告辞了！")
		end
		G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
		return 
	else 
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
		G.call("对话系统_显示主角对话","诺大个青城派自从被我剿灭后，就此一蹶不振。也算是为福威镖局出了口恶气！")
	end
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_家'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060004)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020003,0,120,"[姓]母")
	G.call("场景系统_显示指令按钮",{"离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "[姓]母" then 
			if G.call("通用_检查人物属性","侠义",70,100) then 
				if G.call("通用_检查人物属性","声望",600,1000) then 
					G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"没想到你能做出那么多惊天动地的大事情，娘真为你感到骄傲。")
				else 
					G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"隔壁大婶昨天专程跑来告诉我，你最近作了不少好事情，好多人都在称赞你呢。")
				end
			elseif G.call("通用_检查人物属性","侠义",51,69) then 
				G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"隔壁大婶昨天专程跑来告诉我，你最近作了不少好事情，好多人都在称赞你呢。")
			elseif G.call("通用_检查人物属性","侠义",35,49) then 
				G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"近来乡亲们对你的言行议论纷纷，指指点点，你是不是在外面作了不好的事情？")
			elseif G.call("通用_检查人物属性","侠义",0,34) then 
				G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"听说你最近在外面闯了不少大祸，真是枉费为娘对你的一番教导。")
			else 
				G.call("对话系统_显示NPC对话","[姓]母",0x56020003,"先前那个庸医终于激起了民愤，被乡民群瓯致死。庸医害人无数，这也是他应得的下场。")
			end
		elseif string_标识名称 == "离开" then 
			G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
			return 
		else 
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山论剑'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000a)
	if G.call("通用_检查物品",G.QueryName(0x1006002e)) then 
		G.call("场景系统_添加静态人物",0x56020027,120,0,"匪兵甲",nil)
		G.call("场景系统_添加静态人物",0x56020034,- 120,0,"匪兵乙",nil)
		G.call("场景系统_添加静态人物",0x5602003b,0,95,"匪兵丙",nil)
		G.call("场景系统_显示")
		G.call("对话系统_显示主角对话","哇，今天这里好多人。长江后浪推前浪，一辈新人胜旧人，武林中一时豪杰辈出，竟然有这么多人我都不曾熟识，看来我未免有些井底之蛙夜郎自大了。")
		G.call("对话系统_显示NPC对话","匪兵甲",0x56020027,"大家且莫吵闹，乱打一起也非了局，这“武功天下第一”的称号，决不是叫叫嚷嚷便能得手的。今日各路好汉都已相聚于此，大伙儿何不便凭兵刃拳脚上见个雌雄？")
		G.call("对话系统_显示NPC对话","匪兵甲",0x56020027,"只要谁能长胜不败，大家便心悦诚服，公推他为“武功天下第一”。")
		G.call("对话系统_显示NPC对话","匪兵乙",0x56020034,"不错。武林中相传有“华山论剑”的韵事，咱们今日便来论他一论，且看当世英雄，到底是谁居首？")
		G.call("对话系统_显示NPC对话","匪兵丙",0x5602003b,"谁敢先上来跟我较量一番？")
		G.call("对话系统_显示NPC对话","匪兵丙",0x5602003b,"喂！不知死活的东西。老爷们在此比武论剑，争那武功天下第一的名号。你鬼鬼祟祟的干甚么？妄想偷学爷爷本门的绝世神功吗？来来来，爷爷扬威便在今日，先拿你来活动一下筋骨。")
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_论剑_匪兵")
		G.call("场景系统_显示")
		if enum_战斗结果_战斗结果 == 1 then
			G.call("对话系统_显示NPC对话","匪兵乙",0x56020034,"好功夫！看来今年的天下第一的称号非阁下莫属了。兄弟们，现在天下第一已经产生，下面，我们来角逐“天下第二”的称号。")
			G.call("对话系统_显示NPC对话","匪兵甲",0x56020027,"好！做不了第一，做个第二也是好的。今天来到这天下验证武学的巅峰之所，非要挣个名次不可！")
			G.call("对话系统_显示主角对话","我真的成了“天下第一”？难道就这么轻易成了“天下第一”？现在我身负惊天动地的绝世本领，难道普天下就再也找不到能和我较量的人了吗？")
			G.call("场景系统_隐藏")
			G.call("通知系统_显示全屏字幕", "    你终于在有生之年，达到了武学上的至高巅峰，然而世上也再无人能与你匹敌，此时的你才深刻体会到当年独孤求败的感受。自此，你不再过问江湖事，任何人也再没有见到你的踪影。有人猜测你是在无量山洞与神仙姐姐长相厮守；还是在昆仑仙境过着无忧无虑天上人间般的日子；抑或是回到剑冢，一人一雕享受着独孤前辈一样晚年的生活……其实，真正的你仍然过着如往常一样平凡的生活。[br]    然而，你的江湖并未因此而结束……", 10000)
			G.call("场景系统_切换剧本",{n = 0, "剧情_华山论剑_幻想"})
			return 
		else
			G.call("对话系统_显示主角对话","看来果然是强中自有强中手，想不到我一身通天彻底之能，却败在一个无名的小卒手里，我有何面目苟活在这个世上……")
			G.call("场景系统_隐藏")
			G.call("通知系统_显示全屏字幕", "    你一时间不能接受这个残酷的现实——竟然被一个无名小卒打败了。你自觉无颜存活于世，于是毅然决然的从华山之巅纵身跃下……[br]    数月后，有人说曾见路边一个和野狗抢食的乞丐，像极了当年那个在华山上自杀的家伙；也有人似乎见到他隐居山林，过着非人非兽的生活；更有传言，说他换了个马甲，继续行走江湖……[br]    总之，此后江湖上就没了你这号人物……", 10000)
			G.call("通用_显示开始菜单")
			return
		end
	else 
		G.call("场景系统_显示主界面",true)
		G.call("场景系统_显示指令按钮",{"离开"})
		G.call("场景系统_显示")
		G.call("对话系统_显示主角对话","看来今天这里并未召开传说中的华山论剑，以后得到通知再来吧。")
		while true do 
			string_标识名称 = G.call("场景系统_等待场景交互")
			if string_标识名称 == "离开" then 
				G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
				return 
			else 
			end
		end
	end
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_华山论剑_幻想'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x5606000a)
	G.call("场景系统_显示")
	G.call("对话系统_显示主角对话","咦？阔别多年怎么今天怎么又无意走到了这里，莫非是天意，今日此处有事发生？")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"哈哈，小鬼咱们又见面了。自从上次一别又有一年未见了吧。你以为上次你参加华山论剑争了天下第一就真的成了天下第一吗？须知天外有天，真正的高手是不屑参与这种名利争斗的。")
	G.call("对话系统_显示主角对话","依你这么说，我这天下第一岂不是名不符实，第一高手另有其人咯？")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"当今天下武功最强之人莫过于武当张真人，不过修道之人讲究清净无为，再加真人年事高迈实在不宜再参与争斗，但是自真人以下，英雄豪杰仍不胜枚举。")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"碰巧眼下便有几位，如果你能够打得赢，将会得到真正的好处。")
	G.call("场景系统_隐藏")
	enum_战斗结果_战斗结果 = G.call("战斗_论剑_乔峰")
	if enum_战斗结果_战斗结果 == 0 then
		G.call("通用_显示结束菜单")
		return
	else
	end
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"果然真的还有些本事，再来！")
	G.call("场景系统_隐藏")
	enum_战斗结果_战斗结果 = G.call("战斗_论剑_东方不败")
	if enum_战斗结果_战斗结果 == 0 then
		G.call("通用_显示结束菜单")
		return
	else
	end
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"哈哈，我就不信你能打得过此人！")
	G.call("场景系统_隐藏")
	enum_战斗结果_战斗结果 = G.call("战斗_论剑_无名僧")
	if enum_战斗结果_战斗结果 == 0 then
		G.call("通用_显示结束菜单")
		return
	else
	end
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"我这个汗啊！怎么这几个如此家伙如此脓包，看来只有玉树临风的本醋仙来亲自触手了。唉，牛逼了一世可不要打输才好……")
	G.call("场景系统_隐藏")
	enum_战斗结果_战斗结果 = G.call("战斗_论剑_神仙")
	if enum_战斗结果_战斗结果 == 0 then
		G.call("通用_显示结束菜单")
		return
	else
	end
	G.call("场景系统_显示")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"好吧，好吧。算你厉害！哈哈，我来给你这个很受期待的礼物吧。从此你便是真正的天下第一了。")
	G.call("通知系统_显示系统提示","[04]《金庸群侠传3》[02]超强初始档已建立")
	G.call("场景系统_隐藏")
	G.call("通用_显示开始菜单")
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_神仙劫道'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	local string_武功名称 = nil
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"此树是我栽，此路是我开，若要从此过，根本不可能！")
	G.call("对话系统_显示主角对话","你这人真是很霸道。我只是想打点野怪，混点经验而已。[br]你占用了一次的打怪机会，还这么蛮不讲理。今天我就好好的收拾你吧！")
	G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"最后给你一次机会，赶紧给我低头认错！否则我废你的武功，降你的属性，没收你的全部财产！")
	int_选择 = G.call("对话系统_显示主角选项","莫非他就是传说中的[03]游戏制作者[02]？我该怎么办呢？",{"TMD，老娘跟你拼了！", "小人知道错了，祝神仙大人大吉大利财源广进。"})
	if int_选择 == 1 then 
		G.call("场景系统_隐藏")
		enum_战斗结果_战斗结果 = G.call("战斗_主地图_神仙")
		G.call("场景系统_显示")
		if enum_战斗结果_战斗结果 == 1 then 
			int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007001c)) + 1
			G.call("通用_设置全局标记",G.QueryName(0x1007001c),int_标记)
			if int_标记 == 20 then 
				G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"能够胜我20次，说明你确实已经达到了一流高手的境界。你的武功花样甚多，不是我倚老卖老说一句，博采众家固然甚妙，但也不免驳而不纯。你最擅长的到底是哪一门功夫？")
				G.call("对话系统_显示主角对话","这……我该如何自创武功呢？")
				G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"虽然我非常鄙视你废寝忘食的追杀我30次，但是大人不记小人过。你若想创造适合自己特色的武功，需要把你之前所学融会贯通，然后全部忘记，一招一式随心所欲。")
				int_选择 = G.call("对话系统_显示主角选项","",{"就依照神仙醋所说的，创造自己的功夫。", "没有必要创造自己的功夫。"})
				if int_选择 == 1 then 
					string_武功名称 = G.call('通知系统_显示输入框并等待', "输入自创武功名称（限五个汉字）", 5)
					G.QueryName(0x10040008).名称 = string_武功名称
					G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"恭喜你终于悟出了自己的招数。不过我有种不祥的预感，你总有一天会用你新研究的这招来对付我的。")
					G.call("通用_遗忘所有武功")
					G.call("通用_学会武功",G.QueryName(0x10040008))
				else 
					G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"可惜可惜……孺子不可教也。")
				end
			else 
				G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"你竟然能打赢我！简直不可思议！我怀疑你使用作弊工具了，人品一定有问题，给你降一降吧。以后不服的话再来找我！")
				G.call("通用_变更人物属性","侠义","增减",- 1)
				G.call("通用_变更人物属性","声望","增减",10)
				G.call("对话系统_显示主角对话","代表全国人民鄙视你！")
			end
		else 
			G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"先前已经警告你了，本人很生气，后果很严重！")
			G.call("通用_变更人物属性","力道","增减",- 10)
			G.call("通用_变更人物属性","身法","增减",- 5)
			G.call("通用_变更人物属性","护体","增减",- 10)
			G.call("通用_变更人物属性","医疗","增减",- 5)
			G.call("通用_变更人物属性","用毒","增减",- 5)
			G.call("通用_变更人物属性","解毒","增减",- 5)
			G.call("通用_变更人物属性","拳掌","增减",- 5)
			G.call("通用_变更人物属性","御剑","增减",- 5)
			G.call("通用_变更人物属性","暗器","增减",- 5)
			G.call("通用_变更人物属性","银两","设为",0)
		end
	else 
		int_标记 = G.call("通用_获取全局标记",G.QueryName(0x1007001d)) + 1
		G.call("通用_设置全局标记",G.QueryName(0x1007001d),int_标记)
		if int_标记 == 20 then 
			G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"时间过得真快，转眼你已经给我磕过几十次头了，为了纪念这个令人欣慰的日子，我打算满足你一个愿望。")
			int_选择 = G.call("对话系统_显示主角选项","",{"我要很多很多的钱。", "我希望学成绝世武功。", "我想成为天下第一。", "我需要一些学习点。"})
			if int_选择 == 1 then 
				G.call("通用_变更人物属性","银两","增减",5000)
			elseif int_选择 == 2 then 
				G.call("通用_学会武功",G.QueryName(0x1004001f))
			elseif int_选择 == 3 then 
				o_role_主角.称号 = "天下第一"
			else 
				G.call("通用_变更人物属性","学点","增减",5)
			end
		else 
			G.call("对话系统_显示NPC对话","半瓶神仙醋",0x56020051,"一定要记着，心诚则灵。经常多多祝福我，会好人有好报的。")
		end
	end
	G.call("场景系统_切换剧本",{n = 0, "剧情_主地图"})
	return 
end
--type=剧本
--private=false
--ret=o_drama
t['剧情_模板'] = function()
	local int_选择 = 0
	local int_标记 = 0
	local string_标识名称 = nil
	local enum_战斗结果_战斗结果 = nil
	local o_base_游戏数据 = G.QueryName(0x10050001)
	local o_role_主角 = o_base_游戏数据.主角
	G.call("场景系统_隐藏")
	G.call("通用_停止所有声音")
	G.call("场景系统_清空")
	G.call("场景系统_设置背景图片",0x56060003)
	G.call("场景系统_显示主界面",true)
	G.call("场景系统_添加交互人物",0x56020002,245,120,"大夫")
	G.call("场景系统_显示指令按钮",{"休息", "离开"})
	G.call("场景系统_显示")
	while true do 
		string_标识名称 = G.call("场景系统_等待场景交互")
		if string_标识名称 == "大夫" then 
			break
		elseif string_标识名称 == "离开" then 
			break
		else 
			break
		end
	end
end
